espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_GAHBCFG_REG register
 *  This register can be used to configure the core after power-on or a change in mode.
 *  This register mainly contains AHB system-related configuration parameters. Do not
 *  change this register after the initial programming. The application must program
 *  this register before starting any transactions on either the AHB or the USB.
 */
#define USB_OTGHS_GAHBCFG_REG (DR_REG_USB_OTGHS_BASE + 0x8)
/** USB_OTGHS_GAHBCFG_GLBLINTRMSK : R/W; bitpos: [0]; default: 0;
 *  Mode: Host and device
 *  Global Interrupt Mask (GlblIntrMsk)
 *  The application uses this bit to mask or unmask the interrupt line assertion to
 *  itself. Irrespective of this bit's setting, the interrupt status registers are
 *  updated by the controller.
 */
#define USB_OTGHS_GAHBCFG_GLBLINTRMSK    (BIT(0))
#define USB_OTGHS_GAHBCFG_GLBLINTRMSK_M  (USB_OTGHS_GAHBCFG_GLBLINTRMSK_V << USB_OTGHS_GAHBCFG_GLBLINTRMSK_S)
#define USB_OTGHS_GAHBCFG_GLBLINTRMSK_V  0x00000001U
#define USB_OTGHS_GAHBCFG_GLBLINTRMSK_S  0
/** USB_OTGHS_GAHBCFG_HBSTLEN : R/W; bitpos: [4:1]; default: 0;
 *  Mode: Host and device
 *  Burst Length/Type (HBstLen)
 *  This field is used in both External and Internal DMA modes. In External DMA mode,
 *  these bits appear on dma_burst[3:0] ports, which can be used by an external wrapper
 *  to interface the External DMA Controller interface to Synopsis DW_ahb_dmac or ARM
 *  PrimeCell.
 *  External DMA Mode defines the DMA burst length in terms of 32-bit words:
 *  - 4'b0000: 1 word
 *  - 4'b0001: 4 words
 *  - 4'b0010: 8 words
 *  - 4'b0011: 16 words
 *  - 4'b0100: 32 words
 *  - 4'b0101: 64 words
 *  - 4'b0110: 128 words
 *  - 4'b0111: 256 words
 *  - Others: Reserved
 *  Internal DMA Mode AHB Master burst type:
 *  - 4'b0000 Single
 *  - 4'b0001 INCR
 *  - 4'b0011 INCR4
 *  - 4'b0101 INCR8
 *  - 4'b0111 INCR16
 *  - Others: Reserved
 */
#define USB_OTGHS_GAHBCFG_HBSTLEN    0x0000000FU
#define USB_OTGHS_GAHBCFG_HBSTLEN_M  (USB_OTGHS_GAHBCFG_HBSTLEN_V << USB_OTGHS_GAHBCFG_HBSTLEN_S)
#define USB_OTGHS_GAHBCFG_HBSTLEN_V  0x0000000FU
#define USB_OTGHS_GAHBCFG_HBSTLEN_S  1
/** USB_OTGHS_GAHBCFG_DMAEN : R/W; bitpos: [5]; default: 0;
 *  Mode: Host and device
 *  DMA Enable (DMAEn)
 *
 *  This bit is always 0 when Slave-Only mode has been selected.
 *
 *  Reset: 1'b0
 */
#define USB_OTGHS_GAHBCFG_DMAEN    (BIT(5))
#define USB_OTGHS_GAHBCFG_DMAEN_M  (USB_OTGHS_GAHBCFG_DMAEN_V << USB_OTGHS_GAHBCFG_DMAEN_S)
#define USB_OTGHS_GAHBCFG_DMAEN_V  0x00000001U
#define USB_OTGHS_GAHBCFG_DMAEN_S  5
/** USB_OTGHS_GAHBCFG_NPTXFEMPLVL : R/W; bitpos: [7]; default: 0;
 *  Mode: Host and device
 *  Non-Periodic TxFIFO Empty Level (NPTxFEmpLvl)
 *  This bit is used only in Slave mode. In host mode and with Shared FIFO with device
 *  mode, this bit indicates when the Non-Periodic TxFIFO Empty Interrupt bit in the
 *  Core Interrupt register (GINTSTS.NPTxFEmp) is triggered.
 *  With dedicated FIFO in device mode, this bit indicates when IN endpoint Transmit
 *  FIFO empty interrupt (DIEPINTn.TxFEmp) is triggered.
 *  Host mode and with Shared FIFO with device mode:
 *  - 1'b0: GINTSTS.NPTxFEmp interrupt indicates that the Non-Periodic TxFIFO is half
 *  empty
 *  - 1'b1: GINTSTS.NPTxFEmp interrupt indicates that the Non-Periodic TxFIFO is
 *  completely empty
 *  Dedicated FIFO in device mode:
 *  - 1'b0: DIEPINTn.TxFEmp interrupt indicates that the IN Endpoint TxFIFO is half
 *  empty
 *  - 1'b1: DIEPINTn.TxFEmp interrupt indicates that the IN Endpoint TxFIFO is
 *  completely empty
 */
#define USB_OTGHS_GAHBCFG_NPTXFEMPLVL    (BIT(7))
#define USB_OTGHS_GAHBCFG_NPTXFEMPLVL_M  (USB_OTGHS_GAHBCFG_NPTXFEMPLVL_V << USB_OTGHS_GAHBCFG_NPTXFEMPLVL_S)
#define USB_OTGHS_GAHBCFG_NPTXFEMPLVL_V  0x00000001U
#define USB_OTGHS_GAHBCFG_NPTXFEMPLVL_S  7
/** USB_OTGHS_GAHBCFG_PTXFEMPLVL : R/W; bitpos: [8]; default: 0;
 *  Mode: Host only
 *  Periodic TxFIFO Empty Level (PTxFEmpLvl)
 *  Indicates when the Periodic TxFIFO Empty Interrupt bit in the Core Interrupt
 *  register (GINTSTS.PTxFEmp) is triggered. This bit is used only in Slave mode.
 *  - 1'b0: GINTSTS.PTxFEmp interrupt indicates that the Periodic TxFIFO is half empty
 *  - 1'b1: GINTSTS.PTxFEmp interrupt indicates that the Periodic TxFIFO is completely
 *  empty
 */
#define USB_OTGHS_GAHBCFG_PTXFEMPLVL    (BIT(8))
#define USB_OTGHS_GAHBCFG_PTXFEMPLVL_M  (USB_OTGHS_GAHBCFG_PTXFEMPLVL_V << USB_OTGHS_GAHBCFG_PTXFEMPLVL_S)
#define USB_OTGHS_GAHBCFG_PTXFEMPLVL_V  0x00000001U
#define USB_OTGHS_GAHBCFG_PTXFEMPLVL_S  8
/** USB_OTGHS_GAHBCFG_REMMEMSUPP : R/W; bitpos: [21]; default: 0;
 *  Mode: Host and Device
 *  Remote Memory Support (RemMemSupp)
 *  This bit is programmed to enable the functionality to wait for the system DMA Done
 *  Signal for the DMA Write Transfers.
 *  - GAHBCFG.RemMemSupp=1
 *  The int_dma_req output signal is asserted when the DMA starts write transfer to the
 *  external memory. When the core is done with the Transfers it asserts int_dma_done
 *  signal to flag the completion of DMA writes from the controller. The core then
 *  waits for sys_dma_done signal from the system to proceed further and complete the
 *  Data Transfer corresponding to a particular Channel/Endpoint.
 *  - GAHBCFG.RemMemSupp=0
 *  The int_dma_req and int_dma_done signals are not asserted and the core proceeds
 *  with the assertion of the XferComp interrupt as soon as the DMA write transfer is
 *  done at the Core Boundary and it does not wait for the sys_dma_done signal to
 *  complete the DATA transfers.
 */
#define USB_OTGHS_GAHBCFG_REMMEMSUPP    (BIT(21))
#define USB_OTGHS_GAHBCFG_REMMEMSUPP_M  (USB_OTGHS_GAHBCFG_REMMEMSUPP_V << USB_OTGHS_GAHBCFG_REMMEMSUPP_S)
#define USB_OTGHS_GAHBCFG_REMMEMSUPP_V  0x00000001U
#define USB_OTGHS_GAHBCFG_REMMEMSUPP_S  21
/** USB_OTGHS_GAHBCFG_NOTIALLDMAWRIT : R/W; bitpos: [22]; default: 0;
 *  Mode: Host and Device
 *  Notify All DMA Write Transactions (NotiAllDmaWrit)
 *  This bit is programmed to enable the System DMA Done functionality for all the DMA
 *  write Transactions corresponding to the Channel/Endpoint. This bit is valid only
 *  when GAHBCFG.RemMemSupp is set to 1.
 *  - GAHBCFG.NotiAllDmaWrit = 1
 *  The core asserts int_dma_req for all the DMA write transactions on the AHB
 *  interface along with int_dma_done, chep_last_transact and chep_number signal
 *  information. The core waits for sys_dma_done signal for all the DMA write
 *  transactions in order to complete the transfer of a particular Channel/Endpoint.
 *  - GAHBCFG.NotiAllDmaWrit = 0
 *  The core asserts int_dma_req signal only for the last transaction of DMA write
 *  transfer corresponding to a particular Channel/Endpoint. Similarly, the core waits
 *  for sys_dma_done signal only for that transaction of DMA write to complete the
 *  transfer of a particular Channel/Endpoint.
 */
#define USB_OTGHS_GAHBCFG_NOTIALLDMAWRIT    (BIT(22))
#define USB_OTGHS_GAHBCFG_NOTIALLDMAWRIT_M  (USB_OTGHS_GAHBCFG_NOTIALLDMAWRIT_V << USB_OTGHS_GAHBCFG_NOTIALLDMAWRIT_S)
#define USB_OTGHS_GAHBCFG_NOTIALLDMAWRIT_V  0x00000001U
#define USB_OTGHS_GAHBCFG_NOTIALLDMAWRIT_S  22
/** USB_OTGHS_GAHBCFG_AHBSINGLE : R/W; bitpos: [23]; default: 0;
 *  Mode: Host and Device
 *  AHB Single Support (AHBSingle)
 *  This bit when programmed supports Single transfers for the remaining data in a
 *  transfer when the core is operating in DMA mode.
 *  - 1'b0: The remaining data in the transfer is sent using INCR burst size.
 *  - 1'b1: The remaining data in the transfer is sent using Single burst size.
 *  Note: If this feature is enabled, the AHB RETRY and SPLIT transfers still have INCR
 *  burst type. Enable this feature when the AHB Slave connected to the core does not
 *  support INCR burst (and when Split, and Retry transactions are not being used in
 *  the bus).
 */
#define USB_OTGHS_GAHBCFG_AHBSINGLE    (BIT(23))
#define USB_OTGHS_GAHBCFG_AHBSINGLE_M  (USB_OTGHS_GAHBCFG_AHBSINGLE_V << USB_OTGHS_GAHBCFG_AHBSINGLE_S)
#define USB_OTGHS_GAHBCFG_AHBSINGLE_V  0x00000001U
#define USB_OTGHS_GAHBCFG_AHBSINGLE_S  23
/** USB_OTGHS_GAHBCFG_INVDESCENDIANESS : R/W; bitpos: [24]; default: 0;
 *  Mode: Host and Device
 *  Invert Descriptor Endianness (InvDescEndianess)
 *  - 1'b0: Descriptor Endianness is same as AHB Master Endianness.
 *  - 1'b1:
 *  -- If the AHB Master endianness is Big Endian, the Descriptor Endianness is Little
 *  Endian.
 *  -- If the AHB Master endianness is Little Endian, the Descriptor Endianness is Big
 *  Endian.
 */
#define USB_OTGHS_GAHBCFG_INVDESCENDIANESS    (BIT(24))
#define USB_OTGHS_GAHBCFG_INVDESCENDIANESS_M  (USB_OTGHS_GAHBCFG_INVDESCENDIANESS_V << USB_OTGHS_GAHBCFG_INVDESCENDIANESS_S)
#define USB_OTGHS_GAHBCFG_INVDESCENDIANESS_V  0x00000001U
#define USB_OTGHS_GAHBCFG_INVDESCENDIANESS_S  24

