espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_GUSBCFG_REG register
 *  This register can be used to configure the core after power-on or when changing to
 *  Host mode or Device mode. It contains USB and USB-PHY related configuration
 *  parameters. The application must program this register before starting any
 *  transactions on either the AHB or the USB. If you are using the HSIC interface,
 *  HSIC PHY must be in reset while programming this register. Do not make changes to
 *  this register after the initial programming.
 */
#define USB_OTGHS_GUSBCFG_REG (DR_REG_USB_OTGHS_BASE + 0xc)
/** USB_OTGHS_GUSBCFG_TOUTCAL : R/W; bitpos: [2:0]; default: 0;
 *  Mode: Host and Device
 *  HS/FS Timeout Calibration (TOutCal)
 *
 *  The number of PHY clocks that the application programs in this field is added to
 *  the high-speed/full-speed interpacket timeout duration in the core to account for
 *  any additional delays introduced by the PHY. This can be required, because the
 *  delay introduced by the PHY in generating the linestate condition can vary from one
 *  PHY to another.
 *
 *  The USB standard timeout value for high-speed operation is 736 to 816 (inclusive)
 *  bit times. The USB standard timeout value for full-speed operation is 16 to 18
 *  (inclusive) bit times. The application must program this field based on the speed
 *  of enumeration. The number of bit times added per PHY clock are as follows:
 *
 *  High-speed operation:
 *  - One 30-MHz PHY clock = 16 bit times
 *  - One 60-MHz PHY clock = 8 bit times
 *  Full-speed operation:
 *  - One 30-MHz PHY clock = 0.4 bit times
 *  - One 60-MHz PHY clock = 0.2 bit times
 *  - One 48-MHz PHY clock = 0.25 bit times
 */
#define USB_OTGHS_GUSBCFG_TOUTCAL    0x00000007U
#define USB_OTGHS_GUSBCFG_TOUTCAL_M  (USB_OTGHS_GUSBCFG_TOUTCAL_V << USB_OTGHS_GUSBCFG_TOUTCAL_S)
#define USB_OTGHS_GUSBCFG_TOUTCAL_V  0x00000007U
#define USB_OTGHS_GUSBCFG_TOUTCAL_S  0
/** USB_OTGHS_GUSBCFG_PHYIF : R/W; bitpos: [3]; default: 0;
 *  Mode: Host and Device
 *  PHY Interface (PHYIf)
 *  The application uses this bit to configure the core to support a UTMI+ PHY with an
 *  8- or 16-bit interface. When a ULPI PHY is chosen, this must be Set to 8-bit mode.
 *  - 1'b0: 8 bits
 *  - 1'b1: 16 bits
 *  This bit is writable only If UTMI+ and ULPI were selected. Otherwise, this bit
 *  returns the value for the power-on interface selected during configuration.
 */
#define USB_OTGHS_GUSBCFG_PHYIF    (BIT(3))
#define USB_OTGHS_GUSBCFG_PHYIF_M  (USB_OTGHS_GUSBCFG_PHYIF_V << USB_OTGHS_GUSBCFG_PHYIF_S)
#define USB_OTGHS_GUSBCFG_PHYIF_V  0x00000001U
#define USB_OTGHS_GUSBCFG_PHYIF_S  3
/** USB_OTGHS_GUSBCFG_ULPI_UTMI_SEL : R/W; bitpos: [4]; default: 0;
 *  Mode: Host and Device
 *  ULPI or UTMI+ Select (ULPI_UTMI_Sel)
 *
 *  The application uses this bit to select either a UTMI+ interface or ULPI Interface.
 *  - 1'b0: UTMI+ Interface
 *  - 1'b1: ULPI Interface
 */
#define USB_OTGHS_GUSBCFG_ULPI_UTMI_SEL    (BIT(4))
#define USB_OTGHS_GUSBCFG_ULPI_UTMI_SEL_M  (USB_OTGHS_GUSBCFG_ULPI_UTMI_SEL_V << USB_OTGHS_GUSBCFG_ULPI_UTMI_SEL_S)
#define USB_OTGHS_GUSBCFG_ULPI_UTMI_SEL_V  0x00000001U
#define USB_OTGHS_GUSBCFG_ULPI_UTMI_SEL_S  4
/** USB_OTGHS_GUSBCFG_FSINTF : R/W; bitpos: [5]; default: 0;
 *  Mode: Host and Device
 *  Full-Speed Serial Interface Select (FSIntf)
 *
 *  The application uses this bit to select either a unidirectional or bidirectional
 *  USB 1.1 full-speed serial transceiver interface.
 *  - 1'b0: 6-pin unidirectional full-speed serial interface
 *  - 1'b1: 3-pin bidirectional full-speed serial interface
 *  If a USB 1.1 Full-Speed Serial Transceiver interface was not selected, this bit is
 *  always 0, with Write Only access. If a USB 1.1 FS interface was selected, Then the
 *  application can Set this bit to select between the 3- and 6-pin interfaces, and
 *  access is Read and Write.
 *
 *  Note: For supporting the new 4-pin bi-directional interface, you need to select
 *  6-pin unidirectional FS serial mode, and add an external control to convert it to a
 *  4-pin interface.
 */
#define USB_OTGHS_GUSBCFG_FSINTF    (BIT(5))
#define USB_OTGHS_GUSBCFG_FSINTF_M  (USB_OTGHS_GUSBCFG_FSINTF_V << USB_OTGHS_GUSBCFG_FSINTF_S)
#define USB_OTGHS_GUSBCFG_FSINTF_V  0x00000001U
#define USB_OTGHS_GUSBCFG_FSINTF_S  5
/** USB_OTGHS_GUSBCFG_PHYSEL : R/W; bitpos: [6]; default: 0;
 *  PHYSel
 *
 *  Mode: Host and Device
 *
 *  USB 2.0 High-Speed PHY or USB 1.1 Full-Speed Serial Transceiver Select (PHYSel)
 *  The application uses this bit to select either a high-speed UTMI+ or ULPI PHY, or a
 *  full-speed transceiver.
 *  - 1'b0: USB 2.0 high-speed UTMI+ or ULPI PHY
 *  - 1'b1: USB 1.1 full-speed serial transceiver
 *  If a USB 1.1 Full-Speed Serial Transceiver interface was not selected in, this bit
 *  is always 0, with Write Only access.
 *  If a high-speed PHY interface was not selected in, this bit is always 1, with Write
 *  Only access.
 *  If both interface types were selected (parameters have non-zero values), the
 *  application uses this bit to select which interface is active, and access is Read
 *  and Write.
 */
#define USB_OTGHS_GUSBCFG_PHYSEL    (BIT(6))
#define USB_OTGHS_GUSBCFG_PHYSEL_M  (USB_OTGHS_GUSBCFG_PHYSEL_V << USB_OTGHS_GUSBCFG_PHYSEL_S)
#define USB_OTGHS_GUSBCFG_PHYSEL_V  0x00000001U
#define USB_OTGHS_GUSBCFG_PHYSEL_S  6
/** USB_OTGHS_GUSBCFG_DDRSEL : R/W; bitpos: [7]; default: 0;
 *  Mode: Host and Device
 *  ULPI DDR Select (DDRSel)
 *  The application uses this bit to select a Single Data Rate (SDR) or Double Data
 *  Rate (DDR) or ULPI interface.
 *  - 1'b0: Single Data Rate ULPI Interface, with 8-bit-wide data bus
 *  - 1'b1: Double Data Rate ULPI Interface, with 4-bit-wide data bus
 */
#define USB_OTGHS_GUSBCFG_DDRSEL    (BIT(7))
#define USB_OTGHS_GUSBCFG_DDRSEL_M  (USB_OTGHS_GUSBCFG_DDRSEL_V << USB_OTGHS_GUSBCFG_DDRSEL_S)
#define USB_OTGHS_GUSBCFG_DDRSEL_V  0x00000001U
#define USB_OTGHS_GUSBCFG_DDRSEL_S  7
/** USB_OTGHS_GUSBCFG_USBTRDTIM : R/W; bitpos: [13:10]; default: 5;
 *  Mode: Device only
 *  USB Turnaround Time (USBTrdTim)
 *  Sets the turnaround time in PHY clocks. Specifies the response time for a MAC
 *  request to the Packet FIFO Controller (PFC) to fetch data from the DFIFO (SPRAM).
 *  This must be programmed to
 *  - 4'h5 : When the MAC interface is 16-bit UTMI+
 *  - 4'h9 : When the MAC interface is 8-bit UTMI+
 *  Note:Refer to Programming Guide Section Choosing the Value of GUSBCFG.USBTrdTim for
 *  the turnaround time calculation. During the AHB Clock Frequency selection, it is
 *  recommended to consider mis-sampling into account for USBTrdTim. USB turnaround
 *  time is critical for certification where long cables and 5-Hubs are used. If you
 *  need the AHB to run at less than 30 MHz (or less than 42MHz when operating in
 *  16-bit UTMI mode in HS speed), and if USB turnaround time is not critical, these
 *  bits can be programmed to a larger value.
 */
#define USB_OTGHS_GUSBCFG_USBTRDTIM    0x0000000FU
#define USB_OTGHS_GUSBCFG_USBTRDTIM_M  (USB_OTGHS_GUSBCFG_USBTRDTIM_V << USB_OTGHS_GUSBCFG_USBTRDTIM_S)
#define USB_OTGHS_GUSBCFG_USBTRDTIM_V  0x0000000FU
#define USB_OTGHS_GUSBCFG_USBTRDTIM_S  10
/** USB_OTGHS_GUSBCFG_PHYLPWRCLKSEL : R/W; bitpos: [15]; default: 0;
 *  PHY Low-Power Clock Select (PhyLPwrClkSel)
 *  Mode: Host and Device
 *  Selects either 480-MHz or 48-MHz (low-power) PHY mode. In FS and LS modes, the PHY
 *  can usually operate on a 48-MHz clock to save power.
 *  - 1'b0: 480-MHz Internal PLL clock
 *  - 1'b1: 48-MHz External Clock
 *  In 480 MHz mode, the UTMI interface operates at either 60 or 30-MHz, depending upon
 *  whether 8- or 16-bit data width is selected.
 *  In 48-MHz mode, the UTMI interface operates at 48 MHz in FS mode and at either 48
 *  or 6 MHz in LS mode (depending on the PHY vendor). This bit drives the
 *  utmi_fsls_low_power core output signal, and is valid only for UTMI+ PHYs.
 */
#define USB_OTGHS_GUSBCFG_PHYLPWRCLKSEL    (BIT(15))
#define USB_OTGHS_GUSBCFG_PHYLPWRCLKSEL_M  (USB_OTGHS_GUSBCFG_PHYLPWRCLKSEL_V << USB_OTGHS_GUSBCFG_PHYLPWRCLKSEL_S)
#define USB_OTGHS_GUSBCFG_PHYLPWRCLKSEL_V  0x00000001U
#define USB_OTGHS_GUSBCFG_PHYLPWRCLKSEL_S  15
/** USB_OTGHS_GUSBCFG_ULPIFSLS : R/W; bitpos: [17]; default: 0;
 *  Mode: Host and Device
 *  ULPI FS/LS Select (ULPIFsLs)
 *  The application uses this bit to select the FS/LS serial interface for the ULPI
 *  PHY. This bit is valid only when the FS serial transceiver is selected on the ULPI
 *  PHY.
 *  - 1'b0: ULPI interface
 *  - 1'b1: ULPI FS/LS serial interface
 *  Note: Before setting this bit, the application needs to ensure that
 *  GUSBCFG.ULPI_UTMI_SEL = 1'b1.
 */
#define USB_OTGHS_GUSBCFG_ULPIFSLS    (BIT(17))
#define USB_OTGHS_GUSBCFG_ULPIFSLS_M  (USB_OTGHS_GUSBCFG_ULPIFSLS_V << USB_OTGHS_GUSBCFG_ULPIFSLS_S)
#define USB_OTGHS_GUSBCFG_ULPIFSLS_V  0x00000001U
#define USB_OTGHS_GUSBCFG_ULPIFSLS_S  17
/** USB_OTGHS_GUSBCFG_ULPIAUTORES : R/W; bitpos: [18]; default: 0;
 *  Mode: Host and Device
 *  ULPI Auto Resume (ULPIAutoRes)
 *  This bit sets the AutoResume bit in the Interface Control register on the ULPI PHY.
 *  - 1'b0: PHY does not use AutoResume feature.
 *  - 1'b1: PHY uses AutoResume feature.
 */
#define USB_OTGHS_GUSBCFG_ULPIAUTORES    (BIT(18))
#define USB_OTGHS_GUSBCFG_ULPIAUTORES_M  (USB_OTGHS_GUSBCFG_ULPIAUTORES_V << USB_OTGHS_GUSBCFG_ULPIAUTORES_S)
#define USB_OTGHS_GUSBCFG_ULPIAUTORES_V  0x00000001U
#define USB_OTGHS_GUSBCFG_ULPIAUTORES_S  18
/** USB_OTGHS_GUSBCFG_ULPICLKSUSM : R/W; bitpos: [19]; default: 0;
 *  Mode: Host and Device
 *  ULPI Clock SuspendM (ULPIClkSusM)
 *  This bit sets the ClockSuspendM bit in the Interface Control register on the ULPI
 *  PHY. This bit applies only in serial or carkit modes.
 *  - 1'b0: PHY powers down internal clock during suspend.
 *  - 1'b1: PHY does not power down internal clock.
 */
#define USB_OTGHS_GUSBCFG_ULPICLKSUSM    (BIT(19))
#define USB_OTGHS_GUSBCFG_ULPICLKSUSM_M  (USB_OTGHS_GUSBCFG_ULPICLKSUSM_V << USB_OTGHS_GUSBCFG_ULPICLKSUSM_S)
#define USB_OTGHS_GUSBCFG_ULPICLKSUSM_V  0x00000001U
#define USB_OTGHS_GUSBCFG_ULPICLKSUSM_S  19
/** USB_OTGHS_GUSBCFG_ULPIEXTVBUSDRV : R/W; bitpos: [20]; default: 0;
 *  Mode: Host only
 *  ULPI External VBUS Drive (ULPIExtVbusDrv)
 *  This bit selects between internal or external supply to drive 5V on VBUS, in ULPI
 *  PHY.
 *  - 1'b0: PHY drives VBUS using internal charge pump (Default).
 *  - 1'b1: PHY drives VBUS using external supply.
 */
#define USB_OTGHS_GUSBCFG_ULPIEXTVBUSDRV    (BIT(20))
#define USB_OTGHS_GUSBCFG_ULPIEXTVBUSDRV_M  (USB_OTGHS_GUSBCFG_ULPIEXTVBUSDRV_V << USB_OTGHS_GUSBCFG_ULPIEXTVBUSDRV_S)
#define USB_OTGHS_GUSBCFG_ULPIEXTVBUSDRV_V  0x00000001U
#define USB_OTGHS_GUSBCFG_ULPIEXTVBUSDRV_S  20
/** USB_OTGHS_GUSBCFG_ULPIEXTVBUSINDICATOR : R/W; bitpos: [21]; default: 0;
 *  Mode: Host only
 *  ULPI External VBUS Indicator (ULPIExtVbusIndicator)
 *  This bit indicates to the ULPI PHY to use an external VBUS overcurrent indicator.
 *  - 1'b0: PHY uses internal VBUS valid comparator.
 *  - 1'b1: PHY uses external VBUS valid comparator.
 */
#define USB_OTGHS_GUSBCFG_ULPIEXTVBUSINDICATOR    (BIT(21))
#define USB_OTGHS_GUSBCFG_ULPIEXTVBUSINDICATOR_M  (USB_OTGHS_GUSBCFG_ULPIEXTVBUSINDICATOR_V << USB_OTGHS_GUSBCFG_ULPIEXTVBUSINDICATOR_S)
#define USB_OTGHS_GUSBCFG_ULPIEXTVBUSINDICATOR_V  0x00000001U
#define USB_OTGHS_GUSBCFG_ULPIEXTVBUSINDICATOR_S  21
/** USB_OTGHS_GUSBCFG_TERMSELDLPULSE : R/W; bitpos: [22]; default: 0;
 *  Mode: Device only
 *  TermSel DLine Pulsing Selection (TermSelDLPulse)
 *  This bit selects utmi_termselect to drive data line pulse during SRP.
 *  - 1'b0: Data line pulsing using utmi_txvalid (Default).
 *  - 1'b1: Data line pulsing using utmi_termsel.
 */
#define USB_OTGHS_GUSBCFG_TERMSELDLPULSE    (BIT(22))
#define USB_OTGHS_GUSBCFG_TERMSELDLPULSE_M  (USB_OTGHS_GUSBCFG_TERMSELDLPULSE_V << USB_OTGHS_GUSBCFG_TERMSELDLPULSE_S)
#define USB_OTGHS_GUSBCFG_TERMSELDLPULSE_V  0x00000001U
#define USB_OTGHS_GUSBCFG_TERMSELDLPULSE_S  22
/** USB_OTGHS_GUSBCFG_COMPLEMENT : R/W; bitpos: [23]; default: 0;
 *  Mode: Host only
 *  Indicator Complement Controls the PHY to invert the ExternalVbusIndicator input
 *  signal, generating the Complement Output. For more information, refer to the ULPI
 *  Specification.
 *  - 1'b0: PHY does not invert ExternalVbusIndicator signal
 *  - 1'b1: PHY does invert ExternalVbusIndicator signal
 *  This bit is reserved and read-only when OTG_HSPHY_INTERFACE is set to 0 or 1.
 */
#define USB_OTGHS_GUSBCFG_COMPLEMENT    (BIT(23))
#define USB_OTGHS_GUSBCFG_COMPLEMENT_M  (USB_OTGHS_GUSBCFG_COMPLEMENT_V << USB_OTGHS_GUSBCFG_COMPLEMENT_S)
#define USB_OTGHS_GUSBCFG_COMPLEMENT_V  0x00000001U
#define USB_OTGHS_GUSBCFG_COMPLEMENT_S  23
/** USB_OTGHS_GUSBCFG_INDICATOR : R/W; bitpos: [24]; default: 0;
 *  Mode: Host only
 *  Indicator Pass Through
 *  Controls whether the Complement Output is qualified with the Internal Vbus Valid
 *  comparator before being used in the Vbus State in the RX CMD. For more information,
 *  refer to the ULPI Specification.
 *  - 1'b0: Complement Output signal is qualified with the Internal VbusValid
 *  comparator.
 *  - 1'b1: Complement Output signal is not qualified with the Internal VbusValid
 *  comparator.
 *  This bit is reserved and read-only when OTG_HSPHY_INTERFACE is set to 0 or 1.
 */
#define USB_OTGHS_GUSBCFG_INDICATOR    (BIT(24))
#define USB_OTGHS_GUSBCFG_INDICATOR_M  (USB_OTGHS_GUSBCFG_INDICATOR_V << USB_OTGHS_GUSBCFG_INDICATOR_S)
#define USB_OTGHS_GUSBCFG_INDICATOR_V  0x00000001U
#define USB_OTGHS_GUSBCFG_INDICATOR_S  24
/** USB_OTGHS_GUSBCFG_ULPI : R/W; bitpos: [25]; default: 0;
 *  Mode: Host only
 *  ULPI Interface Protect Disable
 *  Controls circuitry built into the PHY for protecting the ULPI interface when the
 *  link tri-states STP and data. Any pull-ups or pull-downs employed by this feature
 *  can be disabled. For more information, refer to the ULPI Specification.
 *  - 1'b0: Enables the interface protect circuit
 *  - 1'b1: Disables the interface protect circuit
 */
#define USB_OTGHS_GUSBCFG_ULPI    (BIT(25))
#define USB_OTGHS_GUSBCFG_ULPI_M  (USB_OTGHS_GUSBCFG_ULPI_V << USB_OTGHS_GUSBCFG_ULPI_S)
#define USB_OTGHS_GUSBCFG_ULPI_V  0x00000001U
#define USB_OTGHS_GUSBCFG_ULPI_S  25
/** USB_OTGHS_GUSBCFG_IC_USBCAP : RO; bitpos: [26]; default: 0;
 *  Mode: Host and Device
 *  IC_USB-Capable (IC_USBCap)
 *  The application uses this bit to control the core's IC_USB capabilities.
 *  - 1'b0: IC_USB PHY Interface is not selected.
 *  - 1'b1: IC_USB PHY Interface is selected.
 *  This bit is writable only if OTG_ENABLE_IC_USB=1 and OTG_FSPHY_INTERFACE!=0.
 *  The reset value depends on the configuration parameter OTG_SELECT_IC_USB when
 *  OTG_ENABLE_IC_USB = 1. In all other cases, this bit is set to 1'b0 and the bit is
 *  read only.
 */
#define USB_OTGHS_GUSBCFG_IC_USBCAP    (BIT(26))
#define USB_OTGHS_GUSBCFG_IC_USBCAP_M  (USB_OTGHS_GUSBCFG_IC_USBCAP_V << USB_OTGHS_GUSBCFG_IC_USBCAP_S)
#define USB_OTGHS_GUSBCFG_IC_USBCAP_V  0x00000001U
#define USB_OTGHS_GUSBCFG_IC_USBCAP_S  26
/** USB_OTGHS_GUSBCFG_TXENDDELAY : R/W; bitpos: [28]; default: 1;
 *  Mode: Device only
 *  Tx End Delay (TxEndDelay)
 *  Setting this bit to 1'b1 enables the controller to follow the TxEndDelay timings as
 *  per UTMI+ specification 1.05 section 4.1.5 for opmode signal during remote wakeup.
 *  - 1'b0 : Normal Mode.
 *  - 1'b1 : Tx End delay.
 *  The default value of this field is 1'b1 and it is not recommended to program it to
 *  1'b0. The option to set it to 1'b0 (Normal Mode) is present only for debug purpose.
 */
#define USB_OTGHS_GUSBCFG_TXENDDELAY    (BIT(28))
#define USB_OTGHS_GUSBCFG_TXENDDELAY_M  (USB_OTGHS_GUSBCFG_TXENDDELAY_V << USB_OTGHS_GUSBCFG_TXENDDELAY_S)
#define USB_OTGHS_GUSBCFG_TXENDDELAY_V  0x00000001U
#define USB_OTGHS_GUSBCFG_TXENDDELAY_S  28
/** USB_OTGHS_GUSBCFG_FORCEHSTMODE : R/W; bitpos: [29]; default: 0;
 *  Mode: Host and device
 *  Force Host Mode (ForceHstMode)
 *  Writing a 1 to this bit forces the core to host mode irrespective of utmiotg_iddig
 *  input pin.
 *  - 1'b0 : Normal Mode.
 *  - 1'b1 : Force Host Mode.
 *  After setting the force bit, the application must wait at least 25 ms before the
 *  change to take effect. When the simulation is in scale down mode, waiting for 500
 *  micro sec is sufficient. This bit is valid only when OTG_MODE = 0, 1 or 2. In all
 *  other cases, this bit reads 0.
 */
#define USB_OTGHS_GUSBCFG_FORCEHSTMODE    (BIT(29))
#define USB_OTGHS_GUSBCFG_FORCEHSTMODE_M  (USB_OTGHS_GUSBCFG_FORCEHSTMODE_V << USB_OTGHS_GUSBCFG_FORCEHSTMODE_S)
#define USB_OTGHS_GUSBCFG_FORCEHSTMODE_V  0x00000001U
#define USB_OTGHS_GUSBCFG_FORCEHSTMODE_S  29
/** USB_OTGHS_GUSBCFG_FORCEDEVMODE : R/W; bitpos: [30]; default: 0;
 *  Mode:Host and device
 *  Force Device Mode (ForceDevMode)
 *  Writing a 1 to this bit forces the controller to device mode irrespective of
 *  utmiotg_iddig input pin.
 *  - 1'b0 : Normal Mode.
 *  - 1'b1 : Force Device Mode.
 *  After setting the force bit, the application must wait at least 25 ms before the
 *  change to take effect. When the simulation is in scale down mode, waiting for 500
 *  micro sec is sufficient. This bit is valid only when OTG_MODE = 0, 1 or 2. In all
 *  other cases, this bit reads 0.
 */
#define USB_OTGHS_GUSBCFG_FORCEDEVMODE    (BIT(30))
#define USB_OTGHS_GUSBCFG_FORCEDEVMODE_M  (USB_OTGHS_GUSBCFG_FORCEDEVMODE_V << USB_OTGHS_GUSBCFG_FORCEDEVMODE_S)
#define USB_OTGHS_GUSBCFG_FORCEDEVMODE_V  0x00000001U
#define USB_OTGHS_GUSBCFG_FORCEDEVMODE_S  30
/** USB_OTGHS_GUSBCFG_CORRUPTTXPKT : R/W; bitpos: [31]; default: 0;
 *  Mode: Host and device
 *  Corrupt Tx packet (CorruptTxPkt)
 *  This bit is for debug purposes only. Never Set this bit to 1. The application must
 *  always write 1'b0 to this bit.
 */
#define USB_OTGHS_GUSBCFG_CORRUPTTXPKT    (BIT(31))
#define USB_OTGHS_GUSBCFG_CORRUPTTXPKT_M  (USB_OTGHS_GUSBCFG_CORRUPTTXPKT_V << USB_OTGHS_GUSBCFG_CORRUPTTXPKT_S)
#define USB_OTGHS_GUSBCFG_CORRUPTTXPKT_V  0x00000001U
#define USB_OTGHS_GUSBCFG_CORRUPTTXPKT_S  31

