espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_GINTSTS_REG register
 *  This register interrupts the application for system-level events in the current
 *  mode (Device mode or Host mode). Some of the bits in this register are valid only
 *  in Host mode, while others are valid in Device mode only. This register also
 *  indicates the current mode. To clear the interrupt status bits of type R_SS_WC, the
 *  application must write 1'b1 to the bit. The FIFO status interrupts are read only;
 *  once software reads from or writes to the FIFO while servicing these interrupts,
 *  FIFO interrupt conditions are cleared automatically. The application must clear the
 *  GINTSTS register at initialization before unmasking the interrupt bit to avoid any
 *  interrupts generated prior to initialization.  Note: Read the reset value of
 *  GINTSTS.CurMod only after the following conditions:  - If IDDIG_FILTER is disabled,
 *  read only after PHY clock is stable.  - If IDDIG_FILTER is enabled, read only after
 *  the filter timer expires.
 */
#define USB_OTGHS_GINTSTS_REG (DR_REG_USB_OTGHS_BASE + 0x14)
/** USB_OTGHS_GINTSTS_CURMOD : RO; bitpos: [0]; default: 0;
 *  Mode: Host and Device
 *  Current Mode of Operation (CurMod)
 *  Indicates the current mode.
 *  - 1'b0: Device mode
 *  - 1'b1: Host mode
 *
 *
 *  Note: The reset value of this register field can be read only after the PHY clock
 *  is stable, or if IDDIG_FILTER is enabled, wait for the filter timer to expire to
 *  read the correct reset value which ever event is later.
 */
#define USB_OTGHS_GINTSTS_CURMOD    (BIT(0))
#define USB_OTGHS_GINTSTS_CURMOD_M  (USB_OTGHS_GINTSTS_CURMOD_V << USB_OTGHS_GINTSTS_CURMOD_S)
#define USB_OTGHS_GINTSTS_CURMOD_V  0x00000001U
#define USB_OTGHS_GINTSTS_CURMOD_S  0
/** USB_OTGHS_GINTSTS_MODEMIS : R/W; bitpos: [1]; default: 0;
 *  Mode: Host and Device
 *  Mode Mismatch Interrupt (ModeMis)
 *  The core sets this bit when the application is trying to access:
 *  - A Host mode register, when the controller is operating in Device mode
 *  - A Device mode register, when the controller is operating in Host mode
 *  The register access is completed on the AHB with an OKAY response, but is ignored
 *  by the controller internally and does not affect the operation of the controller.
 *  This bit can be set only by the core and the application must write 1 to clear it.
 */
#define USB_OTGHS_GINTSTS_MODEMIS    (BIT(1))
#define USB_OTGHS_GINTSTS_MODEMIS_M  (USB_OTGHS_GINTSTS_MODEMIS_V << USB_OTGHS_GINTSTS_MODEMIS_S)
#define USB_OTGHS_GINTSTS_MODEMIS_V  0x00000001U
#define USB_OTGHS_GINTSTS_MODEMIS_S  1
/** USB_OTGHS_GINTSTS_OTGINT : RO; bitpos: [2]; default: 0;
 *  Mode: Host and Device
 *  OTG Interrupt (OTGInt)
 *  The controller sets this bit to indicate an OTG protocol event. The application
 *  must read the OTG Interrupt Status (GOTGINT) register to determine the exact event
 *  that caused this interrupt. The application must clear the appropriate status bit
 *  in the GOTGINT register to clear this bit.
 */
#define USB_OTGHS_GINTSTS_OTGINT    (BIT(2))
#define USB_OTGHS_GINTSTS_OTGINT_M  (USB_OTGHS_GINTSTS_OTGINT_V << USB_OTGHS_GINTSTS_OTGINT_S)
#define USB_OTGHS_GINTSTS_OTGINT_V  0x00000001U
#define USB_OTGHS_GINTSTS_OTGINT_S  2
/** USB_OTGHS_GINTSTS_SOF : R/W; bitpos: [3]; default: 0;
 *  Mode: Host and Device
 *  Start of (micro)Frame (Sof)
 *
 *  In Host mode, the core sets this bit to indicate that an SOF (FS), micro-SOF (HS),
 *  or Keep-Alive (LS) is transmitted on the USB. The application must write a 1 to
 *  this bit to clear the interrupt.
 *
 *  In Device mode, the controller sets this bit to indicate that an SOF token has been
 *  received on the USB. The application can read the Device Status register to get the
 *  current (micro)Frame number. This interrupt is seen only when the core is operating
 *  at either HS or FS. This bit can be set only by the core and the application must
 *  write 1 to clear it.
 *
 *  Note: This register may return 1'b1 if read immediately after power-on reset.
 *  If the register bit reads 1'b1 immediately after power-on reset, it does not
 *  indicate that an SOF has been sent (in case of host mode) or SOF has been received
 *  (in case of device mode).
 *  The read value of this interrupt is valid only after a valid connection between
 *  host and device is established. If the bit is set after power on reset the
 *  application can clear the bit.
 */
#define USB_OTGHS_GINTSTS_SOF    (BIT(3))
#define USB_OTGHS_GINTSTS_SOF_M  (USB_OTGHS_GINTSTS_SOF_V << USB_OTGHS_GINTSTS_SOF_S)
#define USB_OTGHS_GINTSTS_SOF_V  0x00000001U
#define USB_OTGHS_GINTSTS_SOF_S  3
/** USB_OTGHS_GINTSTS_RXFLVL : RO; bitpos: [4]; default: 0;
 *  Mode: Host and Device
 *  RxFIFO Non-Empty (RxFLvl)
 *
 *  Indicates that there is at least one packet pending to be read from the RxFIFO.
 */
#define USB_OTGHS_GINTSTS_RXFLVL    (BIT(4))
#define USB_OTGHS_GINTSTS_RXFLVL_M  (USB_OTGHS_GINTSTS_RXFLVL_V << USB_OTGHS_GINTSTS_RXFLVL_S)
#define USB_OTGHS_GINTSTS_RXFLVL_V  0x00000001U
#define USB_OTGHS_GINTSTS_RXFLVL_S  4
/** USB_OTGHS_GINTSTS_NPTXFEMP : RO; bitpos: [5]; default: 1;
 *  Mode: Host and Device
 *  Non-periodic TxFIFO Empty (NPTxFEmp)
 *  This interrupt is asserted when the Non-periodic TxFIFO is either half or
 *  completely empty, and there is space for at least one Entry to be written to the
 *  Non-periodic Transmit Request Queue. The half or completely empty status is
 *  determined by the Non-periodic TxFIFO Empty Level bit in the Core AHB Configuration
 *  register (GAHBCFG.NPTxFEmpLvl).
 *  In host mode, the application can use GINTSTS.NPTxFEmp with the OTG_EN_DED_TX_FIFO
 *  parameter set to either 1 or 0.
 *  In device mode, the application uses GINTSTS.NPTxFEmp when OTG_EN_DED_TX_FIFO=0.
 *  When OTG_EN_DED_TX_FIFO=1, the application uses DIEPINTn.TxFEmp.
 */
#define USB_OTGHS_GINTSTS_NPTXFEMP    (BIT(5))
#define USB_OTGHS_GINTSTS_NPTXFEMP_M  (USB_OTGHS_GINTSTS_NPTXFEMP_V << USB_OTGHS_GINTSTS_NPTXFEMP_S)
#define USB_OTGHS_GINTSTS_NPTXFEMP_V  0x00000001U
#define USB_OTGHS_GINTSTS_NPTXFEMP_S  5
/** USB_OTGHS_GINTSTS_GINNAKEFF : RO; bitpos: [6]; default: 0;
 *  Mode: Device only
 *  Global IN Non-periodic NAK Effective (GINNakEff)
 *  Indicates that the Set Global Non-periodic IN NAK bit in the Device Control
 *  register (DCTL.SGNPInNak) set by the application, has taken effect in the core.
 *  That is, the core has sampled the Global IN NAK bit Set by the application. This
 *  bit can be cleared by clearing the Clear Global Non-periodic IN NAK bit in the
 *  Device Control register (DCTL.CGNPInNak). This interrupt does not necessarily mean
 *  that a NAK handshake
 *  is sent out on the USB. The STALL bit takes precedence over the NAK bit.
 */
#define USB_OTGHS_GINTSTS_GINNAKEFF    (BIT(6))
#define USB_OTGHS_GINTSTS_GINNAKEFF_M  (USB_OTGHS_GINTSTS_GINNAKEFF_V << USB_OTGHS_GINTSTS_GINNAKEFF_S)
#define USB_OTGHS_GINTSTS_GINNAKEFF_V  0x00000001U
#define USB_OTGHS_GINTSTS_GINNAKEFF_S  6
/** USB_OTGHS_GINTSTS_GOUTNAKEFF : RO; bitpos: [7]; default: 0;
 *  Mode: Device only
 *  Global OUT NAK Effective (GOUTNakEff)
 *  Indicates that the Set Global OUT NAK bit in the Device Control register
 *  (DCTL.SGOUTNak), Set by the application, has taken effect in the core. This bit can
 *  be cleared by writing the Clear Global OUT NAK bit in the Device Control register
 *  (DCTL.CGOUTNak).
 */
#define USB_OTGHS_GINTSTS_GOUTNAKEFF    (BIT(7))
#define USB_OTGHS_GINTSTS_GOUTNAKEFF_M  (USB_OTGHS_GINTSTS_GOUTNAKEFF_V << USB_OTGHS_GINTSTS_GOUTNAKEFF_S)
#define USB_OTGHS_GINTSTS_GOUTNAKEFF_V  0x00000001U
#define USB_OTGHS_GINTSTS_GOUTNAKEFF_S  7
/** USB_OTGHS_GINTSTS_ERLYSUSP : R/W; bitpos: [10]; default: 0;
 *  Mode: Device only
 *  Early Suspend (ErlySusp)
 *  The controller sets this bit to indicate that an Idle state has been detected on
 *  the USB for 3 ms.
 */
#define USB_OTGHS_GINTSTS_ERLYSUSP    (BIT(10))
#define USB_OTGHS_GINTSTS_ERLYSUSP_M  (USB_OTGHS_GINTSTS_ERLYSUSP_V << USB_OTGHS_GINTSTS_ERLYSUSP_S)
#define USB_OTGHS_GINTSTS_ERLYSUSP_V  0x00000001U
#define USB_OTGHS_GINTSTS_ERLYSUSP_S  10
/** USB_OTGHS_GINTSTS_USBSUSP : R/W; bitpos: [11]; default: 0;
 *  Mode: Device only
 *  USB Suspend (USBSusp)
 *  The controller sets this bit to indicate that a suspend was detected on the USB.
 *  The controller enters the Suspended state when there is no activity on the
 *  linestate signal for an extended period of time.
 */
#define USB_OTGHS_GINTSTS_USBSUSP    (BIT(11))
#define USB_OTGHS_GINTSTS_USBSUSP_M  (USB_OTGHS_GINTSTS_USBSUSP_V << USB_OTGHS_GINTSTS_USBSUSP_S)
#define USB_OTGHS_GINTSTS_USBSUSP_V  0x00000001U
#define USB_OTGHS_GINTSTS_USBSUSP_S  11
/** USB_OTGHS_GINTSTS_USBRST : R/W; bitpos: [12]; default: 0;
 *  Mode: Device only
 *  USB Reset (USBRst)
 *  The controller sets this bit to indicate that a reset is detected on the USB.
 */
#define USB_OTGHS_GINTSTS_USBRST    (BIT(12))
#define USB_OTGHS_GINTSTS_USBRST_M  (USB_OTGHS_GINTSTS_USBRST_V << USB_OTGHS_GINTSTS_USBRST_S)
#define USB_OTGHS_GINTSTS_USBRST_V  0x00000001U
#define USB_OTGHS_GINTSTS_USBRST_S  12
/** USB_OTGHS_GINTSTS_ENUMDONE : R/W; bitpos: [13]; default: 0;
 *  Mode: Device only
 *  Enumeration Done (EnumDone)
 *  The core sets this bit to indicate that speed enumeration is complete. The
 *  application must read the Device Status (DSTS) register to obtain the enumerated
 *  speed.
 */
#define USB_OTGHS_GINTSTS_ENUMDONE    (BIT(13))
#define USB_OTGHS_GINTSTS_ENUMDONE_M  (USB_OTGHS_GINTSTS_ENUMDONE_V << USB_OTGHS_GINTSTS_ENUMDONE_S)
#define USB_OTGHS_GINTSTS_ENUMDONE_V  0x00000001U
#define USB_OTGHS_GINTSTS_ENUMDONE_S  13
/** USB_OTGHS_GINTSTS_ISOOUTDROP : R/W; bitpos: [14]; default: 0;
 *  Mode: Device only
 *  Isochronous OUT Packet Dropped Interrupt (ISOOutDrop)
 *  The controller sets this bit when it fails to write an isochronous OUT packet into
 *  the RxFIFO because the RxFIFO does not have enough space to accommodate a maximum
 *  packet size packet for the isochronous OUT endpoint.
 */
#define USB_OTGHS_GINTSTS_ISOOUTDROP    (BIT(14))
#define USB_OTGHS_GINTSTS_ISOOUTDROP_M  (USB_OTGHS_GINTSTS_ISOOUTDROP_V << USB_OTGHS_GINTSTS_ISOOUTDROP_S)
#define USB_OTGHS_GINTSTS_ISOOUTDROP_V  0x00000001U
#define USB_OTGHS_GINTSTS_ISOOUTDROP_S  14
/** USB_OTGHS_GINTSTS_EOPF : R/W; bitpos: [15]; default: 0;
 *  Mode: Device only
 *  End of Periodic Frame Interrupt (EOPF)
 *  Indicates that the period specified in the Periodic Frame Interval field of the
 *  Device Configuration register (DCFG.PerFrInt) has been reached in the current
 *  microframe.
 *  In case of Non-Ignore Frame Number Scatter/Gather (Descriptor DMA) mode, the
 *  controller internally handles the following scenarios based on EOPF:
 *
 *  Read Flush: At the EOPF, the controller checks if there are any pending packets in
 *  the FIFO corresponding to the current (micro)Frame.
 *  - If there are any pending packets, then the controller initiates read flush, due
 *  to which the read pointer is updated to the starting location of the next
 *  micro-frame packet.
 *  - If there are no pending packets corresponding to the current (micro)Frame, the
 *  controller does not take any action.
 *  Write Flush: At the EOPF, if the controller is still fetching the current
 *  micro-frame data, then the controller stops pushing data into the TXFIFO but keeps
 *  fetching the complete packet from the System Memory. After completing the scheduled
 *  packet size fetch, the controller updates the Status Quadlet Fields (Transmit
 *  Status to BUFFLUSH) and closes the Descriptor.  During the descriptor close, the
 *  controller initiates write flush, due to which the write pointer is updated to the
 *  starting location of the next micro-frame packet. Because the controller stops
 *  pushing the packet to the TxFIFO after EOPF, to bring the write pointer to the
 *  starting location of the next micro-frame, write flush is done.
 */
#define USB_OTGHS_GINTSTS_EOPF    (BIT(15))
#define USB_OTGHS_GINTSTS_EOPF_M  (USB_OTGHS_GINTSTS_EOPF_V << USB_OTGHS_GINTSTS_EOPF_S)
#define USB_OTGHS_GINTSTS_EOPF_V  0x00000001U
#define USB_OTGHS_GINTSTS_EOPF_S  15
/** USB_OTGHS_GINTSTS_EPMIS : R/W; bitpos: [17]; default: 0;
 *  Mode: Device only
 *  Endpoint Mismatch Interrupt (EPMis)
 *  Note: This interrupt is valid only in shared FIFO operation.
 *  Indicates that an IN token has been received for a non-periodic endpoint, but the
 *  data for another endpoint is present in the top of the Non-periodic Transmit FIFO
 *  and the IN endpoint mismatch count programmed by the application has expired.
 */
#define USB_OTGHS_GINTSTS_EPMIS    (BIT(17))
#define USB_OTGHS_GINTSTS_EPMIS_M  (USB_OTGHS_GINTSTS_EPMIS_V << USB_OTGHS_GINTSTS_EPMIS_S)
#define USB_OTGHS_GINTSTS_EPMIS_V  0x00000001U
#define USB_OTGHS_GINTSTS_EPMIS_S  17
/** USB_OTGHS_GINTSTS_IEPINT : RO; bitpos: [18]; default: 0;
 *  Mode: Device only
 *  IN Endpoints Interrupt (IEPInt)
 *  The core sets this bit to indicate that an interrupt is pending on one of the IN
 *  endpoints of the core (in Device mode). The application must read the Device All
 *  Endpoints Interrupt (DAINT) register to determine the exact number of the IN
 *  endpoint on Device IN Endpoint-n Interrupt (DIEPINTn) register to determine the
 *  exact cause of the interrupt. The application must clear the appropriate status bit
 *  in the corresponding DIEPINTn register to
 *  clear this bit.
 */
#define USB_OTGHS_GINTSTS_IEPINT    (BIT(18))
#define USB_OTGHS_GINTSTS_IEPINT_M  (USB_OTGHS_GINTSTS_IEPINT_V << USB_OTGHS_GINTSTS_IEPINT_S)
#define USB_OTGHS_GINTSTS_IEPINT_V  0x00000001U
#define USB_OTGHS_GINTSTS_IEPINT_S  18
/** USB_OTGHS_GINTSTS_OEPINT : RO; bitpos: [19]; default: 0;
 *  Mode: Device only
 *  OUT Endpoints Interrupt (OEPInt)
 *  The controller sets this bit to indicate that an interrupt is pending on one of the
 *  OUT endpoints of the core (in Device mode). The application must read the Device
 *  All Endpoints Interrupt (DAINT) register to determine the exact number of the OUT
 *  endpoint on which the interrupt occurred, and then read the corresponding Device
 *  OUT Endpoint-n Interrupt (DOEPINTn) register to determine the exact cause of the
 *  interrupt. The application must
 *  clear the appropriate status bit in the corresponding DOEPINTn register to clear
 *  this bit.
 */
#define USB_OTGHS_GINTSTS_OEPINT    (BIT(19))
#define USB_OTGHS_GINTSTS_OEPINT_M  (USB_OTGHS_GINTSTS_OEPINT_V << USB_OTGHS_GINTSTS_OEPINT_S)
#define USB_OTGHS_GINTSTS_OEPINT_V  0x00000001U
#define USB_OTGHS_GINTSTS_OEPINT_S  19
/** USB_OTGHS_GINTSTS_INCOMPISOIN : R/W; bitpos: [20]; default: 0;
 *  Mode: Device only
 *  Incomplete Isochronous IN Transfer (incompISOIN)
 *  The core sets this interrupt to indicate that there is at least one isochronous IN
 *  endpoint on which the transfer is not completed in the current microframe. This
 *  interrupt is asserted along with the End of Periodic Frame Interrupt (EOPF) bit in
 *  this register.
 *  Note: This interrupt is not asserted in Scatter/Gather DMA mode.
 */
#define USB_OTGHS_GINTSTS_INCOMPISOIN    (BIT(20))
#define USB_OTGHS_GINTSTS_INCOMPISOIN_M  (USB_OTGHS_GINTSTS_INCOMPISOIN_V << USB_OTGHS_GINTSTS_INCOMPISOIN_S)
#define USB_OTGHS_GINTSTS_INCOMPISOIN_V  0x00000001U
#define USB_OTGHS_GINTSTS_INCOMPISOIN_S  20
/** USB_OTGHS_GINTSTS_INCOMPLP : R/W; bitpos: [21]; default: 0;
 *  Incomplete Periodic Transfer (incomplP)
 *  Mode: Host only
 *  In Host mode, the core sets this interrupt bit when there are incomplete periodic
 *  transactions still pending which are scheduled for the current microframe.
 *  Incomplete Isochronous OUT Transfer (incompISOOUT)
 *  Mode: Device only
 *  The Device mode, the core sets this interrupt to indicate that there is at least
 *  one isochronous OUT endpoint on which the transfer is not completed in the current
 *  microframe. This interrupt is asserted along with the End of Periodic Frame
 *  Interrupt (EOPF) bit in this register.
 */
#define USB_OTGHS_GINTSTS_INCOMPLP    (BIT(21))
#define USB_OTGHS_GINTSTS_INCOMPLP_M  (USB_OTGHS_GINTSTS_INCOMPLP_V << USB_OTGHS_GINTSTS_INCOMPLP_S)
#define USB_OTGHS_GINTSTS_INCOMPLP_V  0x00000001U
#define USB_OTGHS_GINTSTS_INCOMPLP_S  21
/** USB_OTGHS_GINTSTS_FETSUSP : R/W; bitpos: [22]; default: 0;
 *  Mode: Device only
 *  Data Fetch Suspended (FetSusp)
 *  This interrupt is valid only in DMA mode. This interrupt indicates that the core
 *  has stopped fetching data. For IN endpoints due to the unavailability of TxFIFO
 *  space or Request Queue space. This interrupt is used by the application for an
 *  endpoint mismatch algorithm.
 *
 *  For example, after detecting an endpoint mismatch, the application:
 *  - Sets a Global non-periodic IN NAK handshake
 *  - Disables IN endpoints
 *  - Flushes the FIFO
 *  - Determines the token sequence from the IN Token Sequence Learning Queue
 *  - Re-enables the endpoints
 *  - Clears the Global non-periodic IN NAK handshake
 *  If the Global non-periodic IN NAK is cleared, the core has not yet fetched data for
 *  the IN endpoint, and the IN token is received. The core generates an 'IN token
 *  received when FIFO empty' interrupt. It then sends the host a NAK response. To
 *  avoid this scenario, the application can check the GINTSTS.FetSusp interrupt, which
 *  ensures that the FIFO is full before clearing a Global NAK handshake.
 *
 *  Alternatively, the application can mask the IN token received when FIFO empty
 *  interrupt when clearing a Global IN NAK handshake.
 */
#define USB_OTGHS_GINTSTS_FETSUSP    (BIT(22))
#define USB_OTGHS_GINTSTS_FETSUSP_M  (USB_OTGHS_GINTSTS_FETSUSP_V << USB_OTGHS_GINTSTS_FETSUSP_S)
#define USB_OTGHS_GINTSTS_FETSUSP_V  0x00000001U
#define USB_OTGHS_GINTSTS_FETSUSP_S  22
/** USB_OTGHS_GINTSTS_RESETDET : R/W; bitpos: [23]; default: 0;
 *  Mode: Device only
 *  Reset detected Interrupt (ResetDet)
 *  In Device mode, this interrupt is asserted when a reset is detected on the USB in
 *  partial power-down mode when the device is in Suspend.
 *
 *  In Host mode, this interrupt is not asserted.
 */
#define USB_OTGHS_GINTSTS_RESETDET    (BIT(23))
#define USB_OTGHS_GINTSTS_RESETDET_M  (USB_OTGHS_GINTSTS_RESETDET_V << USB_OTGHS_GINTSTS_RESETDET_S)
#define USB_OTGHS_GINTSTS_RESETDET_V  0x00000001U
#define USB_OTGHS_GINTSTS_RESETDET_S  23
/** USB_OTGHS_GINTSTS_PRTINT : RO; bitpos: [24]; default: 0;
 *  Mode: Host only
 *  Host Port Interrupt (PrtInt)
 *  The core sets this bit to indicate a change in port status of one of the controller
 *  ports in Host mode. The application must read the Host Port Control and Status
 *  (HPRT) register to determine the exact event that caused this interrupt. The
 *  application must clear the appropriate status bit in the Host Port
 *  Control and Status register to clear this bit.
 */
#define USB_OTGHS_GINTSTS_PRTINT    (BIT(24))
#define USB_OTGHS_GINTSTS_PRTINT_M  (USB_OTGHS_GINTSTS_PRTINT_V << USB_OTGHS_GINTSTS_PRTINT_S)
#define USB_OTGHS_GINTSTS_PRTINT_V  0x00000001U
#define USB_OTGHS_GINTSTS_PRTINT_S  24
/** USB_OTGHS_GINTSTS_HCHINT : RO; bitpos: [25]; default: 0;
 *  Mode: Host only
 *  Host Channels Interrupt (HChInt)
 *  The core sets this bit to indicate that an interrupt is pending on one of the
 *  channels of the core (in Host mode). The application must read the Host All
 *  Channels Interrupt (HAINT) register to determine the exact number of the channel on
 *  which the interrupt occurred, and Then read the corresponding Host
 *  Channel-n Interrupt (HCINTn) register to determine the exact cause of the
 *  interrupt. The application must clear the appropriate status bit in the HCINTn
 *  register to clear this bit.
 */
#define USB_OTGHS_GINTSTS_HCHINT    (BIT(25))
#define USB_OTGHS_GINTSTS_HCHINT_M  (USB_OTGHS_GINTSTS_HCHINT_V << USB_OTGHS_GINTSTS_HCHINT_S)
#define USB_OTGHS_GINTSTS_HCHINT_V  0x00000001U
#define USB_OTGHS_GINTSTS_HCHINT_S  25
/** USB_OTGHS_GINTSTS_PTXFEMP : RO; bitpos: [26]; default: 1;
 *  Mode: Host only
 *  Periodic TxFIFO Empty (PTxFEmp)
 *  This interrupt is asserted when the Periodic Transmit FIFO is either half or
 *  completely empty and there is space for at least one entry to be written in the
 *  Periodic Request Queue. The half or completely empty status is determined by the
 *  Periodic TxFIFO Empty Level bit in the Core AHB Configuration register
 *  (GAHBCFG.PTxFEmpLvl).
 */
#define USB_OTGHS_GINTSTS_PTXFEMP    (BIT(26))
#define USB_OTGHS_GINTSTS_PTXFEMP_M  (USB_OTGHS_GINTSTS_PTXFEMP_V << USB_OTGHS_GINTSTS_PTXFEMP_S)
#define USB_OTGHS_GINTSTS_PTXFEMP_V  0x00000001U
#define USB_OTGHS_GINTSTS_PTXFEMP_S  26
/** USB_OTGHS_GINTSTS_CONIDSTSCHNG : R/W; bitpos: [28]; default: 0;
 *  Mode: Host and Device
 *  Connector ID Status Change (ConIDStsChng)
 *  The core sets this bit when there is a change in connector ID status.
 */
#define USB_OTGHS_GINTSTS_CONIDSTSCHNG    (BIT(28))
#define USB_OTGHS_GINTSTS_CONIDSTSCHNG_M  (USB_OTGHS_GINTSTS_CONIDSTSCHNG_V << USB_OTGHS_GINTSTS_CONIDSTSCHNG_S)
#define USB_OTGHS_GINTSTS_CONIDSTSCHNG_V  0x00000001U
#define USB_OTGHS_GINTSTS_CONIDSTSCHNG_S  28
/** USB_OTGHS_GINTSTS_DISCONNINT : R/W; bitpos: [29]; default: 0;
 *  Mode: Host only
 *  Disconnect Detected Interrupt (DisconnInt)
 *  Asserted when a device disconnect is detected.
 */
#define USB_OTGHS_GINTSTS_DISCONNINT    (BIT(29))
#define USB_OTGHS_GINTSTS_DISCONNINT_M  (USB_OTGHS_GINTSTS_DISCONNINT_V << USB_OTGHS_GINTSTS_DISCONNINT_S)
#define USB_OTGHS_GINTSTS_DISCONNINT_V  0x00000001U
#define USB_OTGHS_GINTSTS_DISCONNINT_S  29
/** USB_OTGHS_GINTSTS_SESSREQINT : R/W; bitpos: [30]; default: 0;
 *  Mode: Host and Device
 *  Session Request/New Session Detected Interrupt (SessReqInt)
 *  In Host mode, this interrupt is asserted when a session request is detected from
 *  the device. In Host mode, this interrupt is asserted when a session request is
 *  detected from the device.
 *  In Device mode, this interrupt is asserted when the utmisrp_bvalid signal goes high.
 *  For more information on how to use this interrupt, see 'Partial Power-Down and
 *  Clock Gating Programming Model' in the Programming Guide.
 */
#define USB_OTGHS_GINTSTS_SESSREQINT    (BIT(30))
#define USB_OTGHS_GINTSTS_SESSREQINT_M  (USB_OTGHS_GINTSTS_SESSREQINT_V << USB_OTGHS_GINTSTS_SESSREQINT_S)
#define USB_OTGHS_GINTSTS_SESSREQINT_V  0x00000001U
#define USB_OTGHS_GINTSTS_SESSREQINT_S  30
/** USB_OTGHS_GINTSTS_WKUPINT : R/W; bitpos: [31]; default: 0;
 *  Mode: Host and Device
 *  Resume/Remote Wakeup Detected Interrupt (WkUpInt)
 *  Wakeup Interrupt during Suspend(L2) or LPM(L1) state.
 *  - During Suspend(L2):
 *  -- Device Mode: This interrupt is asserted only when Host Initiated Resume is
 *  detected on USB.
 *  -- Host Mode: This interrupt is asserted only when Device Initiated Remote Wakeup
 *  is detected on USB.
 *  For more information, see 'Partial Power-Down and Clock Gating Programming Model'
 *  in the Programming Guide.
 *  - During LPM(L1):
 *  -- Device Mode: This interrupt is asserted for either Host Initiated Resume or
 *  Device Initiated Remote Wakeup on USB.
 *  -- Host Mode: This interrupt is asserted for either Host Initiated Resume or Device
 *  Initiated Remote Wakeup on USB.
 *  For more information, see 'LPM Entry and Exit Programming Model' in the Programming
 *  Guide.
 */
#define USB_OTGHS_GINTSTS_WKUPINT    (BIT(31))
#define USB_OTGHS_GINTSTS_WKUPINT_M  (USB_OTGHS_GINTSTS_WKUPINT_V << USB_OTGHS_GINTSTS_WKUPINT_S)
#define USB_OTGHS_GINTSTS_WKUPINT_V  0x00000001U
#define USB_OTGHS_GINTSTS_WKUPINT_S  31

