espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_GNPTXFSIZ_REG register
 *  The application can program the RAM size and the memory start address for the
 *  Non-periodic TxFIFO  Note: The fields of this register change depending on host or
 *  device mode.
 */
#define USB_OTGHS_GNPTXFSIZ_REG (DR_REG_USB_OTGHS_BASE + 0x28)
/** USB_OTGHS_GNPTXFSIZ_NPTXFSTADDR : R/W; bitpos: [10:0]; default: 1024;
 *  Non-periodic Transmit RAM Start Address (NPTxFStAddr)
 *  For host mode, this field is always valid.
 *  This field contains the memory start address for Non-periodic Transmit FIFO RAM.
 *  - This field is determined during coreConsultant configuration by Enable Dynamic
 *  FIFO Sizing? (OTG_DFIFO_DYNAMIC):OTG_DFIFO_DYNAMIC = 0
 *  These flops are optimized, and reads return the power-on value.
 *  - OTG_DFIFO_DYNAMIC = 1 The application can write a new value in this field.
 *  Programmed values must not exceed the power-on value set in coreConsultant.
 *  Programmed values must not exceed the power-on value set in coreConsultant.
 *  The power-on reset value of this field is specified during coreConsultant
 *  configuration by Largest Rx Data FIFO Depth (parameter OTG_RX_DFIFO_DEPTH).
 */
#define USB_OTGHS_GNPTXFSIZ_NPTXFSTADDR    0x000007FFU
#define USB_OTGHS_GNPTXFSIZ_NPTXFSTADDR_M  (USB_OTGHS_GNPTXFSIZ_NPTXFSTADDR_V << USB_OTGHS_GNPTXFSIZ_NPTXFSTADDR_S)
#define USB_OTGHS_GNPTXFSIZ_NPTXFSTADDR_V  0x000007FFU
#define USB_OTGHS_GNPTXFSIZ_NPTXFSTADDR_S  0
/** USB_OTGHS_GNPTXFSIZ_NPTXFDEP : R/W; bitpos: [26:16]; default: 1024;
 *  Mode: Host only
 *  Non-periodic TxFIFO Depth (NPTxFDep)
 *  For host mode, this field is always valid.
 *  For device mode, this field is valid only when OTG_EN_DED_TX_FIFO=0.
 *  This value is in terms of 32-bit words.
 *  - Minimum value is 16
 *  - Maximum value is 32,768
 *  This attribute of field is determined during coreConsultant configuration by Enable
 *  Dynamic FIFO Sizing? (OTG_DFIFO_DYNAMIC):
 *  - OTG_DFIFO_DYNAMIC = 0: These flops are optimized, and reads return the power-on
 *  value.
 *  - OTG_DFIFO_DYNAMIC = 1: The application can write a new value in this field.
 *  Programmed values must not exceed the power-on value set in coreConsultant.
 *  The power-on reset value of this field is specified during coreConsultant
 *  configuration as Largest IN Endpoint FIFO 0 Depth (parameter
 *  OTG_TX_DINEP_DFIFO_DEPTH_0).
 */
#define USB_OTGHS_GNPTXFSIZ_NPTXFDEP    0x000007FFU
#define USB_OTGHS_GNPTXFSIZ_NPTXFDEP_M  (USB_OTGHS_GNPTXFSIZ_NPTXFDEP_V << USB_OTGHS_GNPTXFSIZ_NPTXFDEP_S)
#define USB_OTGHS_GNPTXFSIZ_NPTXFDEP_V  0x000007FFU
#define USB_OTGHS_GNPTXFSIZ_NPTXFDEP_S  16

/** USB_OTGHS_GNPTXSTS_REG register
 *  In Device mode, this register is valid only in Shared FIFO operation. This
 *  read-only register contains the free space information for the Non-periodic TxFIFO
 *  and the Non-periodic Transmit Request Queue.
 */
#define USB_OTGHS_GNPTXSTS_REG (DR_REG_USB_OTGHS_BASE + 0x2c)
/** USB_OTGHS_GNPTXSTS_NPTXFSPCAVAIL : RO; bitpos: [15:0]; default: 1024;
 *  Non-periodic TxFIFO Space Avail (NPTxFSpcAvail)
 *  Indicates the amount of free space available in the Non-periodic TxFIFO.
 *  Values are in terms of 32-bit words.
 *  - 16'h0: Non-periodic TxFIFO is full
 *  - 16'h1: 1 word available
 *  - 16'h2: 2 words available
 *  - 16'hn: n words available (where 0 <= n <= 32,768)
 *  - 16'h8000: 32,768 words available
 *  - Others: Reserved
 *  Reset: Configurable
 */
#define USB_OTGHS_GNPTXSTS_NPTXFSPCAVAIL    0x0000FFFFU
#define USB_OTGHS_GNPTXSTS_NPTXFSPCAVAIL_M  (USB_OTGHS_GNPTXSTS_NPTXFSPCAVAIL_V << USB_OTGHS_GNPTXSTS_NPTXFSPCAVAIL_S)
#define USB_OTGHS_GNPTXSTS_NPTXFSPCAVAIL_V  0x0000FFFFU
#define USB_OTGHS_GNPTXSTS_NPTXFSPCAVAIL_S  0
/** USB_OTGHS_GNPTXSTS_NPTXQSPCAVAIL : RO; bitpos: [23:16]; default: 8;
 *  Non-periodic Transmit Request Queue Space Available (NPTxQSpcAvail)
 *  Indicates the amount of free space available in the Non-periodic Transmit Request
 *  Queue. This queue holds both IN and OUT requests in Host mode. Device mode has only
 *  IN requests.
 *  - 8'h0: Non-periodic Transmit Request Queue is full
 *  - 8'h1: 1 location available
 *  - 8'h2: 2 locations available
 *  - n: n locations available (0 <= n <= 8)
 *  - Others: Reserved
 *  Reset: Configurable
 */
#define USB_OTGHS_GNPTXSTS_NPTXQSPCAVAIL    0x000000FFU
#define USB_OTGHS_GNPTXSTS_NPTXQSPCAVAIL_M  (USB_OTGHS_GNPTXSTS_NPTXQSPCAVAIL_V << USB_OTGHS_GNPTXSTS_NPTXQSPCAVAIL_S)
#define USB_OTGHS_GNPTXSTS_NPTXQSPCAVAIL_V  0x000000FFU
#define USB_OTGHS_GNPTXSTS_NPTXQSPCAVAIL_S  16
/** USB_OTGHS_GNPTXSTS_NPTXQTOP : RO; bitpos: [30:24]; default: 0;
 *  Top of the Non-periodic Transmit Request Queue (NPTxQTop)
 *  Entry in the Non-periodic Tx Request Queue that is currently being processed by the
 *  MAC.
 *
 *  - Bits [30:27]: Channel/endpoint number
 *  - Bits [26:25]:
 *  - 2'b00: IN/OUT token
 *  -- 2'b01: Zero-length transmit packet (device IN/host OUT)
 *  -- 2'b10: PING/CSPLIT token
 *  -- 2'b11: Channel halt command
 *  - Bit [24]: Terminate (last Entry for selected channel/endpoint)
 *  Reset: 7'h0
 */
#define USB_OTGHS_GNPTXSTS_NPTXQTOP    0x0000007FU
#define USB_OTGHS_GNPTXSTS_NPTXQTOP_M  (USB_OTGHS_GNPTXSTS_NPTXQTOP_V << USB_OTGHS_GNPTXSTS_NPTXQTOP_S)
#define USB_OTGHS_GNPTXSTS_NPTXQTOP_V  0x0000007FU
#define USB_OTGHS_GNPTXSTS_NPTXQTOP_S  24

/** USB_OTGHS_GPVNDCTL_REG register
 *  The application can use this register to access PHY registers. It is implemented
 *  only if Enable PHY Vendor Control Interface was selected during coreConsultant
 *  configuration (parameter OTG_VENDOR_CTL_INTERFACE = 1). For a UTMI+ PHY, the
 *  DWC_otg core uses the UTMI+ Vendor Control interface for PHY register access. For a
 *  ULPI PHY, the core uses the ULPI interface for PHY register access. The application
 *  sets Vendor Control register for PHY register access and times the PHY register
 *  access. The application polls the VStatus Done bit in this register for the
 *  completion of the PHY register access.
 */
#define USB_OTGHS_GPVNDCTL_REG (DR_REG_USB_OTGHS_BASE + 0x34)
/** USB_OTGHS_GPVNDCTL_REGDATA : R/W; bitpos: [7:0]; default: 0;
 *  Register Data (RegData)
 *
 *  Contains the write data for register write.
 *
 *  Read data for register read, valid when VStatus Done is set.
 */
#define USB_OTGHS_GPVNDCTL_REGDATA    0x000000FFU
#define USB_OTGHS_GPVNDCTL_REGDATA_M  (USB_OTGHS_GPVNDCTL_REGDATA_V << USB_OTGHS_GPVNDCTL_REGDATA_S)
#define USB_OTGHS_GPVNDCTL_REGDATA_V  0x000000FFU
#define USB_OTGHS_GPVNDCTL_REGDATA_S  0
/** USB_OTGHS_GPVNDCTL_VCTRL : R/W; bitpos: [15:8]; default: 0;
 *
 *  UTMI+ Vendor Control Register Address (VCtrl)
 *  The 4-bit register address a vendor defined 4-bit parallel
 *  output bus. Bits 11:8 of this field are placed on
 *  utmi_vcontrol[3:0].
 *  ULPI Extended Register Address (ExtRegAddr)
 *  The 6-bit PHY extended register address.
 */
#define USB_OTGHS_GPVNDCTL_VCTRL    0x000000FFU
#define USB_OTGHS_GPVNDCTL_VCTRL_M  (USB_OTGHS_GPVNDCTL_VCTRL_V << USB_OTGHS_GPVNDCTL_VCTRL_S)
#define USB_OTGHS_GPVNDCTL_VCTRL_V  0x000000FFU
#define USB_OTGHS_GPVNDCTL_VCTRL_S  8
/** USB_OTGHS_GPVNDCTL_REGADDR : R/W; bitpos: [21:16]; default: 0;
 *  Register Address (RegAddr)
 *
 *  The 6-bit PHY register address for immediate PHY Register set access. Set to 6'h2F
 *  for Extended PHY Register set access.
 */
#define USB_OTGHS_GPVNDCTL_REGADDR    0x0000003FU
#define USB_OTGHS_GPVNDCTL_REGADDR_M  (USB_OTGHS_GPVNDCTL_REGADDR_V << USB_OTGHS_GPVNDCTL_REGADDR_S)
#define USB_OTGHS_GPVNDCTL_REGADDR_V  0x0000003FU
#define USB_OTGHS_GPVNDCTL_REGADDR_S  16
/** USB_OTGHS_GPVNDCTL_REGWR : R/W; bitpos: [22]; default: 0;
 *
 *  Register Write (RegWr)
 *  Set this bit for register writes, and clear it for register reads.
 */
#define USB_OTGHS_GPVNDCTL_REGWR    (BIT(22))
#define USB_OTGHS_GPVNDCTL_REGWR_M  (USB_OTGHS_GPVNDCTL_REGWR_V << USB_OTGHS_GPVNDCTL_REGWR_S)
#define USB_OTGHS_GPVNDCTL_REGWR_V  0x00000001U
#define USB_OTGHS_GPVNDCTL_REGWR_S  22
/** USB_OTGHS_GPVNDCTL_NEWREGREQ : R/W; bitpos: [25]; default: 0;
 *
 *  New Register Request (NewRegReq)
 *
 *  The application sets this bit for a new vendor control
 *  access.
 */
#define USB_OTGHS_GPVNDCTL_NEWREGREQ    (BIT(25))
#define USB_OTGHS_GPVNDCTL_NEWREGREQ_M  (USB_OTGHS_GPVNDCTL_NEWREGREQ_V << USB_OTGHS_GPVNDCTL_NEWREGREQ_S)
#define USB_OTGHS_GPVNDCTL_NEWREGREQ_V  0x00000001U
#define USB_OTGHS_GPVNDCTL_NEWREGREQ_S  25
/** USB_OTGHS_GPVNDCTL_VSTSBSY : RO; bitpos: [26]; default: 0;
 *
 *  VStatus Busy (VStsBsy)
 *
 *  The core sets this bit when the vendor control access is in
 *  progress and clears this bit when done.
 */
#define USB_OTGHS_GPVNDCTL_VSTSBSY    (BIT(26))
#define USB_OTGHS_GPVNDCTL_VSTSBSY_M  (USB_OTGHS_GPVNDCTL_VSTSBSY_V << USB_OTGHS_GPVNDCTL_VSTSBSY_S)
#define USB_OTGHS_GPVNDCTL_VSTSBSY_V  0x00000001U
#define USB_OTGHS_GPVNDCTL_VSTSBSY_S  26
/** USB_OTGHS_GPVNDCTL_VSTSDONE : R/W; bitpos: [27]; default: 0;
 *
 *  VStatus Done (VStsDone)
 *
 *  The core sets this bit when the vendor control access is
 *  done.
 *  This bit is cleared by the core when the application sets the
 *  New Register Request bit (bit 25).
 */
#define USB_OTGHS_GPVNDCTL_VSTSDONE    (BIT(27))
#define USB_OTGHS_GPVNDCTL_VSTSDONE_M  (USB_OTGHS_GPVNDCTL_VSTSDONE_V << USB_OTGHS_GPVNDCTL_VSTSDONE_S)
#define USB_OTGHS_GPVNDCTL_VSTSDONE_V  0x00000001U
#define USB_OTGHS_GPVNDCTL_VSTSDONE_S  27
/** USB_OTGHS_GPVNDCTL_DISULPIDRVR : R/W; bitpos: [31]; default: 0;
 *
 *  Disable ULPI Drivers (DisUlpiDrvr)
 *
 *  The application sets this bit when it has finished processing
 *  the ULPI Carkit Interrupt (GINTSTS.ULPICKINT). When
 *  set, the controller disables drivers for output signals
 *  and masks input signal for the ULPI interface. The controller clears this bit
 *  before enabling the ULPI interface.
 */
#define USB_OTGHS_GPVNDCTL_DISULPIDRVR    (BIT(31))
#define USB_OTGHS_GPVNDCTL_DISULPIDRVR_M  (USB_OTGHS_GPVNDCTL_DISULPIDRVR_V << USB_OTGHS_GPVNDCTL_DISULPIDRVR_S)
#define USB_OTGHS_GPVNDCTL_DISULPIDRVR_V  0x00000001U
#define USB_OTGHS_GPVNDCTL_DISULPIDRVR_S  31

/** USB_OTGHS_GSNPSID_REG register
 *  This read-only register contains the release number of the core being used.
 */
#define USB_OTGHS_GSNPSID_REG (DR_REG_USB_OTGHS_BASE + 0x40)
/** USB_OTGHS_GSNPSID_SYNOPSYSID : RO; bitpos: [31:0]; default: 1330922250;
 *  Release number of the controller being used currently.
 *
 *  Bits [31:16]:
 *  - 0x4f54: ASCII Value for OT
 *  Bits [15:0]: Current Release Number. For example, 0x400a corresponds to v4.00a
 *  Release number.
 */
#define USB_OTGHS_GSNPSID_SYNOPSYSID    0xFFFFFFFFU
#define USB_OTGHS_GSNPSID_SYNOPSYSID_M  (USB_OTGHS_GSNPSID_SYNOPSYSID_V << USB_OTGHS_GSNPSID_SYNOPSYSID_S)
#define USB_OTGHS_GSNPSID_SYNOPSYSID_V  0xFFFFFFFFU
#define USB_OTGHS_GSNPSID_SYNOPSYSID_S  0

/** USB_OTGHS_GHWCFG1_REG register
 *  This register contains the logical endpoint direction(s) selected using
 *  coreConsultant.
 */
#define USB_OTGHS_GHWCFG1_REG (DR_REG_USB_OTGHS_BASE + 0x44)
/** USB_OTGHS_GHWCFG1_EPDIR : RO; bitpos: [31:0]; default: 0;
 *  This 32-bit field uses two bits per
 *  endpoint to determine the endpoint direction.
 *
 *  Endpoint
 *  - Bits [31:30]: Endpoint 15 direction
 *  - Bits [29:28]: Endpoint 14 direction
 *  ...
 *  - Bits [3:2]: Endpoint 1 direction
 *  - Bits[1:0]: Endpoint 0 direction (always BIDIR)
 *  Direction
 *  - 2'b00: BIDIR (IN and OUT) endpoint
 *  - 2'b01: IN endpoint
 *  - 2'b10: OUT endpoint
 *  - 2'b11: Reserved
 *  Note: This field is configured using the OTG_EP_DIR_1(n) parameter.
 */
#define USB_OTGHS_GHWCFG1_EPDIR    0xFFFFFFFFU
#define USB_OTGHS_GHWCFG1_EPDIR_M  (USB_OTGHS_GHWCFG1_EPDIR_V << USB_OTGHS_GHWCFG1_EPDIR_S)
#define USB_OTGHS_GHWCFG1_EPDIR_V  0xFFFFFFFFU
#define USB_OTGHS_GHWCFG1_EPDIR_S  0

/** USB_OTGHS_GHWCFG2_REG register
 *  This register contains configuration options selected using coreConsultant.
 */
#define USB_OTGHS_GHWCFG2_REG (DR_REG_USB_OTGHS_BASE + 0x48)
/** USB_OTGHS_GHWCFG2_OTGMODE : RO; bitpos: [2:0]; default: 2;
 *  Mode of Operation (OtgMode)
 *  - 3'b000: HNP- and SRP-Capable OTG (Host & Device)
 *  - 3'b001: SRP-Capable OTG (Host & Device)
 *  - 3'b010: Non-HNP and Non-SRP Capable OTG (Host and Device)
 *  - 3'b011: SRP-Capable Device
 *  - 3'b100: Non-OTG Device
 *  - 3'b101: SRP-Capable Host
 *  - 3'b110: Non-OTG Host
 *  - Others: Reserved
 *  Note: This field is configured using the OTG_MODE parameter.
 */
#define USB_OTGHS_GHWCFG2_OTGMODE    0x00000007U
#define USB_OTGHS_GHWCFG2_OTGMODE_M  (USB_OTGHS_GHWCFG2_OTGMODE_V << USB_OTGHS_GHWCFG2_OTGMODE_S)
#define USB_OTGHS_GHWCFG2_OTGMODE_V  0x00000007U
#define USB_OTGHS_GHWCFG2_OTGMODE_S  0
/** USB_OTGHS_GHWCFG2_OTGARCH : RO; bitpos: [4:3]; default: 2;
 *  Architecture (OtgArch)
 *  - 2'b00: Slave-Only
 *  - 2'b01: External DMA
 *  - 2'b10: Internal DMA
 *  - Others: Reserved
 *  Note: This field is configured using the OTG_ARCHITECTURE parameter.
 */
#define USB_OTGHS_GHWCFG2_OTGARCH    0x00000003U
#define USB_OTGHS_GHWCFG2_OTGARCH_M  (USB_OTGHS_GHWCFG2_OTGARCH_V << USB_OTGHS_GHWCFG2_OTGARCH_S)
#define USB_OTGHS_GHWCFG2_OTGARCH_V  0x00000003U
#define USB_OTGHS_GHWCFG2_OTGARCH_S  3
/** USB_OTGHS_GHWCFG2_SINGPNT : RO; bitpos: [5]; default: 0;
 *  Point-to-Point (SingPnt)
 *  - 1'b0: Multi-point application  (hub and split support)
 *  - 1'b1: Single-point application (no hub and split support)
 *  Note: This field is configured using the OTG_SINGLE_POINT parameter.
 */
#define USB_OTGHS_GHWCFG2_SINGPNT    (BIT(5))
#define USB_OTGHS_GHWCFG2_SINGPNT_M  (USB_OTGHS_GHWCFG2_SINGPNT_V << USB_OTGHS_GHWCFG2_SINGPNT_S)
#define USB_OTGHS_GHWCFG2_SINGPNT_V  0x00000001U
#define USB_OTGHS_GHWCFG2_SINGPNT_S  5
/** USB_OTGHS_GHWCFG2_HSPHYTYPE : RO; bitpos: [7:6]; default: 3;
 *  High-Speed PHY Interface Type (HSPhyType)
 *  - 2'b00: High-Speed interface not supported
 *  - 2'b01: UTMI+
 *  - 2'b10: ULPI
 *  - 2'b11: UTMI+ and ULPI
 *  Note: This field is configured using the OTG_HSPHY_INTERFACE parameter.
 */
#define USB_OTGHS_GHWCFG2_HSPHYTYPE    0x00000003U
#define USB_OTGHS_GHWCFG2_HSPHYTYPE_M  (USB_OTGHS_GHWCFG2_HSPHYTYPE_V << USB_OTGHS_GHWCFG2_HSPHYTYPE_S)
#define USB_OTGHS_GHWCFG2_HSPHYTYPE_V  0x00000003U
#define USB_OTGHS_GHWCFG2_HSPHYTYPE_S  6
/** USB_OTGHS_GHWCFG2_FSPHYTYPE : RO; bitpos: [9:8]; default: 2;
 *  Full-Speed PHY Interface Type (FSPhyType)
 *  - 2'b00: Full-speed interface not supported
 *  - 2'b01: Dedicated full-speed interface
 *  - 2'b10: FS pins shared with UTMI+ pins
 *  - 2'b11: FS pins shared with ULPI pins
 *  Note: This field is configured using the OTG_FSPHY_INTERFACE parameter.
 */
#define USB_OTGHS_GHWCFG2_FSPHYTYPE    0x00000003U
#define USB_OTGHS_GHWCFG2_FSPHYTYPE_M  (USB_OTGHS_GHWCFG2_FSPHYTYPE_V << USB_OTGHS_GHWCFG2_FSPHYTYPE_S)
#define USB_OTGHS_GHWCFG2_FSPHYTYPE_V  0x00000003U
#define USB_OTGHS_GHWCFG2_FSPHYTYPE_S  8
/** USB_OTGHS_GHWCFG2_NUMDEVEPS : RO; bitpos: [13:10]; default: 15;
 *  Number of Device Endpoints (NumDevEps)
 *
 *  Indicates the number of device endpoints supported by the core in Device mode.
 *
 *  The range of this field is 0-15.
 *
 *  Note: This field is configured using the OTG_NUM_EPS parameter.
 */
#define USB_OTGHS_GHWCFG2_NUMDEVEPS    0x0000000FU
#define USB_OTGHS_GHWCFG2_NUMDEVEPS_M  (USB_OTGHS_GHWCFG2_NUMDEVEPS_V << USB_OTGHS_GHWCFG2_NUMDEVEPS_S)
#define USB_OTGHS_GHWCFG2_NUMDEVEPS_V  0x0000000FU
#define USB_OTGHS_GHWCFG2_NUMDEVEPS_S  10
/** USB_OTGHS_GHWCFG2_NUMHSTCHNL : RO; bitpos: [17:14]; default: 15;
 *  Number of Host Channels (NumHstChnl)
 *  Indicates the number of host channels supported by the core in Host mode. The range
 *  of this field is 0-15: 0 specifies 1 channel, 15 specifies 16 channels.
 *
 *  Note: This field is configured using the OTG_NUM_HOST_CHAN parameter.
 */
#define USB_OTGHS_GHWCFG2_NUMHSTCHNL    0x0000000FU
#define USB_OTGHS_GHWCFG2_NUMHSTCHNL_M  (USB_OTGHS_GHWCFG2_NUMHSTCHNL_V << USB_OTGHS_GHWCFG2_NUMHSTCHNL_S)
#define USB_OTGHS_GHWCFG2_NUMHSTCHNL_V  0x0000000FU
#define USB_OTGHS_GHWCFG2_NUMHSTCHNL_S  14
/** USB_OTGHS_GHWCFG2_PERIOSUPPORT : RO; bitpos: [18]; default: 1;
 *  Periodic OUT Channels Supported in Host Mode (PerioSupport)
 *  - 1'b0: No
 *  - 1'b1: Yes
 *  Note: This field is configured using the OTG_EN_PERIO_HOST parameter.
 */
#define USB_OTGHS_GHWCFG2_PERIOSUPPORT    (BIT(18))
#define USB_OTGHS_GHWCFG2_PERIOSUPPORT_M  (USB_OTGHS_GHWCFG2_PERIOSUPPORT_V << USB_OTGHS_GHWCFG2_PERIOSUPPORT_S)
#define USB_OTGHS_GHWCFG2_PERIOSUPPORT_V  0x00000001U
#define USB_OTGHS_GHWCFG2_PERIOSUPPORT_S  18
/** USB_OTGHS_GHWCFG2_DYNFIFOSIZING : RO; bitpos: [19]; default: 1;
 *  Dynamic FIFO Sizing Enabled (DynFifoSizing)
 *  - 1'b0: No
 *  - 1'b1: Yes
 *  Note: This field is configured using the OTG_DFIFO_DYNAMIC parameter.
 */
#define USB_OTGHS_GHWCFG2_DYNFIFOSIZING    (BIT(19))
#define USB_OTGHS_GHWCFG2_DYNFIFOSIZING_M  (USB_OTGHS_GHWCFG2_DYNFIFOSIZING_V << USB_OTGHS_GHWCFG2_DYNFIFOSIZING_S)
#define USB_OTGHS_GHWCFG2_DYNFIFOSIZING_V  0x00000001U
#define USB_OTGHS_GHWCFG2_DYNFIFOSIZING_S  19
/** USB_OTGHS_GHWCFG2_MULTIPROCINTRPT : RO; bitpos: [20]; default: 1;
 *  Multi Processor Interrupt Enabled (MultiProcIntrpt)
 *  - 1'b0: No
 *  - 1'b1: Yes
 *  Note: This field is configured using the OTG_MULTI_PROC_INTRPT parameter.
 */
#define USB_OTGHS_GHWCFG2_MULTIPROCINTRPT    (BIT(20))
#define USB_OTGHS_GHWCFG2_MULTIPROCINTRPT_M  (USB_OTGHS_GHWCFG2_MULTIPROCINTRPT_V << USB_OTGHS_GHWCFG2_MULTIPROCINTRPT_S)
#define USB_OTGHS_GHWCFG2_MULTIPROCINTRPT_V  0x00000001U
#define USB_OTGHS_GHWCFG2_MULTIPROCINTRPT_S  20
/** USB_OTGHS_GHWCFG2_NPTXQDEPTH : RO; bitpos: [23:22]; default: 2;
 *  Non-periodic Request Queue Depth (NPTxQDepth)
 *  - 2'b00: 2
 *  - 2'b01: 4
 *  - 2'b10: 8
 *  - Others: Reserved
 *  Note: This field is configured using the OTG_NPERIO_TX_QUEUE_DEPTH parameter.
 */
#define USB_OTGHS_GHWCFG2_NPTXQDEPTH    0x00000003U
#define USB_OTGHS_GHWCFG2_NPTXQDEPTH_M  (USB_OTGHS_GHWCFG2_NPTXQDEPTH_V << USB_OTGHS_GHWCFG2_NPTXQDEPTH_S)
#define USB_OTGHS_GHWCFG2_NPTXQDEPTH_V  0x00000003U
#define USB_OTGHS_GHWCFG2_NPTXQDEPTH_S  22
/** USB_OTGHS_GHWCFG2_PTXQDEPTH : RO; bitpos: [25:24]; default: 3;
 *  Host Mode Periodic Request Queue Depth (PTxQDepth)
 *  - 2'b00: 2
 *  - 2'b01: 4
 *  - 2'b10: 8
 *  - 2'b11:16
 *  Note: This field is configured using the OTG_PERIO_TX_QUEUE_DEPTH parameter.
 */
#define USB_OTGHS_GHWCFG2_PTXQDEPTH    0x00000003U
#define USB_OTGHS_GHWCFG2_PTXQDEPTH_M  (USB_OTGHS_GHWCFG2_PTXQDEPTH_V << USB_OTGHS_GHWCFG2_PTXQDEPTH_S)
#define USB_OTGHS_GHWCFG2_PTXQDEPTH_V  0x00000003U
#define USB_OTGHS_GHWCFG2_PTXQDEPTH_S  24
/** USB_OTGHS_GHWCFG2_TKNQDEPTH : RO; bitpos: [30:26]; default: 8;
 *  Device Mode IN Token Sequence Learning Queue Depth (TknQDepth)
 *  Range: 0-30
 *
 *  Note: This field is configured using the OTG_TOKEN_QUEUE_DEPTH parameter.
 */
#define USB_OTGHS_GHWCFG2_TKNQDEPTH    0x0000001FU
#define USB_OTGHS_GHWCFG2_TKNQDEPTH_M  (USB_OTGHS_GHWCFG2_TKNQDEPTH_V << USB_OTGHS_GHWCFG2_TKNQDEPTH_S)
#define USB_OTGHS_GHWCFG2_TKNQDEPTH_V  0x0000001FU
#define USB_OTGHS_GHWCFG2_TKNQDEPTH_S  26

