espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_GHWCFG3_REG register
 *  This register contains configuration options selected using coreConsultant.
 */
#define USB_OTGHS_GHWCFG3_REG (DR_REG_USB_OTGHS_BASE + 0x4c)
/** USB_OTGHS_GHWCFG3_XFERSIZEWIDTH : RO; bitpos: [3:0]; default: 8;
 *  Width of Transfer Size Counters (XferSizeWidth)
 *  - 4'b0000: 11 bits
 *  - 4'b0001: 12 bits
 *  ...
 *  - 4'b1000: 19 bits
 *  - Others: Reserved
 *  Note: This field is configured using the OTG_PACKET_COUNT_WIDTH parameter.
 */
#define USB_OTGHS_GHWCFG3_XFERSIZEWIDTH    0x0000000FU
#define USB_OTGHS_GHWCFG3_XFERSIZEWIDTH_M  (USB_OTGHS_GHWCFG3_XFERSIZEWIDTH_V << USB_OTGHS_GHWCFG3_XFERSIZEWIDTH_S)
#define USB_OTGHS_GHWCFG3_XFERSIZEWIDTH_V  0x0000000FU
#define USB_OTGHS_GHWCFG3_XFERSIZEWIDTH_S  0
/** USB_OTGHS_GHWCFG3_PKTSIZEWIDTH : RO; bitpos: [6:4]; default: 6;
 *  Width of Packet Size Counters (PktSizeWidth)
 *  - 3'b000: 4 bits
 *  - 3'b001: 5 bits
 *  - 3'b010: 6 bits
 *  - 3'b011: 7 bits
 *  - 3'b100: 8 bits
 *  - 3'b101: 9 bits
 *  - 3'b110: 10 bits
 *  - Others: Reserved
 *  Note: This field is configured using the OTG_PACKET_COUNT_WIDTH parameter.
 */
#define USB_OTGHS_GHWCFG3_PKTSIZEWIDTH    0x00000007U
#define USB_OTGHS_GHWCFG3_PKTSIZEWIDTH_M  (USB_OTGHS_GHWCFG3_PKTSIZEWIDTH_V << USB_OTGHS_GHWCFG3_PKTSIZEWIDTH_S)
#define USB_OTGHS_GHWCFG3_PKTSIZEWIDTH_V  0x00000007U
#define USB_OTGHS_GHWCFG3_PKTSIZEWIDTH_S  4
/** USB_OTGHS_GHWCFG3_OTGEN : RO; bitpos: [7]; default: 1;
 *  OTG Function Enabled (OtgEn)
 *
 *  The application uses this bit to indicate the OTG capabilities of the controller .
 *  - 1'b0: Not OTG capable
 *  - 1'b1: OTG Capable
 *  Note: This field is configured using the OTG_MODE parameter.
 */
#define USB_OTGHS_GHWCFG3_OTGEN    (BIT(7))
#define USB_OTGHS_GHWCFG3_OTGEN_M  (USB_OTGHS_GHWCFG3_OTGEN_V << USB_OTGHS_GHWCFG3_OTGEN_S)
#define USB_OTGHS_GHWCFG3_OTGEN_V  0x00000001U
#define USB_OTGHS_GHWCFG3_OTGEN_S  7
/** USB_OTGHS_GHWCFG3_I2CINTSEL : RO; bitpos: [8]; default: 0;
 *  I2C Selection (I2CIntSel)
 *  - 1'b0: I2C Interface is not available on the controller.
 *  - 1'b1: I2C Interface is available on the controller.
 *  Note: This field is configured using the OTG_I2C_INTERFACE parameter.
 */
#define USB_OTGHS_GHWCFG3_I2CINTSEL    (BIT(8))
#define USB_OTGHS_GHWCFG3_I2CINTSEL_M  (USB_OTGHS_GHWCFG3_I2CINTSEL_V << USB_OTGHS_GHWCFG3_I2CINTSEL_S)
#define USB_OTGHS_GHWCFG3_I2CINTSEL_V  0x00000001U
#define USB_OTGHS_GHWCFG3_I2CINTSEL_S  8
/** USB_OTGHS_GHWCFG3_VNDCTLSUPT : RO; bitpos: [9]; default: 1;
 *  Vendor Control Interface Support (VndctlSupt)
 *  - 1'b0: Vendor Control Interface is not available on the core.
 *  - 1'b1: Vendor Control Interface is available.
 *  Note: This field is configured using the OTG_VENDOR_CTL_INTERFACE parameter.
 */
#define USB_OTGHS_GHWCFG3_VNDCTLSUPT    (BIT(9))
#define USB_OTGHS_GHWCFG3_VNDCTLSUPT_M  (USB_OTGHS_GHWCFG3_VNDCTLSUPT_V << USB_OTGHS_GHWCFG3_VNDCTLSUPT_S)
#define USB_OTGHS_GHWCFG3_VNDCTLSUPT_V  0x00000001U
#define USB_OTGHS_GHWCFG3_VNDCTLSUPT_S  9
/** USB_OTGHS_GHWCFG3_OPTFEATURE : RO; bitpos: [10]; default: 1;
 *  Optional Features Removed (OptFeature)
 *  Indicates whether the User ID register, GPIO interface ports, and SOF toggle and
 *  counter ports were removed for gate count optimization by enabling Remove Optional
 *  Features.
 *  - 1'b0: No
 *  - 1'b1: Yes
 *  Note: This field is configured using the OTG_RM_OPT_FEATURES parameter.
 */
#define USB_OTGHS_GHWCFG3_OPTFEATURE    (BIT(10))
#define USB_OTGHS_GHWCFG3_OPTFEATURE_M  (USB_OTGHS_GHWCFG3_OPTFEATURE_V << USB_OTGHS_GHWCFG3_OPTFEATURE_S)
#define USB_OTGHS_GHWCFG3_OPTFEATURE_V  0x00000001U
#define USB_OTGHS_GHWCFG3_OPTFEATURE_S  10
/** USB_OTGHS_GHWCFG3_RSTTYPE : RO; bitpos: [11]; default: 0;
 *  Reset Style for Clocked always Blocks in RTL (RstType)
 *  - 1'b0: Asynchronous reset is used in the controller
 *  - 1'b1: Synchronous reset is used in the controller
 *  Note: This field is configured using the OTG_SYNC_RESET_TYPE parameter.
 */
#define USB_OTGHS_GHWCFG3_RSTTYPE    (BIT(11))
#define USB_OTGHS_GHWCFG3_RSTTYPE_M  (USB_OTGHS_GHWCFG3_RSTTYPE_V << USB_OTGHS_GHWCFG3_RSTTYPE_S)
#define USB_OTGHS_GHWCFG3_RSTTYPE_V  0x00000001U
#define USB_OTGHS_GHWCFG3_RSTTYPE_S  11
/** USB_OTGHS_GHWCFG3_ADPSUPPORT : RO; bitpos: [12]; default: 0;
 *  This bit indicates whether ADP logic is present within or external to the controller
 *  - 0: No ADP logic present with the controller
 *  - 1: ADP logic is present along with the controller.
 */
#define USB_OTGHS_GHWCFG3_ADPSUPPORT    (BIT(12))
#define USB_OTGHS_GHWCFG3_ADPSUPPORT_M  (USB_OTGHS_GHWCFG3_ADPSUPPORT_V << USB_OTGHS_GHWCFG3_ADPSUPPORT_S)
#define USB_OTGHS_GHWCFG3_ADPSUPPORT_V  0x00000001U
#define USB_OTGHS_GHWCFG3_ADPSUPPORT_S  12
/** USB_OTGHS_GHWCFG3_HSICMODE : RO; bitpos: [13]; default: 0;
 *  HSIC mode specified for Mode of Operation
 *  Value Range: 0 - 1
 *  - 1: HSIC-capable with shared UTMI PHY interface
 *  - 0: Non-HSIC-capable
 */
#define USB_OTGHS_GHWCFG3_HSICMODE    (BIT(13))
#define USB_OTGHS_GHWCFG3_HSICMODE_M  (USB_OTGHS_GHWCFG3_HSICMODE_V << USB_OTGHS_GHWCFG3_HSICMODE_S)
#define USB_OTGHS_GHWCFG3_HSICMODE_V  0x00000001U
#define USB_OTGHS_GHWCFG3_HSICMODE_S  13
/** USB_OTGHS_GHWCFG3_BCSUPPORT : RO; bitpos: [14]; default: 1;
 *  This bit indicates the controller support for Battery Charger.
 *  - 0 - No Battery Charger Support
 *  - 1 - Battery Charger support present
 */
#define USB_OTGHS_GHWCFG3_BCSUPPORT    (BIT(14))
#define USB_OTGHS_GHWCFG3_BCSUPPORT_M  (USB_OTGHS_GHWCFG3_BCSUPPORT_V << USB_OTGHS_GHWCFG3_BCSUPPORT_S)
#define USB_OTGHS_GHWCFG3_BCSUPPORT_V  0x00000001U
#define USB_OTGHS_GHWCFG3_BCSUPPORT_S  14
/** USB_OTGHS_GHWCFG3_LPMMODE : RO; bitpos: [15]; default: 0;
 *  LPM mode specified for Mode of Operation.
 */
#define USB_OTGHS_GHWCFG3_LPMMODE    (BIT(15))
#define USB_OTGHS_GHWCFG3_LPMMODE_M  (USB_OTGHS_GHWCFG3_LPMMODE_V << USB_OTGHS_GHWCFG3_LPMMODE_S)
#define USB_OTGHS_GHWCFG3_LPMMODE_V  0x00000001U
#define USB_OTGHS_GHWCFG3_LPMMODE_S  15
/** USB_OTGHS_GHWCFG3_DFIFODEPTH : RO; bitpos: [31:16]; default: 896;
 *  DFIFO Depth (DfifoDepth - EP_LOC_CNT)
 *
 *  This value is in terms of 32-bit words.
 *  - Minimum value is 32
 *  - Maximum value is 32,768
 *  Note: This field is configured using the OTG_DFIFO_DEPTH parameter. For more
 *  information on EP_LOC_CNT, see the Endpoint Information Controller (EPINFO_CTL)
 *  section.
 */
#define USB_OTGHS_GHWCFG3_DFIFODEPTH    0x0000FFFFU
#define USB_OTGHS_GHWCFG3_DFIFODEPTH_M  (USB_OTGHS_GHWCFG3_DFIFODEPTH_V << USB_OTGHS_GHWCFG3_DFIFODEPTH_S)
#define USB_OTGHS_GHWCFG3_DFIFODEPTH_V  0x0000FFFFU
#define USB_OTGHS_GHWCFG3_DFIFODEPTH_S  16

/** USB_OTGHS_GHWCFG4_REG register
 *  This register contains configuration options selected using coreConsultant. Note:
 *  Bit [31] is available only when Scatter/Gather DMA mode is enabled. When
 *  Scatter/Gather DMA mode is disabled, this field is reserved.
 */
#define USB_OTGHS_GHWCFG4_REG (DR_REG_USB_OTGHS_BASE + 0x50)
/** USB_OTGHS_GHWCFG4_NUMDEVPERIOEPS : RO; bitpos: [3:0]; default: 0;
 *  Number of Device Mode Periodic IN Endpoints (NumDevPerioEps)
 *
 *  Range: 0-15
 */
#define USB_OTGHS_GHWCFG4_NUMDEVPERIOEPS    0x0000000FU
#define USB_OTGHS_GHWCFG4_NUMDEVPERIOEPS_M  (USB_OTGHS_GHWCFG4_NUMDEVPERIOEPS_V << USB_OTGHS_GHWCFG4_NUMDEVPERIOEPS_S)
#define USB_OTGHS_GHWCFG4_NUMDEVPERIOEPS_V  0x0000000FU
#define USB_OTGHS_GHWCFG4_NUMDEVPERIOEPS_S  0
/** USB_OTGHS_GHWCFG4_PARTIALPWRDN : RO; bitpos: [4]; default: 1;
 *  Enable Partial Power Down (PartialPwrDn)
 *  - 1'b0: Partial Power Down Not Enabled
 *  - 1'b1: Partial Power Down Enabled
 */
#define USB_OTGHS_GHWCFG4_PARTIALPWRDN    (BIT(4))
#define USB_OTGHS_GHWCFG4_PARTIALPWRDN_M  (USB_OTGHS_GHWCFG4_PARTIALPWRDN_V << USB_OTGHS_GHWCFG4_PARTIALPWRDN_S)
#define USB_OTGHS_GHWCFG4_PARTIALPWRDN_V  0x00000001U
#define USB_OTGHS_GHWCFG4_PARTIALPWRDN_S  4
/** USB_OTGHS_GHWCFG4_AHBFREQ : RO; bitpos: [5]; default: 1;
 *  Minimum AHB Frequency Less Than 60 MHz (AhbFreq)
 *  - 1'b0: No
 *  - 1'b1: Yes
 */
#define USB_OTGHS_GHWCFG4_AHBFREQ    (BIT(5))
#define USB_OTGHS_GHWCFG4_AHBFREQ_M  (USB_OTGHS_GHWCFG4_AHBFREQ_V << USB_OTGHS_GHWCFG4_AHBFREQ_S)
#define USB_OTGHS_GHWCFG4_AHBFREQ_V  0x00000001U
#define USB_OTGHS_GHWCFG4_AHBFREQ_S  5
/** USB_OTGHS_GHWCFG4_HIBERNATION : RO; bitpos: [6]; default: 0;
 *  Enable Hibernation (Hibernation)
 *  - 1'b0: Hibernation feature not enabled
 *  - 1'b1: Hibernation feature enabled
 */
#define USB_OTGHS_GHWCFG4_HIBERNATION    (BIT(6))
#define USB_OTGHS_GHWCFG4_HIBERNATION_M  (USB_OTGHS_GHWCFG4_HIBERNATION_V << USB_OTGHS_GHWCFG4_HIBERNATION_S)
#define USB_OTGHS_GHWCFG4_HIBERNATION_V  0x00000001U
#define USB_OTGHS_GHWCFG4_HIBERNATION_S  6
/** USB_OTGHS_GHWCFG4_EXTENDEDHIBERNATION : RO; bitpos: [7]; default: 0;
 *  Enable Hibernation
 *  - 1'b0: Extended Hibernation feature not enabled
 *  - 1'b1: Extended Hibernation feature enabled
 */
#define USB_OTGHS_GHWCFG4_EXTENDEDHIBERNATION    (BIT(7))
#define USB_OTGHS_GHWCFG4_EXTENDEDHIBERNATION_M  (USB_OTGHS_GHWCFG4_EXTENDEDHIBERNATION_V << USB_OTGHS_GHWCFG4_EXTENDEDHIBERNATION_S)
#define USB_OTGHS_GHWCFG4_EXTENDEDHIBERNATION_V  0x00000001U
#define USB_OTGHS_GHWCFG4_EXTENDEDHIBERNATION_S  7
/** USB_OTGHS_GHWCFG4_ENHANCEDLPMSUPT1 : RO; bitpos: [9]; default: 1;
 *  Enhanced LPM Support1 (EnhancedLPMSupt1)
 *  - This bit indicates that the controller supports L1 entry based on FIFO status.
 *  - Accept L1 Request even if Bulk/Interrupt TxFIFO is not empty.
 */
#define USB_OTGHS_GHWCFG4_ENHANCEDLPMSUPT1    (BIT(9))
#define USB_OTGHS_GHWCFG4_ENHANCEDLPMSUPT1_M  (USB_OTGHS_GHWCFG4_ENHANCEDLPMSUPT1_V << USB_OTGHS_GHWCFG4_ENHANCEDLPMSUPT1_S)
#define USB_OTGHS_GHWCFG4_ENHANCEDLPMSUPT1_V  0x00000001U
#define USB_OTGHS_GHWCFG4_ENHANCEDLPMSUPT1_S  9
/** USB_OTGHS_GHWCFG4_SERVINTFLOW : RO; bitpos: [10]; default: 0;
 *  Service Interval Flow
 *
 *  This bit indicates that the controller supports Service-Interval based scheduling
 *  flow for ISOC IN EPs.
 */
#define USB_OTGHS_GHWCFG4_SERVINTFLOW    (BIT(10))
#define USB_OTGHS_GHWCFG4_SERVINTFLOW_M  (USB_OTGHS_GHWCFG4_SERVINTFLOW_V << USB_OTGHS_GHWCFG4_SERVINTFLOW_S)
#define USB_OTGHS_GHWCFG4_SERVINTFLOW_V  0x00000001U
#define USB_OTGHS_GHWCFG4_SERVINTFLOW_S  10
/** USB_OTGHS_GHWCFG4_IPGISOCSUPT : RO; bitpos: [11]; default: 1;
 *  Interpacket Gap ISOC OUT Worst-case Support (ipgisocSupt)
 *
 *  This bit indicates that the controller supports the worst-case scenario of Rx
 *  followed by Rx Inter Packet Gap (IPG) (32-bit times) as per the UTMI Specification
 *  for any token following an ISOC OUT token. Without this support, when any token
 *  follows an ISOC OUT token with the worst-case IPG, the controller does not detect
 *  the followed token. The worst-case IPG of the controller without this support
 *  depends on the AHB and PHY clock frequency.By default IPG Support is enabled.
 */
#define USB_OTGHS_GHWCFG4_IPGISOCSUPT    (BIT(11))
#define USB_OTGHS_GHWCFG4_IPGISOCSUPT_M  (USB_OTGHS_GHWCFG4_IPGISOCSUPT_V << USB_OTGHS_GHWCFG4_IPGISOCSUPT_S)
#define USB_OTGHS_GHWCFG4_IPGISOCSUPT_V  0x00000001U
#define USB_OTGHS_GHWCFG4_IPGISOCSUPT_S  11
/** USB_OTGHS_GHWCFG4_ACGSUPT : RO; bitpos: [12]; default: 0;
 *  Active Clock Gating Support
 *
 *  This bit indicates that the controller supports the Dynamic (Switching) Power
 *  Reduction during periods
 *  when there is no USB and AHB Traffic.
 *  - 1'b0:  Active Clock Gating is not enabled.
 *  - 1'b1:  Active Clock Gating Enabled.
 */
#define USB_OTGHS_GHWCFG4_ACGSUPT    (BIT(12))
#define USB_OTGHS_GHWCFG4_ACGSUPT_M  (USB_OTGHS_GHWCFG4_ACGSUPT_V << USB_OTGHS_GHWCFG4_ACGSUPT_S)
#define USB_OTGHS_GHWCFG4_ACGSUPT_V  0x00000001U
#define USB_OTGHS_GHWCFG4_ACGSUPT_S  12
/** USB_OTGHS_GHWCFG4_ENHANCEDLPMSUPT : RO; bitpos: [13]; default: 1;
 *  Enhanced LPM Support (EnhancedLPMSupt)
 *
 *  This bit indicates that the controller supports the following behavior:
 *  L1 Entry Behavior based on FIFO Status
 *  - TX FIFO
 *  - Accept L1 Request even if ISOC IN TX FIFO is not empty.
 *  - Reject L1 Request if Non-Periodic TX FIFO is not empty.
 *  - Ensure application can flush the TX FIFO while the Controller is in L1.
 *  - RX FIFO
 *  - Accept L1 Request even if RX FIFO (common to Periodic and Non-Periodic) is not
 *  empty.
 *  - Accept L1 Request but delay SLEEPM assertion until RX SINK Buffer is empty.
 *
 *  Prevent L1 Entry if a Control Transfer is in progress on any Control Endpoint.
 *  Ability to Flush TxFIFO even if PHY Clock is gated.
 *
 */
#define USB_OTGHS_GHWCFG4_ENHANCEDLPMSUPT    (BIT(13))
#define USB_OTGHS_GHWCFG4_ENHANCEDLPMSUPT_M  (USB_OTGHS_GHWCFG4_ENHANCEDLPMSUPT_V << USB_OTGHS_GHWCFG4_ENHANCEDLPMSUPT_S)
#define USB_OTGHS_GHWCFG4_ENHANCEDLPMSUPT_V  0x00000001U
#define USB_OTGHS_GHWCFG4_ENHANCEDLPMSUPT_S  13
/** USB_OTGHS_GHWCFG4_PHYDATAWIDTH : RO; bitpos: [15:14]; default: 2;
 *  UTMI+ PHY/ULPI-to-Internal UTMI+ Wrapper Data Width
 *  (PhyDataWidth)<vr>When a ULPI PHY is used, an internal wrapper converts ULPI to
 *  UTMI+.
 *  - 2'b00: 8 bits
 *  - 2'b01: 16 bits
 *  - 2'b10: 8/16 bits, software selectable
 *  - Others: Reserved
 */
#define USB_OTGHS_GHWCFG4_PHYDATAWIDTH    0x00000003U
#define USB_OTGHS_GHWCFG4_PHYDATAWIDTH_M  (USB_OTGHS_GHWCFG4_PHYDATAWIDTH_V << USB_OTGHS_GHWCFG4_PHYDATAWIDTH_S)
#define USB_OTGHS_GHWCFG4_PHYDATAWIDTH_V  0x00000003U
#define USB_OTGHS_GHWCFG4_PHYDATAWIDTH_S  14
/** USB_OTGHS_GHWCFG4_NUMCTLEPS : RO; bitpos: [19:16]; default: 1;
 *  Number of Device Mode Control Endpoints in Addition to
 *  Endpoint 0 (NumCtlEps)
 *  Range: 0-15
 */
#define USB_OTGHS_GHWCFG4_NUMCTLEPS    0x0000000FU
#define USB_OTGHS_GHWCFG4_NUMCTLEPS_M  (USB_OTGHS_GHWCFG4_NUMCTLEPS_V << USB_OTGHS_GHWCFG4_NUMCTLEPS_S)
#define USB_OTGHS_GHWCFG4_NUMCTLEPS_V  0x0000000FU
#define USB_OTGHS_GHWCFG4_NUMCTLEPS_S  16
/** USB_OTGHS_GHWCFG4_IDDGFLTR : RO; bitpos: [20]; default: 1;
 *  IDDIG Filter Enable (IddgFltr)
 *  - 1'b0: No filter
 *  - 1'b1: Filter
 */
#define USB_OTGHS_GHWCFG4_IDDGFLTR    (BIT(20))
#define USB_OTGHS_GHWCFG4_IDDGFLTR_M  (USB_OTGHS_GHWCFG4_IDDGFLTR_V << USB_OTGHS_GHWCFG4_IDDGFLTR_S)
#define USB_OTGHS_GHWCFG4_IDDGFLTR_V  0x00000001U
#define USB_OTGHS_GHWCFG4_IDDGFLTR_S  20
/** USB_OTGHS_GHWCFG4_VBUSVALIDFLTR : RO; bitpos: [21]; default: 0;
 *  VBUS Valid Filter Enabled (VBusValidFltr)
 *  - 1'b0: No filter
 *  - 1'b1: Filter
 */
#define USB_OTGHS_GHWCFG4_VBUSVALIDFLTR    (BIT(21))
#define USB_OTGHS_GHWCFG4_VBUSVALIDFLTR_M  (USB_OTGHS_GHWCFG4_VBUSVALIDFLTR_V << USB_OTGHS_GHWCFG4_VBUSVALIDFLTR_S)
#define USB_OTGHS_GHWCFG4_VBUSVALIDFLTR_V  0x00000001U
#define USB_OTGHS_GHWCFG4_VBUSVALIDFLTR_S  21
/** USB_OTGHS_GHWCFG4_AVALIDFLTR : RO; bitpos: [22]; default: 0;
 *  a_valid Filter Enabled (AValidFltr)
 *  - 1'b0: No filter
 *  - 1'b1: Filter
 */
#define USB_OTGHS_GHWCFG4_AVALIDFLTR    (BIT(22))
#define USB_OTGHS_GHWCFG4_AVALIDFLTR_M  (USB_OTGHS_GHWCFG4_AVALIDFLTR_V << USB_OTGHS_GHWCFG4_AVALIDFLTR_S)
#define USB_OTGHS_GHWCFG4_AVALIDFLTR_V  0x00000001U
#define USB_OTGHS_GHWCFG4_AVALIDFLTR_S  22
/** USB_OTGHS_GHWCFG4_BVALIDFLTR : RO; bitpos: [23]; default: 0;
 *  b_valid Filter Enabled (BValidFltr)
 *  - 1'b0: No filter
 *  - 1'b1: Filter
 */
#define USB_OTGHS_GHWCFG4_BVALIDFLTR    (BIT(23))
#define USB_OTGHS_GHWCFG4_BVALIDFLTR_M  (USB_OTGHS_GHWCFG4_BVALIDFLTR_V << USB_OTGHS_GHWCFG4_BVALIDFLTR_S)
#define USB_OTGHS_GHWCFG4_BVALIDFLTR_V  0x00000001U
#define USB_OTGHS_GHWCFG4_BVALIDFLTR_S  23
/** USB_OTGHS_GHWCFG4_SESSENDFLTR : RO; bitpos: [24]; default: 0;
 *  session_end Filter Enabled (SessEndFltr)
 *  - 1'b0: No filter
 *  - 1'b1: Filter
 */
#define USB_OTGHS_GHWCFG4_SESSENDFLTR    (BIT(24))
#define USB_OTGHS_GHWCFG4_SESSENDFLTR_M  (USB_OTGHS_GHWCFG4_SESSENDFLTR_V << USB_OTGHS_GHWCFG4_SESSENDFLTR_S)
#define USB_OTGHS_GHWCFG4_SESSENDFLTR_V  0x00000001U
#define USB_OTGHS_GHWCFG4_SESSENDFLTR_S  24
/** USB_OTGHS_GHWCFG4_DEDFIFOMODE : RO; bitpos: [25]; default: 1;
 *  Enable Dedicated Transmit FIFO for device IN Endpoints
 *  (DedFifoMode)
 *  - 1'b0 : Dedicated Transmit FIFO Operation not enabled.
 *  - 1'b1 : Dedicated Transmit FIFO Operation enabled.
 */
#define USB_OTGHS_GHWCFG4_DEDFIFOMODE    (BIT(25))
#define USB_OTGHS_GHWCFG4_DEDFIFOMODE_M  (USB_OTGHS_GHWCFG4_DEDFIFOMODE_V << USB_OTGHS_GHWCFG4_DEDFIFOMODE_S)
#define USB_OTGHS_GHWCFG4_DEDFIFOMODE_V  0x00000001U
#define USB_OTGHS_GHWCFG4_DEDFIFOMODE_S  25
/** USB_OTGHS_GHWCFG4_INEPS : RO; bitpos: [29:26]; default: 7;
 *  Number of Device Mode IN Endpoints Including Control Endpoints (INEps)
 *  - 0: 1 IN Endpoint
 *  - 1: 2 IN Endpoints
 *  ....
 *  - 15: 16 IN Endpoints
 */
#define USB_OTGHS_GHWCFG4_INEPS    0x0000000FU
#define USB_OTGHS_GHWCFG4_INEPS_M  (USB_OTGHS_GHWCFG4_INEPS_V << USB_OTGHS_GHWCFG4_INEPS_S)
#define USB_OTGHS_GHWCFG4_INEPS_V  0x0000000FU
#define USB_OTGHS_GHWCFG4_INEPS_S  26
/** USB_OTGHS_GHWCFG4_DESCDMAENABLED : RO; bitpos: [30]; default: 1;
 *  Scatter/Gather DMA configuration
 *  - 1'b0: Non-Scatter/Gather DMA configuration
 *  - 1'b1: Scatter/Gather DMA configuration
 */
#define USB_OTGHS_GHWCFG4_DESCDMAENABLED    (BIT(30))
#define USB_OTGHS_GHWCFG4_DESCDMAENABLED_M  (USB_OTGHS_GHWCFG4_DESCDMAENABLED_V << USB_OTGHS_GHWCFG4_DESCDMAENABLED_S)
#define USB_OTGHS_GHWCFG4_DESCDMAENABLED_V  0x00000001U
#define USB_OTGHS_GHWCFG4_DESCDMAENABLED_S  30
/** USB_OTGHS_GHWCFG4_DESCDMA : RO; bitpos: [31]; default: 1;
 *  Scatter/Gather DMA configuration
 *  - 1'b0: Non Dynamic configuration
 *  - 1'b1: Dynamic configuration
 *  Note: This field is configured using the OTG_EN_DESC_DMA parameter.
 */
#define USB_OTGHS_GHWCFG4_DESCDMA    (BIT(31))
#define USB_OTGHS_GHWCFG4_DESCDMA_M  (USB_OTGHS_GHWCFG4_DESCDMA_V << USB_OTGHS_GHWCFG4_DESCDMA_S)
#define USB_OTGHS_GHWCFG4_DESCDMA_V  0x00000001U
#define USB_OTGHS_GHWCFG4_DESCDMA_S  31

/** USB_OTGHS_GDFIFOCFG_REG register
 *  Register to configure the DFIFOs for the controller.
 */
#define USB_OTGHS_GDFIFOCFG_REG (DR_REG_USB_OTGHS_BASE + 0x5c)
/** USB_OTGHS_GDFIFOCFG_GDFIFOCFG : R/W; bitpos: [15:0]; default: 1024;
 *  GDFIFOCfg
 *
 *  This field is for dynamic programming of the DFIFO Size. This value takes effect
 *  only when the application programs a non zero value to this register. The value
 *  programmed must conform to the guidelines described in 'FIFO RAM Allocation'. The
 *  core does not have any corrective logic if the FIFO sizes are programmed
 *  incorrectly.
 */
#define USB_OTGHS_GDFIFOCFG_GDFIFOCFG    0x0000FFFFU
#define USB_OTGHS_GDFIFOCFG_GDFIFOCFG_M  (USB_OTGHS_GDFIFOCFG_GDFIFOCFG_V << USB_OTGHS_GDFIFOCFG_GDFIFOCFG_S)
#define USB_OTGHS_GDFIFOCFG_GDFIFOCFG_V  0x0000FFFFU
#define USB_OTGHS_GDFIFOCFG_GDFIFOCFG_S  0
/** USB_OTGHS_GDFIFOCFG_EPINFOBASEADDR : R/W; bitpos: [31:16]; default: 896;
 *  This field provides the start address of the EP info controller.
 *  The EP info controller manages the stored values in the last few locations of the
 *  SPRAM as listed below.
 *
 *  - Host Buffer DMA mode: One location per channel is used in SPRAM to store the
 *  HCDMAn value.
 *  - Host Scatter/Gather DMA mode: Four locations per channel are used in SPRAM to
 *  store the Base Descriptor address, Current Descriptor address, Current Buffer
 *  Pointer, and the Status Quadlet.
 *  - Device Buffer DMA mode: One location per endpoint direction is used in SPRAM to
 *  store the DIEPDMA and DOEPDMA value.
 *  - Device Scatter/Gather DMA mode: Four locations per endpoint direction are used in
 *  SPRAM to store the Base Descriptor address, Current Descriptor address, Current
 *  Buffer Pointer and the Status Quadlet.
 */
#define USB_OTGHS_GDFIFOCFG_EPINFOBASEADDR    0x0000FFFFU
#define USB_OTGHS_GDFIFOCFG_EPINFOBASEADDR_M  (USB_OTGHS_GDFIFOCFG_EPINFOBASEADDR_V << USB_OTGHS_GDFIFOCFG_EPINFOBASEADDR_S)
#define USB_OTGHS_GDFIFOCFG_EPINFOBASEADDR_V  0x0000FFFFU
#define USB_OTGHS_GDFIFOCFG_EPINFOBASEADDR_S  16

/** USB_OTGHS_GINTMSK2_REG register
 *  This register works with the Interrupt Register (GINTSTS2) to interrupt the
 *  application. When an interrupt bit is masked, the interrupt associated with that
 *  bit is not generated. However, the GINTSTS2 register bit corresponding to that
 *  interrupt is still set.  Note: The fields of this register change depending on host
 *  or device mode.
 */
#define USB_OTGHS_GINTMSK2_REG (DR_REG_USB_OTGHS_BASE + 0x68)
/** USB_OTGHS_GINTMSK2_GINTMSK2 : R/W; bitpos: [31:0]; default: 0;
 *  Resvered
 */
#define USB_OTGHS_GINTMSK2_GINTMSK2    0xFFFFFFFFU
#define USB_OTGHS_GINTMSK2_GINTMSK2_M  (USB_OTGHS_GINTMSK2_GINTMSK2_V << USB_OTGHS_GINTMSK2_GINTMSK2_S)
#define USB_OTGHS_GINTMSK2_GINTMSK2_V  0xFFFFFFFFU
#define USB_OTGHS_GINTMSK2_GINTMSK2_S  0

/** USB_OTGHS_GINTSTS2_REG register
 *  This register interrupts the application for system-level events in the current
 *  mode (Device mode or Host mode). Some of the bits in this register are valid only
 *  in Host mode, while others are valid in Device mode only. This register also
 *  indicates the current mode. To clear the interrupt status bits of type R_SS_WC, the
 *  application must write 1'b1 to the bit. The application must clear the GINTSTS2
 *  register at initialization before unmasking the interrupt bit to avoid any
 *  interrupts generated prior to initialization.
 */
#define USB_OTGHS_GINTSTS2_REG (DR_REG_USB_OTGHS_BASE + 0x6c)
/** USB_OTGHS_GINTSTS2_GINTSTS2 : R/W; bitpos: [31:0]; default: 0;
 *  Resvered
 */
#define USB_OTGHS_GINTSTS2_GINTSTS2    0xFFFFFFFFU
#define USB_OTGHS_GINTSTS2_GINTSTS2_M  (USB_OTGHS_GINTSTS2_GINTSTS2_V << USB_OTGHS_GINTSTS2_GINTSTS2_S)
#define USB_OTGHS_GINTSTS2_GINTSTS2_V  0xFFFFFFFFU
#define USB_OTGHS_GINTSTS2_GINTSTS2_S  0

