espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_HPTXFSIZ_REG register
 *  This register holds the size and the memory start address of the Periodic TxFIFO.
 *  Note: Read the reset value of this register only after the following conditions:  -
 *  If IDDIG_FILTER is disabled, read only after PHY clock is stable.  - If
 *  IDDIG_FILTER is enabled, read only after the filter timer expires.
 */
#define USB_OTGHS_HPTXFSIZ_REG (DR_REG_USB_OTGHS_BASE + 0x100)
/** USB_OTGHS_HPTXFSIZ_PTXFSTADDR : R/W; bitpos: [11:0]; default: 2048;
 *  Host Periodic TxFIFO Start Address (PTxFStAddr)
 *
 *  The power-on reset value of this register is the sum of the Largest Rx Data FIFO
 *  Depth and Largest Non-periodic Tx Data FIFO Depth.These parameters are:
 *
 *  In shared FIFO operation:
 *  - OTG_RX_DFIFO_DEPTH + OTG_TX_NPERIO_DFIFO_DEPTH
 *
 *  In dedicated FIFO mode:
 *  - OTG_RX_DFIFO_DEPTH + OTG_TX_HNPERIO_DFIFO_DEPTH If Enable Dynamic FIFO Sizing?
 *  was deselected in coreConsultant (parameter OTG_DFIFO_DYNAMIC = 0), these flops are
 *  optimized, and reads return the power-on value. If Enable Dynamic FIFO Sizing? was
 *  selected in coreConsultant (parameter OTG_DFIFO_DYNAMIC = 1), you can write a new
 *  value in this field.
 *
 *  Programmed values must not exceed the power-on value set in coreConsultant.
 */
#define USB_OTGHS_HPTXFSIZ_PTXFSTADDR    0x00000FFFU
#define USB_OTGHS_HPTXFSIZ_PTXFSTADDR_M  (USB_OTGHS_HPTXFSIZ_PTXFSTADDR_V << USB_OTGHS_HPTXFSIZ_PTXFSTADDR_S)
#define USB_OTGHS_HPTXFSIZ_PTXFSTADDR_V  0x00000FFFU
#define USB_OTGHS_HPTXFSIZ_PTXFSTADDR_S  0
/** USB_OTGHS_HPTXFSIZ_PTXFSIZE : R/W; bitpos: [26:16]; default: 1024;
 *  Host Periodic TxFIFO Depth (PTxFSize)
 *
 *  This value is in terms of 32-bit words.
 *  - Minimum value is 16
 *  - Maximum value is 32,768
 *  The power-on reset value of this register is specified as the Largest Host Mode
 *  Periodic Tx Data FIFO Depth.
 *  - If Enable Dynamic FIFO Sizing? was deselected in coreConsultant (parameter
 *  OTG_DFIFO_DYNAMIC = 0), these flops are optimized, and reads return the power-on
 *  value.
 *  - If Enable Dynamic FIFO Sizing? was selected in coreConsultant (parameter
 *  OTG_DFIFO_DYNAMIC = 1), you can write a new value in this field.
 *  Programmed values must not exceed the power-on value set in coreConsultant.
 */
#define USB_OTGHS_HPTXFSIZ_PTXFSIZE    0x000007FFU
#define USB_OTGHS_HPTXFSIZ_PTXFSIZE_M  (USB_OTGHS_HPTXFSIZ_PTXFSIZE_V << USB_OTGHS_HPTXFSIZ_PTXFSIZE_S)
#define USB_OTGHS_HPTXFSIZ_PTXFSIZE_V  0x000007FFU
#define USB_OTGHS_HPTXFSIZ_PTXFSIZE_S  16

/** USB_OTGHS_DIEPTXF1_REG register
 *  This register is valid only in dedicated FIFO mode (OTG_EN_DED_TX_FIFO=1). It holds
 *  the size and memory start address of IN endpoint TxFIFOs implemented in Device
 *  mode. Each FIFO holds the data for one IN endpoint. This register is repeated for
 *  instantiated IN endpoint FIFOs 1 to 15. For IN endpoint FIFO 0, use GNPTXFSIZ
 *  register for programming the size and memory start address.
 */
#define USB_OTGHS_DIEPTXF1_REG (DR_REG_USB_OTGHS_BASE + 0x104)
/** USB_OTGHS_DIEPTXF1_INEPNTXFSTADDR : R/W; bitpos: [10:0]; default: 1536;
 *  IN Endpoint FIFOn Transmit RAM Start Address (INEPnTxFStAddr)
 *
 *  This field contains the memory start address for the IN endpoint Transmit FIFO that
 *  this register corresponds to.
 *  The power-on reset value of this register is calculated according to the following
 *  formula: OTG_RX_DFIFO_DEPTH + SUM of OTG_TX_DINEP_DFIFO_DEPTH_'n', where n = 0 to
 *  (FIFO number-1).
 *  For example,
 *  Start address of INEP FIFO 1 (DIEPTXF1) is OTG_RX_DFIFO_DEPTH +
 *  OTG_TX_DINEP_DFIFO_DEPTH_0, start address of INEP FIFO 2 (DIEPTXF2) is
 *  OTG_RX_DFIFO_DEPTH + OTG_TX_DINEP_DFIFO_DEPTH_0 + OTG_TX_DINEP_DFIFO_DEPTH_1, and
 *  so on.
 *  If at POR the calculated value (C) exceeds 65535, then the Reset value becomes
 *  Reset Value(A) = (C-65536).
 *  - If Enable Dynamic FIFO Sizing is deselected in coreConsultant (OTG_DFIFO_DYNAMIC
 *  = 0), this field is read-only and read value is the power-on reset value.
 *  - If Enable Dynamic FIFO Sizing is selected in coreConsultant (OTG_DFIFO_DYNAMIC =
 *  1), and you have calculated or programmed a new value for RxFIFO depth or TX FIFO
 *  depths, you can program their values according to the above formula. Programmed
 *  values must not exceed the power-on value set in coreConsultant.
 */
#define USB_OTGHS_DIEPTXF1_INEPNTXFSTADDR    0x000007FFU
#define USB_OTGHS_DIEPTXF1_INEPNTXFSTADDR_M  (USB_OTGHS_DIEPTXF1_INEPNTXFSTADDR_V << USB_OTGHS_DIEPTXF1_INEPNTXFSTADDR_S)
#define USB_OTGHS_DIEPTXF1_INEPNTXFSTADDR_V  0x000007FFU
#define USB_OTGHS_DIEPTXF1_INEPNTXFSTADDR_S  0
/** USB_OTGHS_DIEPTXF1_INEPNTXFDEP : R/W; bitpos: [25:16]; default: 512;
 *  IN Endpoint TxFIFO Depth (INEPnTxFDep)
 *
 *  This value is in terms of 32-bit words.
 *  - Minimum value is 16
 *  - Maximum value is 32,768
 *  The power-on reset value of this register is specified as the Largest IN Endpoint
 *  FIFO number Depth (parameter OTG_TX_DINEP_DFIFO_DEPTH_i) set during coreConsultant
 *  configuration, where i is the FIFO number this register corresponds to.
 *  - If Enable Dynamic FIFO Sizing? was deselected in coreConsultant (parameter
 *  OTG_DFIFO_DYNAMIC = 0), these flops are optimized, and reads return the power-on
 *  value.
 *  - If Enable Dynamic FIFO Sizing? was selected in coreConsultant (parameter
 *  OTG_DFIFO_DYNAMIC = 1), you can write a new value in this field.
 *  Programmed values must not exceed the power-on value.
 */
#define USB_OTGHS_DIEPTXF1_INEPNTXFDEP    0x000003FFU
#define USB_OTGHS_DIEPTXF1_INEPNTXFDEP_M  (USB_OTGHS_DIEPTXF1_INEPNTXFDEP_V << USB_OTGHS_DIEPTXF1_INEPNTXFDEP_S)
#define USB_OTGHS_DIEPTXF1_INEPNTXFDEP_V  0x000003FFU
#define USB_OTGHS_DIEPTXF1_INEPNTXFDEP_S  16

/** USB_OTGHS_DIEPTXF2_REG register
 *  This register is valid only in dedicated FIFO mode (OTG_EN_DED_TX_FIFO=1). It holds
 *  the size and memory start address of IN endpoint TxFIFOs implemented in Device
 *  mode. Each FIFO holds the data for one IN endpoint. This register is repeated for
 *  instantiated IN endpoint FIFOs 1 to 15. For IN endpoint FIFO 0, use GNPTXFSIZ
 *  register for programming the size and memory start address.
 */
#define USB_OTGHS_DIEPTXF2_REG (DR_REG_USB_OTGHS_BASE + 0x108)
/** USB_OTGHS_DIEPTXF2_INEPNTXFSTADDR : R/W; bitpos: [11:0]; default: 2048;
 *  IN Endpoint FIFOn Transmit RAM Start Address (INEPnTxFStAddr)
 *
 *  This field contains the memory start address for the IN endpoint Transmit FIFO that
 *  this register corresponds to.
 *  The power-on reset value of this register is calculated according to the following
 *  formula: OTG_RX_DFIFO_DEPTH + SUM of OTG_TX_DINEP_DFIFO_DEPTH_'n', where n = 0 to
 *  (FIFO number-1).
 *  For example,
 *  Start address of INEP FIFO 1 (DIEPTXF1) is OTG_RX_DFIFO_DEPTH +
 *  OTG_TX_DINEP_DFIFO_DEPTH_0, start address of INEP FIFO 2 (DIEPTXF2) is
 *  OTG_RX_DFIFO_DEPTH + OTG_TX_DINEP_DFIFO_DEPTH_0 + OTG_TX_DINEP_DFIFO_DEPTH_1, and
 *  so on.
 *  If at POR the calculated value (C) exceeds 65535, then the Reset value becomes
 *  Reset Value(A) = (C-65536).
 *  - If Enable Dynamic FIFO Sizing is deselected in coreConsultant (OTG_DFIFO_DYNAMIC
 *  = 0), this field is read-only and read value is the power-on reset value.
 *  - If Enable Dynamic FIFO Sizing is selected in coreConsultant (OTG_DFIFO_DYNAMIC =
 *  1), and you have calculated or programmed a new value for RxFIFO depth or TX FIFO
 *  depths, you can program their values according to the above formula. Programmed
 *  values must not exceed the power-on value set in coreConsultant.
 */
#define USB_OTGHS_DIEPTXF2_INEPNTXFSTADDR    0x00000FFFU
#define USB_OTGHS_DIEPTXF2_INEPNTXFSTADDR_M  (USB_OTGHS_DIEPTXF2_INEPNTXFSTADDR_V << USB_OTGHS_DIEPTXF2_INEPNTXFSTADDR_S)
#define USB_OTGHS_DIEPTXF2_INEPNTXFSTADDR_V  0x00000FFFU
#define USB_OTGHS_DIEPTXF2_INEPNTXFSTADDR_S  0
/** USB_OTGHS_DIEPTXF2_INEPNTXFDEP : R/W; bitpos: [25:16]; default: 512;
 *  IN Endpoint TxFIFO Depth (INEPnTxFDep)
 *
 *  This value is in terms of 32-bit words.
 *  - Minimum value is 16
 *  - Maximum value is 32,768
 *  The power-on reset value of this register is specified as the Largest IN Endpoint
 *  FIFO number Depth (parameter OTG_TX_DINEP_DFIFO_DEPTH_i) set during coreConsultant
 *  configuration, where i is the FIFO number this register corresponds to.
 *  - If Enable Dynamic FIFO Sizing? was deselected in coreConsultant (parameter
 *  OTG_DFIFO_DYNAMIC = 0), these flops are optimized, and reads return the power-on
 *  value.
 *  - If Enable Dynamic FIFO Sizing? was selected in coreConsultant (parameter
 *  OTG_DFIFO_DYNAMIC = 1), you can write a new value in this field.
 *  Programmed values must not exceed the power-on value.
 */
#define USB_OTGHS_DIEPTXF2_INEPNTXFDEP    0x000003FFU
#define USB_OTGHS_DIEPTXF2_INEPNTXFDEP_M  (USB_OTGHS_DIEPTXF2_INEPNTXFDEP_V << USB_OTGHS_DIEPTXF2_INEPNTXFDEP_S)
#define USB_OTGHS_DIEPTXF2_INEPNTXFDEP_V  0x000003FFU
#define USB_OTGHS_DIEPTXF2_INEPNTXFDEP_S  16

/** USB_OTGHS_DIEPTXF3_REG register
 *  This register is valid only in dedicated FIFO mode (OTG_EN_DED_TX_FIFO=1). It holds
 *  the size and memory start address of IN endpoint TxFIFOs implemented in Device
 *  mode. Each FIFO holds the data for one IN endpoint. This register is repeated for
 *  instantiated IN endpoint FIFOs 1 to 15. For IN endpoint FIFO 0, use GNPTXFSIZ
 *  register for programming the size and memory start address.
 */
#define USB_OTGHS_DIEPTXF3_REG (DR_REG_USB_OTGHS_BASE + 0x10c)
/** USB_OTGHS_DIEPTXF3_INEPNTXFSTADDR : R/W; bitpos: [11:0]; default: 2560;
 *  IN Endpoint FIFOn Transmit RAM Start Address (INEPnTxFStAddr)
 *
 *  This field contains the memory start address for the IN endpoint Transmit FIFO that
 *  this register corresponds to.
 *  The power-on reset value of this register is calculated according to the following
 *  formula: OTG_RX_DFIFO_DEPTH + SUM of OTG_TX_DINEP_DFIFO_DEPTH_'n', where n = 0 to
 *  (FIFO number-1).
 *  For example,
 *  Start address of INEP FIFO 1 (DIEPTXF1) is OTG_RX_DFIFO_DEPTH +
 *  OTG_TX_DINEP_DFIFO_DEPTH_0, start address of INEP FIFO 2 (DIEPTXF2) is
 *  OTG_RX_DFIFO_DEPTH + OTG_TX_DINEP_DFIFO_DEPTH_0 + OTG_TX_DINEP_DFIFO_DEPTH_1, and
 *  so on.
 *  If at POR the calculated value (C) exceeds 65535, then the Reset value becomes
 *  Reset Value(A) = (C-65536).
 *  - If Enable Dynamic FIFO Sizing is deselected in coreConsultant (OTG_DFIFO_DYNAMIC
 *  = 0), this field is read-only and read value is the power-on reset value.
 *  - If Enable Dynamic FIFO Sizing is selected in coreConsultant (OTG_DFIFO_DYNAMIC =
 *  1), and you have calculated or programmed a new value for RxFIFO depth or TX FIFO
 *  depths, you can program their values according to the above formula. Programmed
 *  values must not exceed the power-on value set in coreConsultant.
 */
#define USB_OTGHS_DIEPTXF3_INEPNTXFSTADDR    0x00000FFFU
#define USB_OTGHS_DIEPTXF3_INEPNTXFSTADDR_M  (USB_OTGHS_DIEPTXF3_INEPNTXFSTADDR_V << USB_OTGHS_DIEPTXF3_INEPNTXFSTADDR_S)
#define USB_OTGHS_DIEPTXF3_INEPNTXFSTADDR_V  0x00000FFFU
#define USB_OTGHS_DIEPTXF3_INEPNTXFSTADDR_S  0
/** USB_OTGHS_DIEPTXF3_INEPNTXFDEP : R/W; bitpos: [25:16]; default: 512;
 *  IN Endpoint TxFIFO Depth (INEPnTxFDep)
 *
 *  This value is in terms of 32-bit words.
 *  - Minimum value is 16
 *  - Maximum value is 32,768
 *  The power-on reset value of this register is specified as the Largest IN Endpoint
 *  FIFO number Depth (parameter OTG_TX_DINEP_DFIFO_DEPTH_i) set during coreConsultant
 *  configuration, where i is the FIFO number this register corresponds to.
 *  - If Enable Dynamic FIFO Sizing? was deselected in coreConsultant (parameter
 *  OTG_DFIFO_DYNAMIC = 0), these flops are optimized, and reads return the power-on
 *  value.
 *  - If Enable Dynamic FIFO Sizing? was selected in coreConsultant (parameter
 *  OTG_DFIFO_DYNAMIC = 1), you can write a new value in this field.
 *  Programmed values must not exceed the power-on value.
 */
#define USB_OTGHS_DIEPTXF3_INEPNTXFDEP    0x000003FFU
#define USB_OTGHS_DIEPTXF3_INEPNTXFDEP_M  (USB_OTGHS_DIEPTXF3_INEPNTXFDEP_V << USB_OTGHS_DIEPTXF3_INEPNTXFDEP_S)
#define USB_OTGHS_DIEPTXF3_INEPNTXFDEP_V  0x000003FFU
#define USB_OTGHS_DIEPTXF3_INEPNTXFDEP_S  16

/** USB_OTGHS_DIEPTXF4_REG register
 *  This register is valid only in dedicated FIFO mode (OTG_EN_DED_TX_FIFO=1). It holds
 *  the size and memory start address of IN endpoint TxFIFOs implemented in Device
 *  mode. Each FIFO holds the data for one IN endpoint. This register is repeated for
 *  instantiated IN endpoint FIFOs 1 to 15. For IN endpoint FIFO 0, use GNPTXFSIZ
 *  register for programming the size and memory start address.
 */
#define USB_OTGHS_DIEPTXF4_REG (DR_REG_USB_OTGHS_BASE + 0x110)
/** USB_OTGHS_DIEPTXF4_INEPNTXFSTADDR : R/W; bitpos: [11:0]; default: 3072;
 *  IN Endpoint FIFOn Transmit RAM Start Address (INEPnTxFStAddr)
 *
 *  This field contains the memory start address for the IN endpoint Transmit FIFO that
 *  this register corresponds to.
 *  The power-on reset value of this register is calculated according to the following
 *  formula: OTG_RX_DFIFO_DEPTH + SUM of OTG_TX_DINEP_DFIFO_DEPTH_'n', where n = 0 to
 *  (FIFO number-1).
 *  For example,
 *  Start address of INEP FIFO 1 (DIEPTXF1) is OTG_RX_DFIFO_DEPTH +
 *  OTG_TX_DINEP_DFIFO_DEPTH_0, start address of INEP FIFO 2 (DIEPTXF2) is
 *  OTG_RX_DFIFO_DEPTH + OTG_TX_DINEP_DFIFO_DEPTH_0 + OTG_TX_DINEP_DFIFO_DEPTH_1, and
 *  so on.
 *  If at POR the calculated value (C) exceeds 65535, then the Reset value becomes
 *  Reset Value(A) = (C-65536).
 *  - If Enable Dynamic FIFO Sizing is deselected in coreConsultant (OTG_DFIFO_DYNAMIC
 *  = 0), this field is read-only and read value is the power-on reset value.
 *  - If Enable Dynamic FIFO Sizing is selected in coreConsultant (OTG_DFIFO_DYNAMIC =
 *  1), and you have calculated or programmed a new value for RxFIFO depth or TX FIFO
 *  depths, you can program their values according to the above formula. Programmed
 *  values must not exceed the power-on value set in coreConsultant.
 */
#define USB_OTGHS_DIEPTXF4_INEPNTXFSTADDR    0x00000FFFU
#define USB_OTGHS_DIEPTXF4_INEPNTXFSTADDR_M  (USB_OTGHS_DIEPTXF4_INEPNTXFSTADDR_V << USB_OTGHS_DIEPTXF4_INEPNTXFSTADDR_S)
#define USB_OTGHS_DIEPTXF4_INEPNTXFSTADDR_V  0x00000FFFU
#define USB_OTGHS_DIEPTXF4_INEPNTXFSTADDR_S  0
/** USB_OTGHS_DIEPTXF4_INEPNTXFDEP : R/W; bitpos: [25:16]; default: 512;
 *  IN Endpoint TxFIFO Depth (INEPnTxFDep)
 *
 *  This value is in terms of 32-bit words.
 *  - Minimum value is 16
 *  - Maximum value is 32,768
 *  The power-on reset value of this register is specified as the Largest IN Endpoint
 *  FIFO number Depth (parameter OTG_TX_DINEP_DFIFO_DEPTH_i) set during coreConsultant
 *  configuration, where i is the FIFO number this register corresponds to.
 *  - If Enable Dynamic FIFO Sizing? was deselected in coreConsultant (parameter
 *  OTG_DFIFO_DYNAMIC = 0), these flops are optimized, and reads return the power-on
 *  value.
 *  - If Enable Dynamic FIFO Sizing? was selected in coreConsultant (parameter
 *  OTG_DFIFO_DYNAMIC = 1), you can write a new value in this field.
 *  Programmed values must not exceed the power-on value.
 */
#define USB_OTGHS_DIEPTXF4_INEPNTXFDEP    0x000003FFU
#define USB_OTGHS_DIEPTXF4_INEPNTXFDEP_M  (USB_OTGHS_DIEPTXF4_INEPNTXFDEP_V << USB_OTGHS_DIEPTXF4_INEPNTXFDEP_S)
#define USB_OTGHS_DIEPTXF4_INEPNTXFDEP_V  0x000003FFU
#define USB_OTGHS_DIEPTXF4_INEPNTXFDEP_S  16

/** USB_OTGHS_DIEPTXF5_REG register
 *  This register is valid only in dedicated FIFO mode (OTG_EN_DED_TX_FIFO=1). It holds
 *  the size and memory start address of IN endpoint TxFIFOs implemented in Device
 *  mode. Each FIFO holds the data for one IN endpoint. This register is repeated for
 *  instantiated IN endpoint FIFOs 1 to 15. For IN endpoint FIFO 0, use GNPTXFSIZ
 *  register for programming the size and memory start address.
 */
#define USB_OTGHS_DIEPTXF5_REG (DR_REG_USB_OTGHS_BASE + 0x114)
/** USB_OTGHS_DIEPTXF5_INEPNTXFSTADDR : R/W; bitpos: [11:0]; default: 3584;
 *  IN Endpoint FIFOn Transmit RAM Start Address (INEPnTxFStAddr)
 *
 *  This field contains the memory start address for the IN endpoint Transmit FIFO that
 *  this register corresponds to.
 *  The power-on reset value of this register is calculated according to the following
 *  formula: OTG_RX_DFIFO_DEPTH + SUM of OTG_TX_DINEP_DFIFO_DEPTH_'n', where n = 0 to
 *  (FIFO number-1).
 *  For example,
 *  Start address of INEP FIFO 1 (DIEPTXF1) is OTG_RX_DFIFO_DEPTH +
 *  OTG_TX_DINEP_DFIFO_DEPTH_0, start address of INEP FIFO 2 (DIEPTXF2) is
 *  OTG_RX_DFIFO_DEPTH + OTG_TX_DINEP_DFIFO_DEPTH_0 + OTG_TX_DINEP_DFIFO_DEPTH_1, and
 *  so on.
 *  If at POR the calculated value (C) exceeds 65535, then the Reset value becomes
 *  Reset Value(A) = (C-65536).
 *  - If Enable Dynamic FIFO Sizing is deselected in coreConsultant (OTG_DFIFO_DYNAMIC
 *  = 0), this field is read-only and read value is the power-on reset value.
 *  - If Enable Dynamic FIFO Sizing is selected in coreConsultant (OTG_DFIFO_DYNAMIC =
 *  1), and you have calculated or programmed a new value for RxFIFO depth or TX FIFO
 *  depths, you can program their values according to the above formula. Programmed
 *  values must not exceed the power-on value set in coreConsultant.
 */
#define USB_OTGHS_DIEPTXF5_INEPNTXFSTADDR    0x00000FFFU
#define USB_OTGHS_DIEPTXF5_INEPNTXFSTADDR_M  (USB_OTGHS_DIEPTXF5_INEPNTXFSTADDR_V << USB_OTGHS_DIEPTXF5_INEPNTXFSTADDR_S)
#define USB_OTGHS_DIEPTXF5_INEPNTXFSTADDR_V  0x00000FFFU
#define USB_OTGHS_DIEPTXF5_INEPNTXFSTADDR_S  0
/** USB_OTGHS_DIEPTXF5_INEPNTXFDEP : R/W; bitpos: [25:16]; default: 512;
 *  IN Endpoint TxFIFO Depth (INEPnTxFDep)
 *
 *  This value is in terms of 32-bit words.
 *  - Minimum value is 16
 *  - Maximum value is 32,768
 *  The power-on reset value of this register is specified as the Largest IN Endpoint
 *  FIFO number Depth (parameter OTG_TX_DINEP_DFIFO_DEPTH_i) set during coreConsultant
 *  configuration, where i is the FIFO number this register corresponds to.
 *  - If Enable Dynamic FIFO Sizing? was deselected in coreConsultant (parameter
 *  OTG_DFIFO_DYNAMIC = 0), these flops are optimized, and reads return the power-on
 *  value.
 *  - If Enable Dynamic FIFO Sizing? was selected in coreConsultant (parameter
 *  OTG_DFIFO_DYNAMIC = 1), you can write a new value in this field.
 *  Programmed values must not exceed the power-on value.
 */
#define USB_OTGHS_DIEPTXF5_INEPNTXFDEP    0x000003FFU
#define USB_OTGHS_DIEPTXF5_INEPNTXFDEP_M  (USB_OTGHS_DIEPTXF5_INEPNTXFDEP_V << USB_OTGHS_DIEPTXF5_INEPNTXFDEP_S)
#define USB_OTGHS_DIEPTXF5_INEPNTXFDEP_V  0x000003FFU
#define USB_OTGHS_DIEPTXF5_INEPNTXFDEP_S  16

/** USB_OTGHS_DIEPTXF6_REG register
 *  This register is valid only in dedicated FIFO mode (OTG_EN_DED_TX_FIFO=1). It holds
 *  the size and memory start address of IN endpoint TxFIFOs implemented in Device
 *  mode. Each FIFO holds the data for one IN endpoint. This register is repeated for
 *  instantiated IN endpoint FIFOs 1 to 15. For IN endpoint FIFO 0, use GNPTXFSIZ
 *  register for programming the size and memory start address.
 */
#define USB_OTGHS_DIEPTXF6_REG (DR_REG_USB_OTGHS_BASE + 0x118)
/** USB_OTGHS_DIEPTXF6_INEPNTXFSTADDR : R/W; bitpos: [12:0]; default: 4096;
 *  IN Endpoint FIFOn Transmit RAM Start Address (INEPnTxFStAddr)
 *
 *  This field contains the memory start address for the IN endpoint Transmit FIFO that
 *  this register corresponds to.
 *  The power-on reset value of this register is calculated according to the following
 *  formula: OTG_RX_DFIFO_DEPTH + SUM of OTG_TX_DINEP_DFIFO_DEPTH_'n', where n = 0 to
 *  (FIFO number-1).
 *  For example,
 *  Start address of INEP FIFO 1 (DIEPTXF1) is OTG_RX_DFIFO_DEPTH +
 *  OTG_TX_DINEP_DFIFO_DEPTH_0, start address of INEP FIFO 2 (DIEPTXF2) is
 *  OTG_RX_DFIFO_DEPTH + OTG_TX_DINEP_DFIFO_DEPTH_0 + OTG_TX_DINEP_DFIFO_DEPTH_1, and
 *  so on.
 *  If at POR the calculated value (C) exceeds 65535, then the Reset value becomes
 *  Reset Value(A) = (C-65536).
 *  - If Enable Dynamic FIFO Sizing is deselected in coreConsultant (OTG_DFIFO_DYNAMIC
 *  = 0), this field is read-only and read value is the power-on reset value.
 *  - If Enable Dynamic FIFO Sizing is selected in coreConsultant (OTG_DFIFO_DYNAMIC =
 *  1), and you have calculated or programmed a new value for RxFIFO depth or TX FIFO
 *  depths, you can program their values according to the above formula. Programmed
 *  values must not exceed the power-on value set in coreConsultant.
 */
#define USB_OTGHS_DIEPTXF6_INEPNTXFSTADDR    0x00001FFFU
#define USB_OTGHS_DIEPTXF6_INEPNTXFSTADDR_M  (USB_OTGHS_DIEPTXF6_INEPNTXFSTADDR_V << USB_OTGHS_DIEPTXF6_INEPNTXFSTADDR_S)
#define USB_OTGHS_DIEPTXF6_INEPNTXFSTADDR_V  0x00001FFFU
#define USB_OTGHS_DIEPTXF6_INEPNTXFSTADDR_S  0
/** USB_OTGHS_DIEPTXF6_INEPNTXFDEP : R/W; bitpos: [25:16]; default: 512;
 *  IN Endpoint TxFIFO Depth (INEPnTxFDep)
 *
 *  This value is in terms of 32-bit words.
 *  - Minimum value is 16
 *  - Maximum value is 32,768
 *  The power-on reset value of this register is specified as the Largest IN Endpoint
 *  FIFO number Depth (parameter OTG_TX_DINEP_DFIFO_DEPTH_i) set during coreConsultant
 *  configuration, where i is the FIFO number this register corresponds to.
 *  - If Enable Dynamic FIFO Sizing? was deselected in coreConsultant (parameter
 *  OTG_DFIFO_DYNAMIC = 0), these flops are optimized, and reads return the power-on
 *  value.
 *  - If Enable Dynamic FIFO Sizing? was selected in coreConsultant (parameter
 *  OTG_DFIFO_DYNAMIC = 1), you can write a new value in this field.
 *  Programmed values must not exceed the power-on value.
 */
#define USB_OTGHS_DIEPTXF6_INEPNTXFDEP    0x000003FFU
#define USB_OTGHS_DIEPTXF6_INEPNTXFDEP_M  (USB_OTGHS_DIEPTXF6_INEPNTXFDEP_V << USB_OTGHS_DIEPTXF6_INEPNTXFDEP_S)
#define USB_OTGHS_DIEPTXF6_INEPNTXFDEP_V  0x000003FFU
#define USB_OTGHS_DIEPTXF6_INEPNTXFDEP_S  16

