espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_DIEPTXF7_REG register
 *  This register is valid only in dedicated FIFO mode (OTG_EN_DED_TX_FIFO=1). It holds
 *  the size and memory start address of IN endpoint TxFIFOs implemented in Device
 *  mode. Each FIFO holds the data for one IN endpoint. This register is repeated for
 *  instantiated IN endpoint FIFOs 1 to 15. For IN endpoint FIFO 0, use GNPTXFSIZ
 *  register for programming the size and memory start address.
 */
#define USB_OTGHS_DIEPTXF7_REG (DR_REG_USB_OTGHS_BASE + 0x11c)
/** USB_OTGHS_DIEPTXF7_INEPNTXFSTADDR : R/W; bitpos: [12:0]; default: 4608;
 *  IN Endpoint FIFOn Transmit RAM Start Address (INEPnTxFStAddr)
 *
 *  This field contains the memory start address for the IN endpoint Transmit FIFO that
 *  this register corresponds to.
 *  The power-on reset value of this register is calculated according to the following
 *  formula: OTG_RX_DFIFO_DEPTH + SUM of OTG_TX_DINEP_DFIFO_DEPTH_'n', where n = 0 to
 *  (FIFO number-1).
 *  For example,
 *  Start address of INEP FIFO 1 (DIEPTXF1) is OTG_RX_DFIFO_DEPTH +
 *  OTG_TX_DINEP_DFIFO_DEPTH_0, start address of INEP FIFO 2 (DIEPTXF2) is
 *  OTG_RX_DFIFO_DEPTH + OTG_TX_DINEP_DFIFO_DEPTH_0 + OTG_TX_DINEP_DFIFO_DEPTH_1, and
 *  so on.
 *  If at POR the calculated value (C) exceeds 65535, then the Reset value becomes
 *  Reset Value(A) = (C-65536).
 *  - If Enable Dynamic FIFO Sizing is deselected in coreConsultant (OTG_DFIFO_DYNAMIC
 *  = 0), this field is read-only and read value is the power-on reset value.
 *  - If Enable Dynamic FIFO Sizing is selected in coreConsultant (OTG_DFIFO_DYNAMIC =
 *  1), and you have calculated or programmed a new value for RxFIFO depth or TX FIFO
 *  depths, you can program their values according to the above formula. Programmed
 *  values must not exceed the power-on value set in coreConsultant.
 */
#define USB_OTGHS_DIEPTXF7_INEPNTXFSTADDR    0x00001FFFU
#define USB_OTGHS_DIEPTXF7_INEPNTXFSTADDR_M  (USB_OTGHS_DIEPTXF7_INEPNTXFSTADDR_V << USB_OTGHS_DIEPTXF7_INEPNTXFSTADDR_S)
#define USB_OTGHS_DIEPTXF7_INEPNTXFSTADDR_V  0x00001FFFU
#define USB_OTGHS_DIEPTXF7_INEPNTXFSTADDR_S  0
/** USB_OTGHS_DIEPTXF7_INEPNTXFDEP : R/W; bitpos: [25:16]; default: 512;
 *  IN Endpoint TxFIFO Depth (INEPnTxFDep)
 *
 *  This value is in terms of 32-bit words.
 *  - Minimum value is 16
 *  - Maximum value is 32,768
 *  The power-on reset value of this register is specified as the Largest IN Endpoint
 *  FIFO number Depth (parameter OTG_TX_DINEP_DFIFO_DEPTH_i) set during coreConsultant
 *  configuration, where i is the FIFO number this register corresponds to.
 *  - If Enable Dynamic FIFO Sizing? was deselected in coreConsultant (parameter
 *  OTG_DFIFO_DYNAMIC = 0), these flops are optimized, and reads return the power-on
 *  value.
 *  - If Enable Dynamic FIFO Sizing? was selected in coreConsultant (parameter
 *  OTG_DFIFO_DYNAMIC = 1), you can write a new value in this field.
 *  Programmed values must not exceed the power-on value.
 */
#define USB_OTGHS_DIEPTXF7_INEPNTXFDEP    0x000003FFU
#define USB_OTGHS_DIEPTXF7_INEPNTXFDEP_M  (USB_OTGHS_DIEPTXF7_INEPNTXFDEP_V << USB_OTGHS_DIEPTXF7_INEPNTXFDEP_S)
#define USB_OTGHS_DIEPTXF7_INEPNTXFDEP_V  0x000003FFU
#define USB_OTGHS_DIEPTXF7_INEPNTXFDEP_S  16

/** USB_OTGHS_HCFG_REG register
 *  This register is used to configure the controller in Host mode.
 */
#define USB_OTGHS_HCFG_REG (DR_REG_USB_OTGHS_BASE + 0x400)
/** USB_OTGHS_HCFG_FSLSPCLKSEL : R/W; bitpos: [1:0]; default: 0;
 *  FS/LS PHY Clock Select (FSLSPclkSel)
 *
 *  When the core is in FS Host mode
 *  - 2'b00: PHY clock is running at 30/60 MHz
 *  - 2'b01: PHY clock is running at 48 MHz
 *  - Others: Reserved
 *  When the core is in LS Host mode
 *  - 2'b00: PHY clock is running at 30/60 MHz. When the UTMI+/ULPI PHY Low Power mode
 *  is not selected, use 30/60 MHz.
 *  - 2'b01: PHY clock is running at 48 MHz. When the UTMI+ PHY Low Power mode is
 *  selected, use 48MHz If the PHY supplies a 48 MHz clock during LS mode.
 *  - 2'b10: PHY clock is running at 6 MHz. In USB 1.1 FS mode, use 6 MHz when the
 *  UTMI+ PHY Low Power mode is selected and the PHY supplies a 6 MHz clock during LS
 *  mode. If you select a 6 MHz clock during LS mode, you must do a soft reset.
 *  - 2'b11: Reserved
 *  Notes:
 *  - When Core in FS mode, the internal and external clocks have the same frequency.
 *  - When Core in LS mode,
 *  -- If FSLSPclkSel = 2'b00: Internal and external clocks have the same frequency
 *  -- If FSLSPclkSel = 2'b10: Internal clock is the divided by eight version of
 *  external 48 MHz clock
 */
#define USB_OTGHS_HCFG_FSLSPCLKSEL    0x00000003U
#define USB_OTGHS_HCFG_FSLSPCLKSEL_M  (USB_OTGHS_HCFG_FSLSPCLKSEL_V << USB_OTGHS_HCFG_FSLSPCLKSEL_S)
#define USB_OTGHS_HCFG_FSLSPCLKSEL_V  0x00000003U
#define USB_OTGHS_HCFG_FSLSPCLKSEL_S  0
/** USB_OTGHS_HCFG_FSLSSUPP : R/W; bitpos: [2]; default: 0;
 *  FS- and LS-Only Support (FSLSSupp)
 *
 *  The application uses this bit to control the core's enumeration speed. Using this
 *  bit, the application can make the core
 *  enumerate as a FS host, even If the connected device supports HS traffic. Do not
 *  make changes to this field after initial
 *  programming.
 *  - 1'b0: HS/FS/LS, based on the maximum speed supported by the connected device
 *  - 1'b1: FS/LS-only, even If the connected device can support HS
 */
#define USB_OTGHS_HCFG_FSLSSUPP    (BIT(2))
#define USB_OTGHS_HCFG_FSLSSUPP_M  (USB_OTGHS_HCFG_FSLSSUPP_V << USB_OTGHS_HCFG_FSLSSUPP_S)
#define USB_OTGHS_HCFG_FSLSSUPP_V  0x00000001U
#define USB_OTGHS_HCFG_FSLSSUPP_S  2
/** USB_OTGHS_HCFG_ENA32KHZS : R/W; bitpos: [7]; default: 0;
 *  Enable 32 KHz Suspend mode (Ena32KHzS)
 *
 *  This bit can be set only in FS PHY interface is selected.
 *  Else, this bit needs to be set to zero.
 *  When FS PHY interface is chosen and this bit is set,
 *  the core expects that the PHY clock during Suspend is switched
 *  from 48 MHz to 32 KHz.
 */
#define USB_OTGHS_HCFG_ENA32KHZS    (BIT(7))
#define USB_OTGHS_HCFG_ENA32KHZS_M  (USB_OTGHS_HCFG_ENA32KHZS_V << USB_OTGHS_HCFG_ENA32KHZS_S)
#define USB_OTGHS_HCFG_ENA32KHZS_V  0x00000001U
#define USB_OTGHS_HCFG_ENA32KHZS_S  7
/** USB_OTGHS_HCFG_RESVALID : R/W; bitpos: [15:8]; default: 2;
 *  Resume Validation Period  (ResValid)
 *
 *  This field is effective only when HCFG.Ena32KHzS is set.
 *  It controls the resume period when the core resumes from suspend.
 *  The core counts for 'ResValid' number of clock cycles to detect a
 *  valid resume when this is set.
 */
#define USB_OTGHS_HCFG_RESVALID    0x000000FFU
#define USB_OTGHS_HCFG_RESVALID_M  (USB_OTGHS_HCFG_RESVALID_V << USB_OTGHS_HCFG_RESVALID_S)
#define USB_OTGHS_HCFG_RESVALID_V  0x000000FFU
#define USB_OTGHS_HCFG_RESVALID_S  8
/** USB_OTGHS_HCFG_DESCDMA : R/W; bitpos: [23]; default: 0;
 *  Enable Scatter/gather DMA in Host mode (DescDMA)
 *
 *  When the Scatter/Gather DMA option selected during configuration of the RTL, the
 *  application can set this bit during initialization
 *  to enable the Scatter/Gather DMA operation.
 *
 *  Note: This bit must be modified only once after a reset.
 *
 *  The following combinations are available for programming:
 *  - GAHBCFG.DMAEn=0,HCFG.DescDMA=0 => Slave mode
 *  - GAHBCFG.DMAEn=0,HCFG.DescDMA=1 => Invalid
 *  - GAHBCFG.DMAEn=1,HCFG.DescDMA=0 => Buffered DMA mode
 *  - GAHBCFG.DMAEn=1,HCFG.DescDMA=1 => Scatter/Gather DMA mode
 */
#define USB_OTGHS_HCFG_DESCDMA    (BIT(23))
#define USB_OTGHS_HCFG_DESCDMA_M  (USB_OTGHS_HCFG_DESCDMA_V << USB_OTGHS_HCFG_DESCDMA_S)
#define USB_OTGHS_HCFG_DESCDMA_V  0x00000001U
#define USB_OTGHS_HCFG_DESCDMA_S  23
/** USB_OTGHS_HCFG_FRLISTEN : R/W; bitpos: [25:24]; default: 0;
 *  Frame List Entries(FrListEn)
 *
 *  The value in the register specifies the number of entries in the Frame list.
 *  This field is valid only in Scatter/Gather DMA mode.
 *  - 2'b00: 8 Entries
 *  - 2'b01: 16 Entries
 *  - 2'b10: 32 Entries
 *  - 2'b11: 64 Entries
 */
#define USB_OTGHS_HCFG_FRLISTEN    0x00000003U
#define USB_OTGHS_HCFG_FRLISTEN_M  (USB_OTGHS_HCFG_FRLISTEN_V << USB_OTGHS_HCFG_FRLISTEN_S)
#define USB_OTGHS_HCFG_FRLISTEN_V  0x00000003U
#define USB_OTGHS_HCFG_FRLISTEN_S  24
/** USB_OTGHS_HCFG_PERSCHEDENA : R/W; bitpos: [26]; default: 0;
 *  Enable Periodic Scheduling (PerSchedEna):
 *
 *  Applicable in host DDMA mode only.
 *  Enables periodic scheduling within the core. Initially, the bit is reset.
 *  The core does not process any periodic channels.
 *
 *  As soon as this bit is set,
 *  the core gets ready to start scheduling periodic channels and
 *  sets HCFG.PerSchedStat. The setting of HCFG.PerSchedStat indicates the core
 *  has enabled periodic scheduling. Once HCFG.PerSchedEna is set,
 *  the application is not supposed to again reset the bit unless HCFG.PerSchedStat
 *  is set.
 *
 *  As soon as this bit is reset, the core gets ready to
 *  stop scheduling periodic channels and resets HCFG.PerSchedStat.
 */
#define USB_OTGHS_HCFG_PERSCHEDENA    (BIT(26))
#define USB_OTGHS_HCFG_PERSCHEDENA_M  (USB_OTGHS_HCFG_PERSCHEDENA_V << USB_OTGHS_HCFG_PERSCHEDENA_S)
#define USB_OTGHS_HCFG_PERSCHEDENA_V  0x00000001U
#define USB_OTGHS_HCFG_PERSCHEDENA_S  26
/** USB_OTGHS_HCFG_MODECHTIMEN : R/W; bitpos: [31]; default: 0;
 *  Mode Change Ready Timer Enable (ModeChTimEn)
 *
 *  This bit is used to enable/disable the Host core to wait  200 PHY clock cycles at
 *  the end of Resume to change the opmode signal to the PHY to 00
 *  after Suspend or LPM.
 *  - 1'b0 : The Host core waits for either 200 PHY clock cycles or a linestate of SE0
 *  at the end of resume to the change the opmode from 2'b10 to 2'b00
 *  - 1'b1 : The Host core waits only for a linestate of SE0 at the end of resume to
 *  change the opmode from 2'b10 to 2'b00.
 */
#define USB_OTGHS_HCFG_MODECHTIMEN    (BIT(31))
#define USB_OTGHS_HCFG_MODECHTIMEN_M  (USB_OTGHS_HCFG_MODECHTIMEN_V << USB_OTGHS_HCFG_MODECHTIMEN_S)
#define USB_OTGHS_HCFG_MODECHTIMEN_V  0x00000001U
#define USB_OTGHS_HCFG_MODECHTIMEN_S  31

/** USB_OTGHS_HFIR_REG register
 *  This register is used to control the interval between two consecutive SOFs.
 */
#define USB_OTGHS_HFIR_REG (DR_REG_USB_OTGHS_BASE + 0x404)
/** USB_OTGHS_HFIR_FRINT : R/W; bitpos: [15:0]; default: 60000;
 *  Frame Interval (FrInt)
 *
 *  The value that the application programs to this field specifies
 *  the interval between two consecutive SOFs (FS) or micro-
 *  SOFs (HS) or Keep-Alive tokens (HS). This field contains the
 *  number of PHY clocks that constitute the required frame
 *  interval. The Default value set in this field  is for FS operation
 *  when the PHY clock frequency is 60 MHz. The application can
 *  write a value to this register only after the Port Enable bit of the
 *  Host Port Control and Status register (HPRT.PrtEnaPort) has
 *  been Set. If no value is programmed, the core calculates the
 *  value based on the PHY clock specified in the FS/LS PHY
 *  Clock Select field of the Host Configuration register
 *  (HCFG.FSLSPclkSel). Do not change the value of this field
 *  after the initial configuration.
 *  - 125 us * (PHY clock frequency for HS)
 *  - 1 ms * (PHY clock frequency for FS/LS)
 */
#define USB_OTGHS_HFIR_FRINT    0x0000FFFFU
#define USB_OTGHS_HFIR_FRINT_M  (USB_OTGHS_HFIR_FRINT_V << USB_OTGHS_HFIR_FRINT_S)
#define USB_OTGHS_HFIR_FRINT_V  0x0000FFFFU
#define USB_OTGHS_HFIR_FRINT_S  0
/** USB_OTGHS_HFIR_HFIRRLDCTRL : R/W; bitpos: [16]; default: 0;
 *  Reload Control (HFIRRldCtrl)
 *
 *  This bit allows dynamic reloading of the HFIR register during run time.
 *  - 1'b0 : The HFIR cannot be reloaded dynamically
 *  - 1'b1: the HFIR can be dynamically reloaded during runtime.
 *  This bit needs to be programmed during initial configuration and its value must not
 *  be changed during runtime.
 */
#define USB_OTGHS_HFIR_HFIRRLDCTRL    (BIT(16))
#define USB_OTGHS_HFIR_HFIRRLDCTRL_M  (USB_OTGHS_HFIR_HFIRRLDCTRL_V << USB_OTGHS_HFIR_HFIRRLDCTRL_S)
#define USB_OTGHS_HFIR_HFIRRLDCTRL_V  0x00000001U
#define USB_OTGHS_HFIR_HFIRRLDCTRL_S  16

