espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_HCINTMSK4_REG register
 *  This register reflects the mask for each channel status described in the previous
 *  section.
 */
#define USB_OTGHS_HCINTMSK4_REG (DR_REG_USB_OTGHS_BASE + 0x58c)
/** USB_OTGHS_HCINTMSK4_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *
 *  Transfer Completed Mask (XferComplMsk)
 */
#define USB_OTGHS_HCINTMSK4_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_HCINTMSK4_XFERCOMPLMSK_M  (USB_OTGHS_HCINTMSK4_XFERCOMPLMSK_V << USB_OTGHS_HCINTMSK4_XFERCOMPLMSK_S)
#define USB_OTGHS_HCINTMSK4_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_HCINTMSK4_XFERCOMPLMSK_S  0
/** USB_OTGHS_HCINTMSK4_CHHLTDMSK : R/W; bitpos: [1]; default: 0;
 *
 *  Channel Halted Mask (ChHltdMsk)
 */
#define USB_OTGHS_HCINTMSK4_CHHLTDMSK    (BIT(1))
#define USB_OTGHS_HCINTMSK4_CHHLTDMSK_M  (USB_OTGHS_HCINTMSK4_CHHLTDMSK_V << USB_OTGHS_HCINTMSK4_CHHLTDMSK_S)
#define USB_OTGHS_HCINTMSK4_CHHLTDMSK_V  0x00000001U
#define USB_OTGHS_HCINTMSK4_CHHLTDMSK_S  1
/** USB_OTGHS_HCINTMSK4_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *
 *  AHB Error Mask (AHBErrMsk)
 *  In  scatter/gather  DMA  mode  for  host,
 *  interrupts are not generated due to the corresponding bits set in
 *  HCINTn.
 */
#define USB_OTGHS_HCINTMSK4_AHBERRMSK    (BIT(2))
#define USB_OTGHS_HCINTMSK4_AHBERRMSK_M  (USB_OTGHS_HCINTMSK4_AHBERRMSK_V << USB_OTGHS_HCINTMSK4_AHBERRMSK_S)
#define USB_OTGHS_HCINTMSK4_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_HCINTMSK4_AHBERRMSK_S  2
/** USB_OTGHS_HCINTMSK4_BNAINTRMSK : R/W; bitpos: [11]; default: 0;
 *
 *  BNA  (Buffer  Not  Available)  Interrupt  mask  register  (BNAIntrMsk)
 *  This bit is valid only when Scatter/Gather DMA mode is enabled.
 */
#define USB_OTGHS_HCINTMSK4_BNAINTRMSK    (BIT(11))
#define USB_OTGHS_HCINTMSK4_BNAINTRMSK_M  (USB_OTGHS_HCINTMSK4_BNAINTRMSK_V << USB_OTGHS_HCINTMSK4_BNAINTRMSK_S)
#define USB_OTGHS_HCINTMSK4_BNAINTRMSK_V  0x00000001U
#define USB_OTGHS_HCINTMSK4_BNAINTRMSK_S  11
/** USB_OTGHS_HCINTMSK4_DESC_LST_ROLLINTRMSK : R/W; bitpos: [13]; default: 0;
 *
 *  Descriptor List rollover interrupt Mask register(DESC_LST_ROLLIntrMsk)
 *  This bit is valid only when Scatter/Gather DMA mode is enabled.
 */
#define USB_OTGHS_HCINTMSK4_DESC_LST_ROLLINTRMSK    (BIT(13))
#define USB_OTGHS_HCINTMSK4_DESC_LST_ROLLINTRMSK_M  (USB_OTGHS_HCINTMSK4_DESC_LST_ROLLINTRMSK_V << USB_OTGHS_HCINTMSK4_DESC_LST_ROLLINTRMSK_S)
#define USB_OTGHS_HCINTMSK4_DESC_LST_ROLLINTRMSK_V  0x00000001U
#define USB_OTGHS_HCINTMSK4_DESC_LST_ROLLINTRMSK_S  13

/** USB_OTGHS_HCTSIZ4_REG register
 *  This register reflects the transfer size for the Host Channel.
 */
#define USB_OTGHS_HCTSIZ4_REG (DR_REG_USB_OTGHS_BASE + 0x590)
/** USB_OTGHS_HCTSIZ4_XFERSIZE : R/W; bitpos: [18:0]; default: 0;
 *  Non-Scatter/Gather DMA Mode:
 *
 *  Transfer Size (XferSize)
 *
 *  For an OUT, this field is the number of data bytes the host sends during the
 *  transfer.
 *
 *  For an IN, this field is the buffer size that the application has Reserved for the
 *  transfer. The application is expected to program this field as an integer multiple
 *  of the maximum packet size for IN transactions (periodic and non-periodic).
 *
 *  The width of this counter is specified as Width of Transfer Size Counters during
 *  coreConsultant configuration (parameter OTG_TRANS_COUNT_WIDTH).
 *
 *  Scatter/Gather DMA Mode:
 *
 *  [18:16]: Reserved
 *
 *  [15:8]: NTD (Number of Transfer Descriptors)
 *
 *  (Non Isochronous)
 *
 *  This value is in terms of number of descriptors. Maximum number of descriptor that
 *  can be present in the list is 64. The values can be from 0 to 63.
 *  - 0: 1 descriptor
 *  - 63: 64 descriptors
 *  This field indicates the total number of descriptors present in that list. The core
 *  wraps around after servicing NTD number of descriptors for that list.
 *
 *  (Isochronous)
 *
 *  This field indicates the number of descriptors present in that list microframe.
 *
 *  The possible values for FS are
 *  - 1: 2 descriptors
 *  - 3: 4 descriptors
 *  - 7: 8 descriptors
 *  - 15: 16 descriptors
 *  - 31: 32 descriptors
 *  - 63: 64 descriptors
 *  The possible values for HS are
 *  - 7: 8 descriptors
 *  - 15: 16 descriptors
 *  - 31: 32 descriptors
 *  - 63: 64 descriptors
 *  - 127: 128 descriptors
 *  - 255: 256 descriptors
 *  [7:0]: SCHED_INFO (Schedule information)
 *
 *  Every bit in this 8 bit register indicates scheduling for that microframe.
 *
 *  Bit 0 indicates scheduling for 1st microframe and bit 7 indicates scheduling for
 *  8th microframe in that frame.
 *
 *  A value of 8'b11111111 indicates that the corresponding interrupt channel is
 *  scheduled to issue a token every microframe in that frame. A value of 8'b10101010
 *  indicates that the corresponding interrupt channel is scheduled to issue a token
 *  every alternate microframe starting with second microframe. Note that this field is
 *  applicable only for periodic (Isochronous and Interrupt) channels.
 */
#define USB_OTGHS_HCTSIZ4_XFERSIZE    0x0007FFFFU
#define USB_OTGHS_HCTSIZ4_XFERSIZE_M  (USB_OTGHS_HCTSIZ4_XFERSIZE_V << USB_OTGHS_HCTSIZ4_XFERSIZE_S)
#define USB_OTGHS_HCTSIZ4_XFERSIZE_V  0x0007FFFFU
#define USB_OTGHS_HCTSIZ4_XFERSIZE_S  0
/** USB_OTGHS_HCTSIZ4_PKTCNT : R/W; bitpos: [28:19]; default: 0;
 *  Non-Scatter/Gather DMA Mode:
 *
 *  Packet Count (PktCnt)
 *
 *  This field is programmed by the application with the expected number of packets to
 *  be transmitted (OUT) or received (IN).
 *
 *  The host decrements this count on every successful transmission or reception of an
 *  OUT/IN packet. Once this count reaches zero, the application is interrupted to
 *  indicate normal completion.
 *
 *  The width of this counter is specified as Width of Packet Counters during
 *  coreConsultant configuration (parameter OTG_PACKET_COUNT_WIDTH).
 *
 *  Scatter/Gather DMA Mode:
 *
 *  [28:19]: Reserved
 */
#define USB_OTGHS_HCTSIZ4_PKTCNT    0x000003FFU
#define USB_OTGHS_HCTSIZ4_PKTCNT_M  (USB_OTGHS_HCTSIZ4_PKTCNT_V << USB_OTGHS_HCTSIZ4_PKTCNT_S)
#define USB_OTGHS_HCTSIZ4_PKTCNT_V  0x000003FFU
#define USB_OTGHS_HCTSIZ4_PKTCNT_S  19
/** USB_OTGHS_HCTSIZ4_PID : R/W; bitpos: [30:29]; default: 0;
 *  PID (Pid)
 *
 *  The application programs this field with the type of PID to use for the initial
 *  transaction. The host maintains this field for the rest of the transfer.
 *  - 2'b00: DATA0
 *  - 2'b01: DATA2
 *  - 2'b10: DATA1
 *  - 2'b11: MDATA (non-control)/SETUP (control)
 */
#define USB_OTGHS_HCTSIZ4_PID    0x00000003U
#define USB_OTGHS_HCTSIZ4_PID_M  (USB_OTGHS_HCTSIZ4_PID_V << USB_OTGHS_HCTSIZ4_PID_S)
#define USB_OTGHS_HCTSIZ4_PID_V  0x00000003U
#define USB_OTGHS_HCTSIZ4_PID_S  29
/** USB_OTGHS_HCTSIZ4_DOPNG : R/W; bitpos: [31]; default: 0;
 *  Do Ping (DoPng)
 *
 *  This bit is used only for OUT transfers.
 *  Setting this field to 1 directs the host to do PING protocol.
 *
 *  Note: Do not set this bit for IN transfers. If this bit is set for IN transfers it
 *  disables the channel.
 */
#define USB_OTGHS_HCTSIZ4_DOPNG    (BIT(31))
#define USB_OTGHS_HCTSIZ4_DOPNG_M  (USB_OTGHS_HCTSIZ4_DOPNG_V << USB_OTGHS_HCTSIZ4_DOPNG_S)
#define USB_OTGHS_HCTSIZ4_DOPNG_V  0x00000001U
#define USB_OTGHS_HCTSIZ4_DOPNG_S  31

/** USB_OTGHS_HCDMA4_REG register
 *  This register is used by the OTG host in the internal DMA mode to maintain the
 *  current buffer pointer for IN/OUT transactions. The starting DMA address must be
 *  DWORD-aligned.
 */
#define USB_OTGHS_HCDMA4_REG (DR_REG_USB_OTGHS_BASE + 0x594)
/** USB_OTGHS_HCDMA4_DMAADDR : R/W; bitpos: [31:0]; default: 0;
 *  In Buffer DMA Mode:
 *
 *  [31:0]: DMA Address (DMAAddr)
 *
 *  This field holds the start address in the external memory from which the data for
 *  the endpoint must be fetched or to which it must be stored. This register is
 *  incremented on every AHB transaction.
 *
 *  Reset: X if not programmed as the register is in SPRAM.
 *
 *  In Scatter-Gather DMA (DescDMA) Mode for Non-Isochronous:
 *
 *  [31:9]: DMA Address (DMAAddr)
 *
 *  The start address must be 512-bytes aligned.
 *
 *  This field holds the start address of the 512 bytes page. The first descriptor in
 *  the list must be located in this address. The first descriptor may be or may not be
 *  ready. The core starts processing the list from the CTD value.
 *
 *  [8:3]: Current Transfer Desc(CTD)
 *
 *  This value is in terms of number of descriptors. The values can be from 0 to 63.
 *  - 0 -  1 descriptor.
 *  - 63 - 64 descriptors.
 *  This field indicates the current descriptor processed in the list. This field is
 *  updated both by application and the core. For example, if the application enables
 *  the channel after programming CTD=5, then the core starts processing the sixth
 *  descriptor. The address is obtained by adding a value of (8bytes*5=) 40(decimal) to
 *  DMAAddr.
 *
 *  Reset: 6'h0
 *
 *  [2:0]: Reserved
 *
 *  In Scatter-Gather DMA (DescDMA) Mode for Isochronous:
 *
 *  [31:N]: DMA Address (DMAAddr)
 *
 *  The start address must be 512-bytes aligned.
 *
 *  This field holds the address of the 2*(nTD+1) bytes of locations in which the
 *  isochronous descriptors are present where N is based on nTD as follows:
 *  - [31:N]: Base Address
 *  - [N-1:3]: Offset
 *  - [2:0]: 000
 *  For HS ISOC, if nTD is,
 *  - 7, N=6
 *  - 15, N=7
 *  - 31, N=8
 *  - 63, N=9
 *  - 127, N=10
 *  - 255, N=11
 *  For FS ISOC, if nTD is,
 *  - 1, N=4
 *  - 3, N=5
 *  - 7, N=6
 *  - 15, N=7
 *  - 31, N=8
 *  - 63, N=9
 *  [N-1:3]: Current Transfer Desc(CTD)
 *
 *  CTD for isochronous is based on the current frame/(micro)frame value. Need to be
 *  set to zero by application.
 *
 *  Reset: (N+1:3)'h0
 *
 *  [2:0]: Reserved
 */
#define USB_OTGHS_HCDMA4_DMAADDR    0xFFFFFFFFU
#define USB_OTGHS_HCDMA4_DMAADDR_M  (USB_OTGHS_HCDMA4_DMAADDR_V << USB_OTGHS_HCDMA4_DMAADDR_S)
#define USB_OTGHS_HCDMA4_DMAADDR_V  0xFFFFFFFFU
#define USB_OTGHS_HCDMA4_DMAADDR_S  0

