espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_HCDMA11_REG register
 *  This register is used by the OTG host in the internal DMA mode to maintain the
 *  current buffer pointer for IN/OUT transactions. The starting DMA address must be
 *  DWORD-aligned.
 */
#define USB_OTGHS_HCDMA11_REG (DR_REG_USB_OTGHS_BASE + 0x674)
/** USB_OTGHS_HCDMA11_DMAADDR : R/W; bitpos: [31:0]; default: 0;
 *  In Buffer DMA Mode:
 *
 *  [31:0]: DMA Address (DMAAddr)
 *
 *  This field holds the start address in the external memory from which the data for
 *  the endpoint must be fetched or to which it must be stored. This register is
 *  incremented on every AHB transaction.
 *
 *  Reset: X if not programmed as the register is in SPRAM.
 *
 *  In Scatter-Gather DMA (DescDMA) Mode for Non-Isochronous:
 *
 *  [31:9]: DMA Address (DMAAddr)
 *
 *  The start address must be 512-bytes aligned.
 *
 *  This field holds the start address of the 512 bytes page. The first descriptor in
 *  the list must be located in this address. The first descriptor may be or may not be
 *  ready. The core starts processing the list from the CTD value.
 *
 *  [8:3]: Current Transfer Desc(CTD)
 *
 *  This value is in terms of number of descriptors. The values can be from 0 to 63.
 *  - 0 -  1 descriptor.
 *  - 63 - 64 descriptors.
 *  This field indicates the current descriptor processed in the list. This field is
 *  updated both by application and the core. For example, if the application enables
 *  the channel after programming CTD=5, then the core starts processing the sixth
 *  descriptor. The address is obtained by adding a value of (8bytes*5=) 40(decimal) to
 *  DMAAddr.
 *
 *  Reset: 6'h0
 *
 *  [2:0]: Reserved
 *
 *  In Scatter-Gather DMA (DescDMA) Mode for Isochronous:
 *
 *  [31:N]: DMA Address (DMAAddr)
 *
 *  The start address must be 512-bytes aligned.
 *
 *  This field holds the address of the 2*(nTD+1) bytes of locations in which the
 *  isochronous descriptors are present where N is based on nTD as follows:
 *  - [31:N]: Base Address
 *  - [N-1:3]: Offset
 *  - [2:0]: 000
 *  For HS ISOC, if nTD is,
 *  - 7, N=6
 *  - 15, N=7
 *  - 31, N=8
 *  - 63, N=9
 *  - 127, N=10
 *  - 255, N=11
 *  For FS ISOC, if nTD is,
 *  - 1, N=4
 *  - 3, N=5
 *  - 7, N=6
 *  - 15, N=7
 *  - 31, N=8
 *  - 63, N=9
 *  [N-1:3]: Current Transfer Desc(CTD)
 *
 *  CTD for isochronous is based on the current frame/(micro)frame value. Need to be
 *  set to zero by application.
 *
 *  Reset: (N+1:3)'h0
 *
 *  [2:0]: Reserved
 */
#define USB_OTGHS_HCDMA11_DMAADDR    0xFFFFFFFFU
#define USB_OTGHS_HCDMA11_DMAADDR_M  (USB_OTGHS_HCDMA11_DMAADDR_V << USB_OTGHS_HCDMA11_DMAADDR_S)
#define USB_OTGHS_HCDMA11_DMAADDR_V  0xFFFFFFFFU
#define USB_OTGHS_HCDMA11_DMAADDR_S  0

/** USB_OTGHS_HCDMAB11_REG register
 *  This register is present only in case of Scatter/Gather DMA. It is implemented in
 *  RAM instead of flop-based implementation. This register holds the current buffer
 *  address.
 */
#define USB_OTGHS_HCDMAB11_REG (DR_REG_USB_OTGHS_BASE + 0x67c)
/** USB_OTGHS_HCDMAB11_HCDMAB : RO; bitpos: [31:0]; default: 0;
 *  Holds the current buffer address.
 *  This register is updated as and when the data transfer for the corresponding end
 *  point
 *  is in progress. This register is present only in Scatter/Gather DMA mode. Otherwise
 *  this
 *  field is reserved.
 */
#define USB_OTGHS_HCDMAB11_HCDMAB    0xFFFFFFFFU
#define USB_OTGHS_HCDMAB11_HCDMAB_M  (USB_OTGHS_HCDMAB11_HCDMAB_V << USB_OTGHS_HCDMAB11_HCDMAB_S)
#define USB_OTGHS_HCDMAB11_HCDMAB_V  0xFFFFFFFFU
#define USB_OTGHS_HCDMAB11_HCDMAB_S  0

/** USB_OTGHS_HCCHAR12_REG register
 *  This register contains the characteristics of the Host Channel.
 */
#define USB_OTGHS_HCCHAR12_REG (DR_REG_USB_OTGHS_BASE + 0x680)
/** USB_OTGHS_HCCHAR12_MPS : R/W; bitpos: [10:0]; default: 0;
 *  Maximum Packet Size (MPS)
 *
 *  Indicates the maximum packet size of the associated endpoint.
 */
#define USB_OTGHS_HCCHAR12_MPS    0x000007FFU
#define USB_OTGHS_HCCHAR12_MPS_M  (USB_OTGHS_HCCHAR12_MPS_V << USB_OTGHS_HCCHAR12_MPS_S)
#define USB_OTGHS_HCCHAR12_MPS_V  0x000007FFU
#define USB_OTGHS_HCCHAR12_MPS_S  0
/** USB_OTGHS_HCCHAR12_EPNUM : R/W; bitpos: [14:11]; default: 0;
 *  Endpoint Number (EPNum)
 *
 *  Indicates the endpoint number on the device serving as the data source or sink.
 */
#define USB_OTGHS_HCCHAR12_EPNUM    0x0000000FU
#define USB_OTGHS_HCCHAR12_EPNUM_M  (USB_OTGHS_HCCHAR12_EPNUM_V << USB_OTGHS_HCCHAR12_EPNUM_S)
#define USB_OTGHS_HCCHAR12_EPNUM_V  0x0000000FU
#define USB_OTGHS_HCCHAR12_EPNUM_S  11
/** USB_OTGHS_HCCHAR12_EPDIR : R/W; bitpos: [15]; default: 0;
 *  Endpoint Direction (EPDir)
 *
 *  Indicates whether the transaction is IN or OUT.
 *  - 1'b0: OUT
 *  - 1'b1: IN
 */
#define USB_OTGHS_HCCHAR12_EPDIR    (BIT(15))
#define USB_OTGHS_HCCHAR12_EPDIR_M  (USB_OTGHS_HCCHAR12_EPDIR_V << USB_OTGHS_HCCHAR12_EPDIR_S)
#define USB_OTGHS_HCCHAR12_EPDIR_V  0x00000001U
#define USB_OTGHS_HCCHAR12_EPDIR_S  15
/** USB_OTGHS_HCCHAR12_LSPDDEV : R/W; bitpos: [17]; default: 0;
 *  Low-Speed Device (LSpdDev)
 *
 *  This field is Set by the application to indicate that this channel is communicating
 *  to a low-speed device.
 *
 *  The application must program this bit when a low speed device is connected to the
 *  host through an FS HUB. The DWC_otg Host core uses this field to drive the
 *  XCVR_SELECT signal to 2'b11 while communicating to the LS Device through the FS hub.
 *
 *  Note: In a peer to peer setup, the DWC_otg Host core ignores this bit even if it is
 *  set by the application software.
 */
#define USB_OTGHS_HCCHAR12_LSPDDEV    (BIT(17))
#define USB_OTGHS_HCCHAR12_LSPDDEV_M  (USB_OTGHS_HCCHAR12_LSPDDEV_V << USB_OTGHS_HCCHAR12_LSPDDEV_S)
#define USB_OTGHS_HCCHAR12_LSPDDEV_V  0x00000001U
#define USB_OTGHS_HCCHAR12_LSPDDEV_S  17
/** USB_OTGHS_HCCHAR12_EPTYPE : R/W; bitpos: [19:18]; default: 0;
 *  Endpoint Type (EPType)
 *
 *  Indicates the transfer type selected.
 *  - 2'b00: Control
 *  - 2'b01: Isochronous
 *  - 2'b10: Bulk
 *  - 2'b11: Interrupt
 */
#define USB_OTGHS_HCCHAR12_EPTYPE    0x00000003U
#define USB_OTGHS_HCCHAR12_EPTYPE_M  (USB_OTGHS_HCCHAR12_EPTYPE_V << USB_OTGHS_HCCHAR12_EPTYPE_S)
#define USB_OTGHS_HCCHAR12_EPTYPE_V  0x00000003U
#define USB_OTGHS_HCCHAR12_EPTYPE_S  18
/** USB_OTGHS_HCCHAR12_EC : R/W; bitpos: [21:20]; default: 0;
 *  Multi Count (MC) / Error Count (EC)
 *
 *  When the Split Enable bit of the Host Channel-n Split Control
 *  register (HCSPLTn.SpltEna) is reset (1'b0), this field indicates to
 *  the host the number of transactions that must be executed per
 *  microframe for this periodic endpoint. For non periodic transfers,
 *  this field is used only in DMA mode, and specifies the number
 *  packets to be fetched for this channel before the internal DMA
 *  engine changes arbitration.
 *  - 2'b00: Reserved This field yields undefined results.
 *  - 2'b01: 1 transaction
 *  - 2'b10: 2 transactions to be issued for this endpoint per microframe
 *  - 2'b11: 3 transactions to be issued for this endpoint per microframe
 *  When HCSPLTn.SpltEna is Set (1'b1), this field indicates the
 *  number of immediate retries to be performed for a periodic split
 *  transactions on transaction errors. This field must be Set to at
 *  least 2'b01.
 */
#define USB_OTGHS_HCCHAR12_EC    0x00000003U
#define USB_OTGHS_HCCHAR12_EC_M  (USB_OTGHS_HCCHAR12_EC_V << USB_OTGHS_HCCHAR12_EC_S)
#define USB_OTGHS_HCCHAR12_EC_V  0x00000003U
#define USB_OTGHS_HCCHAR12_EC_S  20
/** USB_OTGHS_HCCHAR12_DEVADDR : R/W; bitpos: [28:22]; default: 0;
 *  Device Address (DevAddr)
 *
 *  This field selects the specific device serving as the data source
 *  or sink.
 */
#define USB_OTGHS_HCCHAR12_DEVADDR    0x0000007FU
#define USB_OTGHS_HCCHAR12_DEVADDR_M  (USB_OTGHS_HCCHAR12_DEVADDR_V << USB_OTGHS_HCCHAR12_DEVADDR_S)
#define USB_OTGHS_HCCHAR12_DEVADDR_V  0x0000007FU
#define USB_OTGHS_HCCHAR12_DEVADDR_S  22
/** USB_OTGHS_HCCHAR12_ODDFRM : R/W; bitpos: [29]; default: 0;
 *  Odd Frame (OddFrm)
 *
 *  This field is set (reset) by the application to indicate that the OTG host must
 *  perform
 *  a transfer in an odd (micro)Frame. This field is applicable for only periodic
 *  (isochronous and interrupt) transactions.
 *  - 1'b0: Even (micro)Frame
 *  - 1'b1: Odd (micro)Frame
 */
#define USB_OTGHS_HCCHAR12_ODDFRM    (BIT(29))
#define USB_OTGHS_HCCHAR12_ODDFRM_M  (USB_OTGHS_HCCHAR12_ODDFRM_V << USB_OTGHS_HCCHAR12_ODDFRM_S)
#define USB_OTGHS_HCCHAR12_ODDFRM_V  0x00000001U
#define USB_OTGHS_HCCHAR12_ODDFRM_S  29
/** USB_OTGHS_HCCHAR12_CHDIS : R/W; bitpos: [30]; default: 0;
 *  Channel Disable (ChDis)
 *
 *  The application sets this bit to stop transmitting/receiving data
 *  on a channel, even before the transfer for that channel is
 *  complete. The application must wait for the Channel Disabled
 *  interrupt before treating the channel as disabled.
 */
#define USB_OTGHS_HCCHAR12_CHDIS    (BIT(30))
#define USB_OTGHS_HCCHAR12_CHDIS_M  (USB_OTGHS_HCCHAR12_CHDIS_V << USB_OTGHS_HCCHAR12_CHDIS_S)
#define USB_OTGHS_HCCHAR12_CHDIS_V  0x00000001U
#define USB_OTGHS_HCCHAR12_CHDIS_S  30
/** USB_OTGHS_HCCHAR12_CHENA : R/W; bitpos: [31]; default: 0;
 *  Channel Enable (ChEna)
 *
 *  When Scatter/Gather mode is enabled
 *  - 1'b0: Indicates that the descriptor structure is not yet ready.
 *  - 1'b1:  Indicates  that  the  descriptor  structure  and  data  buffer  with data
 *  is setup and this channel can access the descriptor.
 *  When Scatter/Gather mode is disabled
 *
 *  This field is set by the application and cleared by the OTG host.
 *  - 1'b0: Channel disabled
 *  - 1'b1: Channel enabled
 */
#define USB_OTGHS_HCCHAR12_CHENA    (BIT(31))
#define USB_OTGHS_HCCHAR12_CHENA_M  (USB_OTGHS_HCCHAR12_CHENA_V << USB_OTGHS_HCCHAR12_CHENA_S)
#define USB_OTGHS_HCCHAR12_CHENA_V  0x00000001U
#define USB_OTGHS_HCCHAR12_CHENA_S  31

/** USB_OTGHS_HCSPLT12_REG register
 *  This register contains the Split characteristics of the Host Channel.
 */
#define USB_OTGHS_HCSPLT12_REG (DR_REG_USB_OTGHS_BASE + 0x684)
/** USB_OTGHS_HCSPLT12_PRTADDR : R/W; bitpos: [6:0]; default: 0;
 *  Port Address (PrtAddr)
 *
 *  This field is the port number of the recipient transaction translator.
 */
#define USB_OTGHS_HCSPLT12_PRTADDR    0x0000007FU
#define USB_OTGHS_HCSPLT12_PRTADDR_M  (USB_OTGHS_HCSPLT12_PRTADDR_V << USB_OTGHS_HCSPLT12_PRTADDR_S)
#define USB_OTGHS_HCSPLT12_PRTADDR_V  0x0000007FU
#define USB_OTGHS_HCSPLT12_PRTADDR_S  0
/** USB_OTGHS_HCSPLT12_HUBADDR : R/W; bitpos: [13:7]; default: 0;
 *  Hub Address (HubAddr)
 *
 *  This field holds the device address of the transaction translator's hub.
 */
#define USB_OTGHS_HCSPLT12_HUBADDR    0x0000007FU
#define USB_OTGHS_HCSPLT12_HUBADDR_M  (USB_OTGHS_HCSPLT12_HUBADDR_V << USB_OTGHS_HCSPLT12_HUBADDR_S)
#define USB_OTGHS_HCSPLT12_HUBADDR_V  0x0000007FU
#define USB_OTGHS_HCSPLT12_HUBADDR_S  7
/** USB_OTGHS_HCSPLT12_XACTPOS : R/W; bitpos: [15:14]; default: 0;
 *  Transaction Position (XactPos)
 *
 *  This field is used to determine whether to send all, first, middle, or last
 *  payloads with each OUT transaction.
 *  - 2'b11: All. This is the entire data payload is of this transaction (which is less
 *  than or equal to 188 bytes).
 *  - 2'b10: Begin. This is the first data payload of this transaction (which is larger
 *  than 188 bytes).
 *  - 2'b00: Mid. This is the middle payload of this transaction (which is larger than
 *  188 bytes).
 *  - 2'b01: End. This is the last payload of this transaction (which is larger than
 *  188 bytes).
 */
#define USB_OTGHS_HCSPLT12_XACTPOS    0x00000003U
#define USB_OTGHS_HCSPLT12_XACTPOS_M  (USB_OTGHS_HCSPLT12_XACTPOS_V << USB_OTGHS_HCSPLT12_XACTPOS_S)
#define USB_OTGHS_HCSPLT12_XACTPOS_V  0x00000003U
#define USB_OTGHS_HCSPLT12_XACTPOS_S  14
/** USB_OTGHS_HCSPLT12_COMPSPLT : R/W; bitpos: [16]; default: 0;
 *  Do Complete Split (CompSplt)
 *
 *  The application sets this field to request the OTG host to perform a complete split
 *  transaction.
 */
#define USB_OTGHS_HCSPLT12_COMPSPLT    (BIT(16))
#define USB_OTGHS_HCSPLT12_COMPSPLT_M  (USB_OTGHS_HCSPLT12_COMPSPLT_V << USB_OTGHS_HCSPLT12_COMPSPLT_S)
#define USB_OTGHS_HCSPLT12_COMPSPLT_V  0x00000001U
#define USB_OTGHS_HCSPLT12_COMPSPLT_S  16
/** USB_OTGHS_HCSPLT12_SPLTENA : R/W; bitpos: [31]; default: 0;
 *  Split Enable (SpltEna)
 *
 *  The application sets this field to indicate that this channel is enabled to perform
 *  split transactions.
 */
#define USB_OTGHS_HCSPLT12_SPLTENA    (BIT(31))
#define USB_OTGHS_HCSPLT12_SPLTENA_M  (USB_OTGHS_HCSPLT12_SPLTENA_V << USB_OTGHS_HCSPLT12_SPLTENA_S)
#define USB_OTGHS_HCSPLT12_SPLTENA_V  0x00000001U
#define USB_OTGHS_HCSPLT12_SPLTENA_S  31

