espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_HCINT12_REG register
 *  This register indicates the status of a channel with respect to USB- and
 *  AHB-related events. It is shown in the Interrupt Hierarchy figure in the databook.
 *  The application must read this register when the Host Channels Interrupt bit of the
 *  Core Interrupt register (GINTSTS.HChInt) is set. Before the application can read
 *  this register, it must first read the Host All Channels Interrupt (HAINT) register
 *  to get the exact channel number for the Host Channel-n Interrupt register. The
 *  application must clear the appropriate bit in this register to clear the
 *  corresponding bits in the HAINT and GINTSTS registers.
 */
#define USB_OTGHS_HCINT12_REG (DR_REG_USB_OTGHS_BASE + 0x688)
/** USB_OTGHS_HCINT12_XFERCOMPL : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed (XferCompl)
 *
 *  Transfer completed normally without any errors.This bit can be set only by the core
 *  and the application must write 1 to clear it.
 *  - For Scatter/Gather DMA mode, it indicates that current descriptor processing got
 *  completed with IOC bit set in its descriptor.
 *  - In non Scatter/Gather DMA mode, it indicates that Transfer completed normally
 *  without any errors.
 */
#define USB_OTGHS_HCINT12_XFERCOMPL    (BIT(0))
#define USB_OTGHS_HCINT12_XFERCOMPL_M  (USB_OTGHS_HCINT12_XFERCOMPL_V << USB_OTGHS_HCINT12_XFERCOMPL_S)
#define USB_OTGHS_HCINT12_XFERCOMPL_V  0x00000001U
#define USB_OTGHS_HCINT12_XFERCOMPL_S  0
/** USB_OTGHS_HCINT12_CHHLTD : R/W; bitpos: [1]; default: 0;
 *  Channel Halted (ChHltd)
 *
 *  In non Scatter/Gather DMA mode, it indicates the transfer completed abnormally
 *  either because of any USB transaction error or in response to disable request by
 *  the application or because of a completed transfer.
 *
 *  In Scatter/gather DMA mode, this indicates that transfer completed due to any of
 *  the following
 *  - EOL being set in descriptor
 *  - AHB error
 *  - Excessive transaction errors
 *  - Babble
 *  - Stall
 */
#define USB_OTGHS_HCINT12_CHHLTD    (BIT(1))
#define USB_OTGHS_HCINT12_CHHLTD_M  (USB_OTGHS_HCINT12_CHHLTD_V << USB_OTGHS_HCINT12_CHHLTD_S)
#define USB_OTGHS_HCINT12_CHHLTD_V  0x00000001U
#define USB_OTGHS_HCINT12_CHHLTD_S  1
/** USB_OTGHS_HCINT12_AHBERR : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErr)
 *
 *  This is generated only in Internal DMA mode when there is an AHB error during AHB
 *  read/write. The application can read the corresponding channel's DMA address
 *  register to get the error address. For details, see AHB Error Handling in the
 *  Programming Guide.
 */
#define USB_OTGHS_HCINT12_AHBERR    (BIT(2))
#define USB_OTGHS_HCINT12_AHBERR_M  (USB_OTGHS_HCINT12_AHBERR_V << USB_OTGHS_HCINT12_AHBERR_S)
#define USB_OTGHS_HCINT12_AHBERR_V  0x00000001U
#define USB_OTGHS_HCINT12_AHBERR_S  2
/** USB_OTGHS_HCINT12_STALL : R/W; bitpos: [3]; default: 0;
 *  STALL Response Received Interrupt (STALL)
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the
 *  core.This bit can be set only by the core and the application must write 1 to clear
 *  it.
 */
#define USB_OTGHS_HCINT12_STALL    (BIT(3))
#define USB_OTGHS_HCINT12_STALL_M  (USB_OTGHS_HCINT12_STALL_V << USB_OTGHS_HCINT12_STALL_S)
#define USB_OTGHS_HCINT12_STALL_V  0x00000001U
#define USB_OTGHS_HCINT12_STALL_S  3
/** USB_OTGHS_HCINT12_NAK : R/W; bitpos: [4]; default: 0;
 *  NAK Response Received Interrupt (NAK)
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the
 *  core.This bit can be set only by the core and the application must write 1 to clear
 *  it.
 */
#define USB_OTGHS_HCINT12_NAK    (BIT(4))
#define USB_OTGHS_HCINT12_NAK_M  (USB_OTGHS_HCINT12_NAK_V << USB_OTGHS_HCINT12_NAK_S)
#define USB_OTGHS_HCINT12_NAK_V  0x00000001U
#define USB_OTGHS_HCINT12_NAK_S  4
/** USB_OTGHS_HCINT12_ACK : R/W; bitpos: [5]; default: 0;
 *  ACK Response Received/Transmitted Interrupt (ACK)
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the
 *  core.This bit can be set only by the core and the application must write 1 to clear
 *  it.
 */
#define USB_OTGHS_HCINT12_ACK    (BIT(5))
#define USB_OTGHS_HCINT12_ACK_M  (USB_OTGHS_HCINT12_ACK_V << USB_OTGHS_HCINT12_ACK_S)
#define USB_OTGHS_HCINT12_ACK_V  0x00000001U
#define USB_OTGHS_HCINT12_ACK_S  5
/** USB_OTGHS_HCINT12_NYET : R/W; bitpos: [6]; default: 0;
 *  NYET Response Received Interrupt (NYET)
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the
 *  core.This bit can be set only by the core and the application must write 1 to clear
 *  it.
 */
#define USB_OTGHS_HCINT12_NYET    (BIT(6))
#define USB_OTGHS_HCINT12_NYET_M  (USB_OTGHS_HCINT12_NYET_V << USB_OTGHS_HCINT12_NYET_S)
#define USB_OTGHS_HCINT12_NYET_V  0x00000001U
#define USB_OTGHS_HCINT12_NYET_S  6
/** USB_OTGHS_HCINT12_XACTERR : R/W; bitpos: [7]; default: 0;
 *  Transaction Error (XactErr)
 *
 *  Indicates one of the following errors occurred on the USB.
 *  - CRC check failure
 *  - Timeout
 *  - Bit stuff error
 *  - False EOP
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the
 *  core.This bit can be set only by the core and the application must write 1 to clear
 *  it.
 */
#define USB_OTGHS_HCINT12_XACTERR    (BIT(7))
#define USB_OTGHS_HCINT12_XACTERR_M  (USB_OTGHS_HCINT12_XACTERR_V << USB_OTGHS_HCINT12_XACTERR_S)
#define USB_OTGHS_HCINT12_XACTERR_V  0x00000001U
#define USB_OTGHS_HCINT12_XACTERR_S  7
/** USB_OTGHS_HCINT12_BBLERR : R/W; bitpos: [8]; default: 0;
 *  Babble Error (BblErr)
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the core.
 *  This bit can be set only by the core and the application must write 1 to clear it.
 */
#define USB_OTGHS_HCINT12_BBLERR    (BIT(8))
#define USB_OTGHS_HCINT12_BBLERR_M  (USB_OTGHS_HCINT12_BBLERR_V << USB_OTGHS_HCINT12_BBLERR_S)
#define USB_OTGHS_HCINT12_BBLERR_V  0x00000001U
#define USB_OTGHS_HCINT12_BBLERR_S  8
/** USB_OTGHS_HCINT12_FRMOVRUN : R/W; bitpos: [9]; default: 0;
 *  Frame Overrun (FrmOvrun).
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked
 *  in the core. This bit can be set only by the core and the application must write 1
 *  to clear
 *  it.
 */
#define USB_OTGHS_HCINT12_FRMOVRUN    (BIT(9))
#define USB_OTGHS_HCINT12_FRMOVRUN_M  (USB_OTGHS_HCINT12_FRMOVRUN_V << USB_OTGHS_HCINT12_FRMOVRUN_S)
#define USB_OTGHS_HCINT12_FRMOVRUN_V  0x00000001U
#define USB_OTGHS_HCINT12_FRMOVRUN_S  9
/** USB_OTGHS_HCINT12_DATATGLERR : R/W; bitpos: [10]; default: 0;
 *
 *  Data Toggle Error (DataTglErr).This bit can be set only by the core and the
 *  application must write 1 to clear
 *  it.In Scatter/Gather DMA mode, the interrupt due to this bit is masked
 *  in the core.
 */
#define USB_OTGHS_HCINT12_DATATGLERR    (BIT(10))
#define USB_OTGHS_HCINT12_DATATGLERR_M  (USB_OTGHS_HCINT12_DATATGLERR_V << USB_OTGHS_HCINT12_DATATGLERR_S)
#define USB_OTGHS_HCINT12_DATATGLERR_V  0x00000001U
#define USB_OTGHS_HCINT12_DATATGLERR_S  10
/** USB_OTGHS_HCINT12_BNAINTR : R/W; bitpos: [11]; default: 0;
 *  BNA (Buffer Not Available) Interrupt (BNAIntr)
 *
 *  This bit is valid only when Scatter/Gather DMA mode is enabled.
 *  The core generates this interrupt when the descriptor accessed
 *  is not ready for the Core to process. BNA is not generated
 *  for Isochronous channels.
 *  For non Scatter/Gather DMA mode, this bit is reserved.
 */
#define USB_OTGHS_HCINT12_BNAINTR    (BIT(11))
#define USB_OTGHS_HCINT12_BNAINTR_M  (USB_OTGHS_HCINT12_BNAINTR_V << USB_OTGHS_HCINT12_BNAINTR_S)
#define USB_OTGHS_HCINT12_BNAINTR_V  0x00000001U
#define USB_OTGHS_HCINT12_BNAINTR_S  11
/** USB_OTGHS_HCINT12_XCS_XACT_ERR : R/W; bitpos: [12]; default: 0;
 *  Excessive Transaction Error (XCS_XACT_ERR)
 *
 *  This bit is valid only when Scatter/Gather DMA mode is enabled. The core sets this
 *  bit
 *  when 3 consecutive transaction errors occurred on the USB bus. XCS_XACT_ERR
 *  is not generated for Isochronous channels.
 *  For non Scatter/Gather DMA mode, this bit is reserved.
 */
#define USB_OTGHS_HCINT12_XCS_XACT_ERR    (BIT(12))
#define USB_OTGHS_HCINT12_XCS_XACT_ERR_M  (USB_OTGHS_HCINT12_XCS_XACT_ERR_V << USB_OTGHS_HCINT12_XCS_XACT_ERR_S)
#define USB_OTGHS_HCINT12_XCS_XACT_ERR_V  0x00000001U
#define USB_OTGHS_HCINT12_XCS_XACT_ERR_S  12
/** USB_OTGHS_HCINT12_DESC_LST_ROLLINTR : R/W; bitpos: [13]; default: 0;
 *  Descriptor rollover interrupt (DESC_LST_ROLLIntr)
 *
 *  This bit is valid only when Scatter/Gather DMA mode is enabled. The core sets this
 *  bit
 *  when the corresponding channel's descriptor list rolls over.
 *  For non Scatter/Gather DMA mode, this bit is reserved.
 */
#define USB_OTGHS_HCINT12_DESC_LST_ROLLINTR    (BIT(13))
#define USB_OTGHS_HCINT12_DESC_LST_ROLLINTR_M  (USB_OTGHS_HCINT12_DESC_LST_ROLLINTR_V << USB_OTGHS_HCINT12_DESC_LST_ROLLINTR_S)
#define USB_OTGHS_HCINT12_DESC_LST_ROLLINTR_V  0x00000001U
#define USB_OTGHS_HCINT12_DESC_LST_ROLLINTR_S  13

