espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_HCCHAR14_REG register
 *  This register contains the characteristics of the Host Channel.
 */
#define USB_OTGHS_HCCHAR14_REG (DR_REG_USB_OTGHS_BASE + 0x6c0)
/** USB_OTGHS_HCCHAR14_MPS : R/W; bitpos: [10:0]; default: 0;
 *  Maximum Packet Size (MPS)
 *
 *  Indicates the maximum packet size of the associated endpoint.
 */
#define USB_OTGHS_HCCHAR14_MPS    0x000007FFU
#define USB_OTGHS_HCCHAR14_MPS_M  (USB_OTGHS_HCCHAR14_MPS_V << USB_OTGHS_HCCHAR14_MPS_S)
#define USB_OTGHS_HCCHAR14_MPS_V  0x000007FFU
#define USB_OTGHS_HCCHAR14_MPS_S  0
/** USB_OTGHS_HCCHAR14_EPNUM : R/W; bitpos: [14:11]; default: 0;
 *  Endpoint Number (EPNum)
 *
 *  Indicates the endpoint number on the device serving as the data source or sink.
 */
#define USB_OTGHS_HCCHAR14_EPNUM    0x0000000FU
#define USB_OTGHS_HCCHAR14_EPNUM_M  (USB_OTGHS_HCCHAR14_EPNUM_V << USB_OTGHS_HCCHAR14_EPNUM_S)
#define USB_OTGHS_HCCHAR14_EPNUM_V  0x0000000FU
#define USB_OTGHS_HCCHAR14_EPNUM_S  11
/** USB_OTGHS_HCCHAR14_EPDIR : R/W; bitpos: [15]; default: 0;
 *  Endpoint Direction (EPDir)
 *
 *  Indicates whether the transaction is IN or OUT.
 *  - 1'b0: OUT
 *  - 1'b1: IN
 */
#define USB_OTGHS_HCCHAR14_EPDIR    (BIT(15))
#define USB_OTGHS_HCCHAR14_EPDIR_M  (USB_OTGHS_HCCHAR14_EPDIR_V << USB_OTGHS_HCCHAR14_EPDIR_S)
#define USB_OTGHS_HCCHAR14_EPDIR_V  0x00000001U
#define USB_OTGHS_HCCHAR14_EPDIR_S  15
/** USB_OTGHS_HCCHAR14_LSPDDEV : R/W; bitpos: [17]; default: 0;
 *  Low-Speed Device (LSpdDev)
 *
 *  This field is Set by the application to indicate that this channel is communicating
 *  to a low-speed device.
 *
 *  The application must program this bit when a low speed device is connected to the
 *  host through an FS HUB. The DWC_otg Host core uses this field to drive the
 *  XCVR_SELECT signal to 2'b11 while communicating to the LS Device through the FS hub.
 *
 *  Note: In a peer to peer setup, the DWC_otg Host core ignores this bit even if it is
 *  set by the application software.
 */
#define USB_OTGHS_HCCHAR14_LSPDDEV    (BIT(17))
#define USB_OTGHS_HCCHAR14_LSPDDEV_M  (USB_OTGHS_HCCHAR14_LSPDDEV_V << USB_OTGHS_HCCHAR14_LSPDDEV_S)
#define USB_OTGHS_HCCHAR14_LSPDDEV_V  0x00000001U
#define USB_OTGHS_HCCHAR14_LSPDDEV_S  17
/** USB_OTGHS_HCCHAR14_EPTYPE : R/W; bitpos: [19:18]; default: 0;
 *  Endpoint Type (EPType)
 *
 *  Indicates the transfer type selected.
 *  - 2'b00: Control
 *  - 2'b01: Isochronous
 *  - 2'b10: Bulk
 *  - 2'b11: Interrupt
 */
#define USB_OTGHS_HCCHAR14_EPTYPE    0x00000003U
#define USB_OTGHS_HCCHAR14_EPTYPE_M  (USB_OTGHS_HCCHAR14_EPTYPE_V << USB_OTGHS_HCCHAR14_EPTYPE_S)
#define USB_OTGHS_HCCHAR14_EPTYPE_V  0x00000003U
#define USB_OTGHS_HCCHAR14_EPTYPE_S  18
/** USB_OTGHS_HCCHAR14_EC : R/W; bitpos: [21:20]; default: 0;
 *  Multi Count (MC) / Error Count (EC)
 *
 *  When the Split Enable bit of the Host Channel-n Split Control
 *  register (HCSPLTn.SpltEna) is reset (1'b0), this field indicates to
 *  the host the number of transactions that must be executed per
 *  microframe for this periodic endpoint. For non periodic transfers,
 *  this field is used only in DMA mode, and specifies the number
 *  packets to be fetched for this channel before the internal DMA
 *  engine changes arbitration.
 *  - 2'b00: Reserved This field yields undefined results.
 *  - 2'b01: 1 transaction
 *  - 2'b10: 2 transactions to be issued for this endpoint per microframe
 *  - 2'b11: 3 transactions to be issued for this endpoint per microframe
 *  When HCSPLTn.SpltEna is Set (1'b1), this field indicates the
 *  number of immediate retries to be performed for a periodic split
 *  transactions on transaction errors. This field must be Set to at
 *  least 2'b01.
 */
#define USB_OTGHS_HCCHAR14_EC    0x00000003U
#define USB_OTGHS_HCCHAR14_EC_M  (USB_OTGHS_HCCHAR14_EC_V << USB_OTGHS_HCCHAR14_EC_S)
#define USB_OTGHS_HCCHAR14_EC_V  0x00000003U
#define USB_OTGHS_HCCHAR14_EC_S  20
/** USB_OTGHS_HCCHAR14_DEVADDR : R/W; bitpos: [28:22]; default: 0;
 *  Device Address (DevAddr)
 *
 *  This field selects the specific device serving as the data source
 *  or sink.
 */
#define USB_OTGHS_HCCHAR14_DEVADDR    0x0000007FU
#define USB_OTGHS_HCCHAR14_DEVADDR_M  (USB_OTGHS_HCCHAR14_DEVADDR_V << USB_OTGHS_HCCHAR14_DEVADDR_S)
#define USB_OTGHS_HCCHAR14_DEVADDR_V  0x0000007FU
#define USB_OTGHS_HCCHAR14_DEVADDR_S  22
/** USB_OTGHS_HCCHAR14_ODDFRM : R/W; bitpos: [29]; default: 0;
 *  Odd Frame (OddFrm)
 *
 *  This field is set (reset) by the application to indicate that the OTG host must
 *  perform
 *  a transfer in an odd (micro)Frame. This field is applicable for only periodic
 *  (isochronous and interrupt) transactions.
 *  - 1'b0: Even (micro)Frame
 *  - 1'b1: Odd (micro)Frame
 */
#define USB_OTGHS_HCCHAR14_ODDFRM    (BIT(29))
#define USB_OTGHS_HCCHAR14_ODDFRM_M  (USB_OTGHS_HCCHAR14_ODDFRM_V << USB_OTGHS_HCCHAR14_ODDFRM_S)
#define USB_OTGHS_HCCHAR14_ODDFRM_V  0x00000001U
#define USB_OTGHS_HCCHAR14_ODDFRM_S  29
/** USB_OTGHS_HCCHAR14_CHDIS : R/W; bitpos: [30]; default: 0;
 *  Channel Disable (ChDis)
 *
 *  The application sets this bit to stop transmitting/receiving data
 *  on a channel, even before the transfer for that channel is
 *  complete. The application must wait for the Channel Disabled
 *  interrupt before treating the channel as disabled.
 */
#define USB_OTGHS_HCCHAR14_CHDIS    (BIT(30))
#define USB_OTGHS_HCCHAR14_CHDIS_M  (USB_OTGHS_HCCHAR14_CHDIS_V << USB_OTGHS_HCCHAR14_CHDIS_S)
#define USB_OTGHS_HCCHAR14_CHDIS_V  0x00000001U
#define USB_OTGHS_HCCHAR14_CHDIS_S  30
/** USB_OTGHS_HCCHAR14_CHENA : R/W; bitpos: [31]; default: 0;
 *  Channel Enable (ChEna)
 *
 *  When Scatter/Gather mode is enabled
 *  - 1'b0: Indicates that the descriptor structure is not yet ready.
 *  - 1'b1:  Indicates  that  the  descriptor  structure  and  data  buffer  with data
 *  is setup and this channel can access the descriptor.
 *  When Scatter/Gather mode is disabled
 *
 *  This field is set by the application and cleared by the OTG host.
 *  - 1'b0: Channel disabled
 *  - 1'b1: Channel enabled
 */
#define USB_OTGHS_HCCHAR14_CHENA    (BIT(31))
#define USB_OTGHS_HCCHAR14_CHENA_M  (USB_OTGHS_HCCHAR14_CHENA_V << USB_OTGHS_HCCHAR14_CHENA_S)
#define USB_OTGHS_HCCHAR14_CHENA_V  0x00000001U
#define USB_OTGHS_HCCHAR14_CHENA_S  31

