espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_HCSPLT14_REG register
 *  This register contains the Split characteristics of the Host Channel.
 */
#define USB_OTGHS_HCSPLT14_REG (DR_REG_USB_OTGHS_BASE + 0x6c4)
/** USB_OTGHS_HCSPLT14_PRTADDR : R/W; bitpos: [6:0]; default: 0;
 *  Port Address (PrtAddr)
 *
 *  This field is the port number of the recipient transaction translator.
 */
#define USB_OTGHS_HCSPLT14_PRTADDR    0x0000007FU
#define USB_OTGHS_HCSPLT14_PRTADDR_M  (USB_OTGHS_HCSPLT14_PRTADDR_V << USB_OTGHS_HCSPLT14_PRTADDR_S)
#define USB_OTGHS_HCSPLT14_PRTADDR_V  0x0000007FU
#define USB_OTGHS_HCSPLT14_PRTADDR_S  0
/** USB_OTGHS_HCSPLT14_HUBADDR : R/W; bitpos: [13:7]; default: 0;
 *  Hub Address (HubAddr)
 *
 *  This field holds the device address of the transaction translator's hub.
 */
#define USB_OTGHS_HCSPLT14_HUBADDR    0x0000007FU
#define USB_OTGHS_HCSPLT14_HUBADDR_M  (USB_OTGHS_HCSPLT14_HUBADDR_V << USB_OTGHS_HCSPLT14_HUBADDR_S)
#define USB_OTGHS_HCSPLT14_HUBADDR_V  0x0000007FU
#define USB_OTGHS_HCSPLT14_HUBADDR_S  7
/** USB_OTGHS_HCSPLT14_XACTPOS : R/W; bitpos: [15:14]; default: 0;
 *  Transaction Position (XactPos)
 *
 *  This field is used to determine whether to send all, first, middle, or last
 *  payloads with each OUT transaction.
 *  - 2'b11: All. This is the entire data payload is of this transaction (which is less
 *  than or equal to 188 bytes).
 *  - 2'b10: Begin. This is the first data payload of this transaction (which is larger
 *  than 188 bytes).
 *  - 2'b00: Mid. This is the middle payload of this transaction (which is larger than
 *  188 bytes).
 *  - 2'b01: End. This is the last payload of this transaction (which is larger than
 *  188 bytes).
 */
#define USB_OTGHS_HCSPLT14_XACTPOS    0x00000003U
#define USB_OTGHS_HCSPLT14_XACTPOS_M  (USB_OTGHS_HCSPLT14_XACTPOS_V << USB_OTGHS_HCSPLT14_XACTPOS_S)
#define USB_OTGHS_HCSPLT14_XACTPOS_V  0x00000003U
#define USB_OTGHS_HCSPLT14_XACTPOS_S  14
/** USB_OTGHS_HCSPLT14_COMPSPLT : R/W; bitpos: [16]; default: 0;
 *  Do Complete Split (CompSplt)
 *
 *  The application sets this field to request the OTG host to perform a complete split
 *  transaction.
 */
#define USB_OTGHS_HCSPLT14_COMPSPLT    (BIT(16))
#define USB_OTGHS_HCSPLT14_COMPSPLT_M  (USB_OTGHS_HCSPLT14_COMPSPLT_V << USB_OTGHS_HCSPLT14_COMPSPLT_S)
#define USB_OTGHS_HCSPLT14_COMPSPLT_V  0x00000001U
#define USB_OTGHS_HCSPLT14_COMPSPLT_S  16
/** USB_OTGHS_HCSPLT14_SPLTENA : R/W; bitpos: [31]; default: 0;
 *  Split Enable (SpltEna)
 *
 *  The application sets this field to indicate that this channel is enabled to perform
 *  split transactions.
 */
#define USB_OTGHS_HCSPLT14_SPLTENA    (BIT(31))
#define USB_OTGHS_HCSPLT14_SPLTENA_M  (USB_OTGHS_HCSPLT14_SPLTENA_V << USB_OTGHS_HCSPLT14_SPLTENA_S)
#define USB_OTGHS_HCSPLT14_SPLTENA_V  0x00000001U
#define USB_OTGHS_HCSPLT14_SPLTENA_S  31

/** USB_OTGHS_HCINT14_REG register
 *  This register indicates the status of a channel with respect to USB- and
 *  AHB-related events. It is shown in the Interrupt Hierarchy figure in the databook.
 *  The application must read this register when the Host Channels Interrupt bit of the
 *  Core Interrupt register (GINTSTS.HChInt) is set. Before the application can read
 *  this register, it must first read the Host All Channels Interrupt (HAINT) register
 *  to get the exact channel number for the Host Channel-n Interrupt register. The
 *  application must clear the appropriate bit in this register to clear the
 *  corresponding bits in the HAINT and GINTSTS registers.
 */
#define USB_OTGHS_HCINT14_REG (DR_REG_USB_OTGHS_BASE + 0x6c8)
/** USB_OTGHS_HCINT14_XFERCOMPL : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed (XferCompl)
 *
 *  Transfer completed normally without any errors.This bit can be set only by the core
 *  and the application must write 1 to clear it.
 *  - For Scatter/Gather DMA mode, it indicates that current descriptor processing got
 *  completed with IOC bit set in its descriptor.
 *  - In non Scatter/Gather DMA mode, it indicates that Transfer completed normally
 *  without any errors.
 */
#define USB_OTGHS_HCINT14_XFERCOMPL    (BIT(0))
#define USB_OTGHS_HCINT14_XFERCOMPL_M  (USB_OTGHS_HCINT14_XFERCOMPL_V << USB_OTGHS_HCINT14_XFERCOMPL_S)
#define USB_OTGHS_HCINT14_XFERCOMPL_V  0x00000001U
#define USB_OTGHS_HCINT14_XFERCOMPL_S  0
/** USB_OTGHS_HCINT14_CHHLTD : R/W; bitpos: [1]; default: 0;
 *  Channel Halted (ChHltd)
 *
 *  In non Scatter/Gather DMA mode, it indicates the transfer completed abnormally
 *  either because of any USB transaction error or in response to disable request by
 *  the application or because of a completed transfer.
 *
 *  In Scatter/gather DMA mode, this indicates that transfer completed due to any of
 *  the following
 *  - EOL being set in descriptor
 *  - AHB error
 *  - Excessive transaction errors
 *  - Babble
 *  - Stall
 */
#define USB_OTGHS_HCINT14_CHHLTD    (BIT(1))
#define USB_OTGHS_HCINT14_CHHLTD_M  (USB_OTGHS_HCINT14_CHHLTD_V << USB_OTGHS_HCINT14_CHHLTD_S)
#define USB_OTGHS_HCINT14_CHHLTD_V  0x00000001U
#define USB_OTGHS_HCINT14_CHHLTD_S  1
/** USB_OTGHS_HCINT14_AHBERR : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErr)
 *
 *  This is generated only in Internal DMA mode when there is an AHB error during AHB
 *  read/write. The application can read the corresponding channel's DMA address
 *  register to get the error address. For details, see AHB Error Handling in the
 *  Programming Guide.
 */
#define USB_OTGHS_HCINT14_AHBERR    (BIT(2))
#define USB_OTGHS_HCINT14_AHBERR_M  (USB_OTGHS_HCINT14_AHBERR_V << USB_OTGHS_HCINT14_AHBERR_S)
#define USB_OTGHS_HCINT14_AHBERR_V  0x00000001U
#define USB_OTGHS_HCINT14_AHBERR_S  2
/** USB_OTGHS_HCINT14_STALL : R/W; bitpos: [3]; default: 0;
 *  STALL Response Received Interrupt (STALL)
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the
 *  core.This bit can be set only by the core and the application must write 1 to clear
 *  it.
 */
#define USB_OTGHS_HCINT14_STALL    (BIT(3))
#define USB_OTGHS_HCINT14_STALL_M  (USB_OTGHS_HCINT14_STALL_V << USB_OTGHS_HCINT14_STALL_S)
#define USB_OTGHS_HCINT14_STALL_V  0x00000001U
#define USB_OTGHS_HCINT14_STALL_S  3
/** USB_OTGHS_HCINT14_NAK : R/W; bitpos: [4]; default: 0;
 *  NAK Response Received Interrupt (NAK)
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the
 *  core.This bit can be set only by the core and the application must write 1 to clear
 *  it.
 */
#define USB_OTGHS_HCINT14_NAK    (BIT(4))
#define USB_OTGHS_HCINT14_NAK_M  (USB_OTGHS_HCINT14_NAK_V << USB_OTGHS_HCINT14_NAK_S)
#define USB_OTGHS_HCINT14_NAK_V  0x00000001U
#define USB_OTGHS_HCINT14_NAK_S  4
/** USB_OTGHS_HCINT14_ACK : R/W; bitpos: [5]; default: 0;
 *  ACK Response Received/Transmitted Interrupt (ACK)
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the
 *  core.This bit can be set only by the core and the application must write 1 to clear
 *  it.
 */
#define USB_OTGHS_HCINT14_ACK    (BIT(5))
#define USB_OTGHS_HCINT14_ACK_M  (USB_OTGHS_HCINT14_ACK_V << USB_OTGHS_HCINT14_ACK_S)
#define USB_OTGHS_HCINT14_ACK_V  0x00000001U
#define USB_OTGHS_HCINT14_ACK_S  5
/** USB_OTGHS_HCINT14_NYET : R/W; bitpos: [6]; default: 0;
 *  NYET Response Received Interrupt (NYET)
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the
 *  core.This bit can be set only by the core and the application must write 1 to clear
 *  it.
 */
#define USB_OTGHS_HCINT14_NYET    (BIT(6))
#define USB_OTGHS_HCINT14_NYET_M  (USB_OTGHS_HCINT14_NYET_V << USB_OTGHS_HCINT14_NYET_S)
#define USB_OTGHS_HCINT14_NYET_V  0x00000001U
#define USB_OTGHS_HCINT14_NYET_S  6
/** USB_OTGHS_HCINT14_XACTERR : R/W; bitpos: [7]; default: 0;
 *  Transaction Error (XactErr)
 *
 *  Indicates one of the following errors occurred on the USB.
 *  - CRC check failure
 *  - Timeout
 *  - Bit stuff error
 *  - False EOP
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the
 *  core.This bit can be set only by the core and the application must write 1 to clear
 *  it.
 */
#define USB_OTGHS_HCINT14_XACTERR    (BIT(7))
#define USB_OTGHS_HCINT14_XACTERR_M  (USB_OTGHS_HCINT14_XACTERR_V << USB_OTGHS_HCINT14_XACTERR_S)
#define USB_OTGHS_HCINT14_XACTERR_V  0x00000001U
#define USB_OTGHS_HCINT14_XACTERR_S  7
/** USB_OTGHS_HCINT14_BBLERR : R/W; bitpos: [8]; default: 0;
 *  Babble Error (BblErr)
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked in the core.
 *  This bit can be set only by the core and the application must write 1 to clear it.
 */
#define USB_OTGHS_HCINT14_BBLERR    (BIT(8))
#define USB_OTGHS_HCINT14_BBLERR_M  (USB_OTGHS_HCINT14_BBLERR_V << USB_OTGHS_HCINT14_BBLERR_S)
#define USB_OTGHS_HCINT14_BBLERR_V  0x00000001U
#define USB_OTGHS_HCINT14_BBLERR_S  8
/** USB_OTGHS_HCINT14_FRMOVRUN : R/W; bitpos: [9]; default: 0;
 *  Frame Overrun (FrmOvrun).
 *
 *  In Scatter/Gather DMA mode, the interrupt due to this bit is masked
 *  in the core. This bit can be set only by the core and the application must write 1
 *  to clear
 *  it.
 */
#define USB_OTGHS_HCINT14_FRMOVRUN    (BIT(9))
#define USB_OTGHS_HCINT14_FRMOVRUN_M  (USB_OTGHS_HCINT14_FRMOVRUN_V << USB_OTGHS_HCINT14_FRMOVRUN_S)
#define USB_OTGHS_HCINT14_FRMOVRUN_V  0x00000001U
#define USB_OTGHS_HCINT14_FRMOVRUN_S  9
/** USB_OTGHS_HCINT14_DATATGLERR : R/W; bitpos: [10]; default: 0;
 *
 *  Data Toggle Error (DataTglErr).This bit can be set only by the core and the
 *  application must write 1 to clear
 *  it.In Scatter/Gather DMA mode, the interrupt due to this bit is masked
 *  in the core.
 */
#define USB_OTGHS_HCINT14_DATATGLERR    (BIT(10))
#define USB_OTGHS_HCINT14_DATATGLERR_M  (USB_OTGHS_HCINT14_DATATGLERR_V << USB_OTGHS_HCINT14_DATATGLERR_S)
#define USB_OTGHS_HCINT14_DATATGLERR_V  0x00000001U
#define USB_OTGHS_HCINT14_DATATGLERR_S  10
/** USB_OTGHS_HCINT14_BNAINTR : R/W; bitpos: [11]; default: 0;
 *  BNA (Buffer Not Available) Interrupt (BNAIntr)
 *
 *  This bit is valid only when Scatter/Gather DMA mode is enabled.
 *  The core generates this interrupt when the descriptor accessed
 *  is not ready for the Core to process. BNA is not generated
 *  for Isochronous channels.
 *  For non Scatter/Gather DMA mode, this bit is reserved.
 */
#define USB_OTGHS_HCINT14_BNAINTR    (BIT(11))
#define USB_OTGHS_HCINT14_BNAINTR_M  (USB_OTGHS_HCINT14_BNAINTR_V << USB_OTGHS_HCINT14_BNAINTR_S)
#define USB_OTGHS_HCINT14_BNAINTR_V  0x00000001U
#define USB_OTGHS_HCINT14_BNAINTR_S  11
/** USB_OTGHS_HCINT14_XCS_XACT_ERR : R/W; bitpos: [12]; default: 0;
 *  Excessive Transaction Error (XCS_XACT_ERR)
 *
 *  This bit is valid only when Scatter/Gather DMA mode is enabled. The core sets this
 *  bit
 *  when 3 consecutive transaction errors occurred on the USB bus. XCS_XACT_ERR
 *  is not generated for Isochronous channels.
 *  For non Scatter/Gather DMA mode, this bit is reserved.
 */
#define USB_OTGHS_HCINT14_XCS_XACT_ERR    (BIT(12))
#define USB_OTGHS_HCINT14_XCS_XACT_ERR_M  (USB_OTGHS_HCINT14_XCS_XACT_ERR_V << USB_OTGHS_HCINT14_XCS_XACT_ERR_S)
#define USB_OTGHS_HCINT14_XCS_XACT_ERR_V  0x00000001U
#define USB_OTGHS_HCINT14_XCS_XACT_ERR_S  12
/** USB_OTGHS_HCINT14_DESC_LST_ROLLINTR : R/W; bitpos: [13]; default: 0;
 *  Descriptor rollover interrupt (DESC_LST_ROLLIntr)
 *
 *  This bit is valid only when Scatter/Gather DMA mode is enabled. The core sets this
 *  bit
 *  when the corresponding channel's descriptor list rolls over.
 *  For non Scatter/Gather DMA mode, this bit is reserved.
 */
#define USB_OTGHS_HCINT14_DESC_LST_ROLLINTR    (BIT(13))
#define USB_OTGHS_HCINT14_DESC_LST_ROLLINTR_M  (USB_OTGHS_HCINT14_DESC_LST_ROLLINTR_V << USB_OTGHS_HCINT14_DESC_LST_ROLLINTR_S)
#define USB_OTGHS_HCINT14_DESC_LST_ROLLINTR_V  0x00000001U
#define USB_OTGHS_HCINT14_DESC_LST_ROLLINTR_S  13

/** USB_OTGHS_HCINTMSK14_REG register
 *  This register reflects the mask for each channel status described in the previous
 *  section.
 */
#define USB_OTGHS_HCINTMSK14_REG (DR_REG_USB_OTGHS_BASE + 0x6cc)
/** USB_OTGHS_HCINTMSK14_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *
 *  Transfer Completed Mask (XferComplMsk)
 */
#define USB_OTGHS_HCINTMSK14_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_HCINTMSK14_XFERCOMPLMSK_M  (USB_OTGHS_HCINTMSK14_XFERCOMPLMSK_V << USB_OTGHS_HCINTMSK14_XFERCOMPLMSK_S)
#define USB_OTGHS_HCINTMSK14_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_HCINTMSK14_XFERCOMPLMSK_S  0
/** USB_OTGHS_HCINTMSK14_CHHLTDMSK : R/W; bitpos: [1]; default: 0;
 *
 *  Channel Halted Mask (ChHltdMsk)
 */
#define USB_OTGHS_HCINTMSK14_CHHLTDMSK    (BIT(1))
#define USB_OTGHS_HCINTMSK14_CHHLTDMSK_M  (USB_OTGHS_HCINTMSK14_CHHLTDMSK_V << USB_OTGHS_HCINTMSK14_CHHLTDMSK_S)
#define USB_OTGHS_HCINTMSK14_CHHLTDMSK_V  0x00000001U
#define USB_OTGHS_HCINTMSK14_CHHLTDMSK_S  1
/** USB_OTGHS_HCINTMSK14_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *
 *  AHB Error Mask (AHBErrMsk)
 *  In  scatter/gather  DMA  mode  for  host,
 *  interrupts are not generated due to the corresponding bits set in
 *  HCINTn.
 */
#define USB_OTGHS_HCINTMSK14_AHBERRMSK    (BIT(2))
#define USB_OTGHS_HCINTMSK14_AHBERRMSK_M  (USB_OTGHS_HCINTMSK14_AHBERRMSK_V << USB_OTGHS_HCINTMSK14_AHBERRMSK_S)
#define USB_OTGHS_HCINTMSK14_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_HCINTMSK14_AHBERRMSK_S  2
/** USB_OTGHS_HCINTMSK14_BNAINTRMSK : R/W; bitpos: [11]; default: 0;
 *
 *  BNA  (Buffer  Not  Available)  Interrupt  mask  register  (BNAIntrMsk)
 *  This bit is valid only when Scatter/Gather DMA mode is enabled.
 */
#define USB_OTGHS_HCINTMSK14_BNAINTRMSK    (BIT(11))
#define USB_OTGHS_HCINTMSK14_BNAINTRMSK_M  (USB_OTGHS_HCINTMSK14_BNAINTRMSK_V << USB_OTGHS_HCINTMSK14_BNAINTRMSK_S)
#define USB_OTGHS_HCINTMSK14_BNAINTRMSK_V  0x00000001U
#define USB_OTGHS_HCINTMSK14_BNAINTRMSK_S  11
/** USB_OTGHS_HCINTMSK14_DESC_LST_ROLLINTRMSK : R/W; bitpos: [13]; default: 0;
 *
 *  Descriptor List rollover interrupt Mask register(DESC_LST_ROLLIntrMsk)
 *  This bit is valid only when Scatter/Gather DMA mode is enabled.
 */
#define USB_OTGHS_HCINTMSK14_DESC_LST_ROLLINTRMSK    (BIT(13))
#define USB_OTGHS_HCINTMSK14_DESC_LST_ROLLINTRMSK_M  (USB_OTGHS_HCINTMSK14_DESC_LST_ROLLINTRMSK_V << USB_OTGHS_HCINTMSK14_DESC_LST_ROLLINTRMSK_S)
#define USB_OTGHS_HCINTMSK14_DESC_LST_ROLLINTRMSK_V  0x00000001U
#define USB_OTGHS_HCINTMSK14_DESC_LST_ROLLINTRMSK_S  13

/** USB_OTGHS_HCTSIZ14_REG register
 *  This register reflects the transfer size for the Host Channel.
 */
#define USB_OTGHS_HCTSIZ14_REG (DR_REG_USB_OTGHS_BASE + 0x6d0)
/** USB_OTGHS_HCTSIZ14_XFERSIZE : R/W; bitpos: [18:0]; default: 0;
 *  Non-Scatter/Gather DMA Mode:
 *
 *  Transfer Size (XferSize)
 *
 *  For an OUT, this field is the number of data bytes the host sends during the
 *  transfer.
 *
 *  For an IN, this field is the buffer size that the application has Reserved for the
 *  transfer. The application is expected to program this field as an integer multiple
 *  of the maximum packet size for IN transactions (periodic and non-periodic).
 *
 *  The width of this counter is specified as Width of Transfer Size Counters during
 *  coreConsultant configuration (parameter OTG_TRANS_COUNT_WIDTH).
 *
 *  Scatter/Gather DMA Mode:
 *
 *  [18:16]: Reserved
 *
 *  [15:8]: NTD (Number of Transfer Descriptors)
 *
 *  (Non Isochronous)
 *
 *  This value is in terms of number of descriptors. Maximum number of descriptor that
 *  can be present in the list is 64. The values can be from 0 to 63.
 *  - 0: 1 descriptor
 *  - 63: 64 descriptors
 *  This field indicates the total number of descriptors present in that list. The core
 *  wraps around after servicing NTD number of descriptors for that list.
 *
 *  (Isochronous)
 *
 *  This field indicates the number of descriptors present in that list microframe.
 *
 *  The possible values for FS are
 *  - 1: 2 descriptors
 *  - 3: 4 descriptors
 *  - 7: 8 descriptors
 *  - 15: 16 descriptors
 *  - 31: 32 descriptors
 *  - 63: 64 descriptors
 *  The possible values for HS are
 *  - 7: 8 descriptors
 *  - 15: 16 descriptors
 *  - 31: 32 descriptors
 *  - 63: 64 descriptors
 *  - 127: 128 descriptors
 *  - 255: 256 descriptors
 *  [7:0]: SCHED_INFO (Schedule information)
 *
 *  Every bit in this 8 bit register indicates scheduling for that microframe.
 *
 *  Bit 0 indicates scheduling for 1st microframe and bit 7 indicates scheduling for
 *  8th microframe in that frame.
 *
 *  A value of 8'b11111111 indicates that the corresponding interrupt channel is
 *  scheduled to issue a token every microframe in that frame. A value of 8'b10101010
 *  indicates that the corresponding interrupt channel is scheduled to issue a token
 *  every alternate microframe starting with second microframe. Note that this field is
 *  applicable only for periodic (Isochronous and Interrupt) channels.
 */
#define USB_OTGHS_HCTSIZ14_XFERSIZE    0x0007FFFFU
#define USB_OTGHS_HCTSIZ14_XFERSIZE_M  (USB_OTGHS_HCTSIZ14_XFERSIZE_V << USB_OTGHS_HCTSIZ14_XFERSIZE_S)
#define USB_OTGHS_HCTSIZ14_XFERSIZE_V  0x0007FFFFU
#define USB_OTGHS_HCTSIZ14_XFERSIZE_S  0
/** USB_OTGHS_HCTSIZ14_PKTCNT : R/W; bitpos: [28:19]; default: 0;
 *  Non-Scatter/Gather DMA Mode:
 *
 *  Packet Count (PktCnt)
 *
 *  This field is programmed by the application with the expected number of packets to
 *  be transmitted (OUT) or received (IN).
 *
 *  The host decrements this count on every successful transmission or reception of an
 *  OUT/IN packet. Once this count reaches zero, the application is interrupted to
 *  indicate normal completion.
 *
 *  The width of this counter is specified as Width of Packet Counters during
 *  coreConsultant configuration (parameter OTG_PACKET_COUNT_WIDTH).
 *
 *  Scatter/Gather DMA Mode:
 *
 *  [28:19]: Reserved
 */
#define USB_OTGHS_HCTSIZ14_PKTCNT    0x000003FFU
#define USB_OTGHS_HCTSIZ14_PKTCNT_M  (USB_OTGHS_HCTSIZ14_PKTCNT_V << USB_OTGHS_HCTSIZ14_PKTCNT_S)
#define USB_OTGHS_HCTSIZ14_PKTCNT_V  0x000003FFU
#define USB_OTGHS_HCTSIZ14_PKTCNT_S  19
/** USB_OTGHS_HCTSIZ14_PID : R/W; bitpos: [30:29]; default: 0;
 *  PID (Pid)
 *
 *  The application programs this field with the type of PID to use for the initial
 *  transaction. The host maintains this field for the rest of the transfer.
 *  - 2'b00: DATA0
 *  - 2'b01: DATA2
 *  - 2'b10: DATA1
 *  - 2'b11: MDATA (non-control)/SETUP (control)
 */
#define USB_OTGHS_HCTSIZ14_PID    0x00000003U
#define USB_OTGHS_HCTSIZ14_PID_M  (USB_OTGHS_HCTSIZ14_PID_V << USB_OTGHS_HCTSIZ14_PID_S)
#define USB_OTGHS_HCTSIZ14_PID_V  0x00000003U
#define USB_OTGHS_HCTSIZ14_PID_S  29
/** USB_OTGHS_HCTSIZ14_DOPNG : R/W; bitpos: [31]; default: 0;
 *  Do Ping (DoPng)
 *
 *  This bit is used only for OUT transfers.
 *  Setting this field to 1 directs the host to do PING protocol.
 *
 *  Note: Do not set this bit for IN transfers. If this bit is set for IN transfers it
 *  disables the channel.
 */
#define USB_OTGHS_HCTSIZ14_DOPNG    (BIT(31))
#define USB_OTGHS_HCTSIZ14_DOPNG_M  (USB_OTGHS_HCTSIZ14_DOPNG_V << USB_OTGHS_HCTSIZ14_DOPNG_S)
#define USB_OTGHS_HCTSIZ14_DOPNG_V  0x00000001U
#define USB_OTGHS_HCTSIZ14_DOPNG_S  31

/** USB_OTGHS_HCDMA14_REG register
 *  This register is used by the OTG host in the internal DMA mode to maintain the
 *  current buffer pointer for IN/OUT transactions. The starting DMA address must be
 *  DWORD-aligned.
 */
#define USB_OTGHS_HCDMA14_REG (DR_REG_USB_OTGHS_BASE + 0x6d4)
/** USB_OTGHS_HCDMA14_DMAADDR : R/W; bitpos: [31:0]; default: 0;
 *  In Buffer DMA Mode:
 *
 *  [31:0]: DMA Address (DMAAddr)
 *
 *  This field holds the start address in the external memory from which the data for
 *  the endpoint must be fetched or to which it must be stored. This register is
 *  incremented on every AHB transaction.
 *
 *  Reset: X if not programmed as the register is in SPRAM.
 *
 *  In Scatter-Gather DMA (DescDMA) Mode for Non-Isochronous:
 *
 *  [31:9]: DMA Address (DMAAddr)
 *
 *  The start address must be 512-bytes aligned.
 *
 *  This field holds the start address of the 512 bytes page. The first descriptor in
 *  the list must be located in this address. The first descriptor may be or may not be
 *  ready. The core starts processing the list from the CTD value.
 *
 *  [8:3]: Current Transfer Desc(CTD)
 *
 *  This value is in terms of number of descriptors. The values can be from 0 to 63.
 *  - 0 -  1 descriptor.
 *  - 63 - 64 descriptors.
 *  This field indicates the current descriptor processed in the list. This field is
 *  updated both by application and the core. For example, if the application enables
 *  the channel after programming CTD=5, then the core starts processing the sixth
 *  descriptor. The address is obtained by adding a value of (8bytes*5=) 40(decimal) to
 *  DMAAddr.
 *
 *  Reset: 6'h0
 *
 *  [2:0]: Reserved
 *
 *  In Scatter-Gather DMA (DescDMA) Mode for Isochronous:
 *
 *  [31:N]: DMA Address (DMAAddr)
 *
 *  The start address must be 512-bytes aligned.
 *
 *  This field holds the address of the 2*(nTD+1) bytes of locations in which the
 *  isochronous descriptors are present where N is based on nTD as follows:
 *  - [31:N]: Base Address
 *  - [N-1:3]: Offset
 *  - [2:0]: 000
 *  For HS ISOC, if nTD is,
 *  - 7, N=6
 *  - 15, N=7
 *  - 31, N=8
 *  - 63, N=9
 *  - 127, N=10
 *  - 255, N=11
 *  For FS ISOC, if nTD is,
 *  - 1, N=4
 *  - 3, N=5
 *  - 7, N=6
 *  - 15, N=7
 *  - 31, N=8
 *  - 63, N=9
 *  [N-1:3]: Current Transfer Desc(CTD)
 *
 *  CTD for isochronous is based on the current frame/(micro)frame value. Need to be
 *  set to zero by application.
 *
 *  Reset: (N+1:3)'h0
 *
 *  [2:0]: Reserved
 */
#define USB_OTGHS_HCDMA14_DMAADDR    0xFFFFFFFFU
#define USB_OTGHS_HCDMA14_DMAADDR_M  (USB_OTGHS_HCDMA14_DMAADDR_V << USB_OTGHS_HCDMA14_DMAADDR_S)
#define USB_OTGHS_HCDMA14_DMAADDR_V  0xFFFFFFFFU
#define USB_OTGHS_HCDMA14_DMAADDR_S  0

/** USB_OTGHS_HCDMAB14_REG register
 *  This register is present only in case of Scatter/Gather DMA. It is implemented in
 *  RAM instead of flop-based implementation. This register holds the current buffer
 *  address.
 */
#define USB_OTGHS_HCDMAB14_REG (DR_REG_USB_OTGHS_BASE + 0x6dc)
/** USB_OTGHS_HCDMAB14_HCDMAB : RO; bitpos: [31:0]; default: 0;
 *  Holds the current buffer address.
 *  This register is updated as and when the data transfer for the corresponding end
 *  point
 *  is in progress. This register is present only in Scatter/Gather DMA mode. Otherwise
 *  this
 *  field is reserved.
 */
#define USB_OTGHS_HCDMAB14_HCDMAB    0xFFFFFFFFU
#define USB_OTGHS_HCDMAB14_HCDMAB_M  (USB_OTGHS_HCDMAB14_HCDMAB_V << USB_OTGHS_HCDMAB14_HCDMAB_S)
#define USB_OTGHS_HCDMAB14_HCDMAB_V  0xFFFFFFFFU
#define USB_OTGHS_HCDMAB14_HCDMAB_S  0

