espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_DIEPMSK_REG register
 *  This register works with each of the Device IN Endpoint Interrupt (DIEPINTn)
 *  registers for all endpoints to generate an interrupt per IN endpoint. The IN
 *  endpoint interrupt for a specific status in the DIEPINTn register can be masked by
 *  writing to the corresponding bit in this register. Status bits are masked by
 *  default.
 */
#define USB_OTGHS_DIEPMSK_REG (DR_REG_USB_OTGHS_BASE + 0x810)
/** USB_OTGHS_DIEPMSK_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DIEPMSK_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DIEPMSK_XFERCOMPLMSK_M  (USB_OTGHS_DIEPMSK_XFERCOMPLMSK_V << USB_OTGHS_DIEPMSK_XFERCOMPLMSK_S)
#define USB_OTGHS_DIEPMSK_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DIEPMSK_XFERCOMPLMSK_S  0
/** USB_OTGHS_DIEPMSK_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DIEPMSK_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DIEPMSK_EPDISBLDMSK_M  (USB_OTGHS_DIEPMSK_EPDISBLDMSK_V << USB_OTGHS_DIEPMSK_EPDISBLDMSK_S)
#define USB_OTGHS_DIEPMSK_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DIEPMSK_EPDISBLDMSK_S  1
/** USB_OTGHS_DIEPMSK_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error Mask (AHBErrMsk)
 */
#define USB_OTGHS_DIEPMSK_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DIEPMSK_AHBERRMSK_M  (USB_OTGHS_DIEPMSK_AHBERRMSK_V << USB_OTGHS_DIEPMSK_AHBERRMSK_S)
#define USB_OTGHS_DIEPMSK_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DIEPMSK_AHBERRMSK_S  2
/** USB_OTGHS_DIEPMSK_TIMEOUTMSK : R/W; bitpos: [3]; default: 0;
 *  Timeout Condition Mask (TimeOUTMsk) (Non-isochronous endpoints)
 */
#define USB_OTGHS_DIEPMSK_TIMEOUTMSK    (BIT(3))
#define USB_OTGHS_DIEPMSK_TIMEOUTMSK_M  (USB_OTGHS_DIEPMSK_TIMEOUTMSK_V << USB_OTGHS_DIEPMSK_TIMEOUTMSK_S)
#define USB_OTGHS_DIEPMSK_TIMEOUTMSK_V  0x00000001U
#define USB_OTGHS_DIEPMSK_TIMEOUTMSK_S  3
/** USB_OTGHS_DIEPMSK_INTKNTXFEMPMSK : R/W; bitpos: [4]; default: 0;
 *  IN Token Received When TxFIFO Empty Mask (INTknTXFEmpMsk)
 */
#define USB_OTGHS_DIEPMSK_INTKNTXFEMPMSK    (BIT(4))
#define USB_OTGHS_DIEPMSK_INTKNTXFEMPMSK_M  (USB_OTGHS_DIEPMSK_INTKNTXFEMPMSK_V << USB_OTGHS_DIEPMSK_INTKNTXFEMPMSK_S)
#define USB_OTGHS_DIEPMSK_INTKNTXFEMPMSK_V  0x00000001U
#define USB_OTGHS_DIEPMSK_INTKNTXFEMPMSK_S  4
/** USB_OTGHS_DIEPMSK_INTKNEPMISMSK : R/W; bitpos: [5]; default: 0;
 *  IN Token received with EP Mismatch Mask (INTknEPMisMsk)
 */
#define USB_OTGHS_DIEPMSK_INTKNEPMISMSK    (BIT(5))
#define USB_OTGHS_DIEPMSK_INTKNEPMISMSK_M  (USB_OTGHS_DIEPMSK_INTKNEPMISMSK_V << USB_OTGHS_DIEPMSK_INTKNEPMISMSK_S)
#define USB_OTGHS_DIEPMSK_INTKNEPMISMSK_V  0x00000001U
#define USB_OTGHS_DIEPMSK_INTKNEPMISMSK_S  5
/** USB_OTGHS_DIEPMSK_INEPNAKEFFMSK : R/W; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective Mask (INEPNakEffMsk)
 */
#define USB_OTGHS_DIEPMSK_INEPNAKEFFMSK    (BIT(6))
#define USB_OTGHS_DIEPMSK_INEPNAKEFFMSK_M  (USB_OTGHS_DIEPMSK_INEPNAKEFFMSK_V << USB_OTGHS_DIEPMSK_INEPNAKEFFMSK_S)
#define USB_OTGHS_DIEPMSK_INEPNAKEFFMSK_V  0x00000001U
#define USB_OTGHS_DIEPMSK_INEPNAKEFFMSK_S  6
/** USB_OTGHS_DIEPMSK_TXFIFOUNDRNMSK : R/W; bitpos: [8]; default: 0;
 *  Fifo Underrun Mask (TxfifoUndrnMsk)
 */
#define USB_OTGHS_DIEPMSK_TXFIFOUNDRNMSK    (BIT(8))
#define USB_OTGHS_DIEPMSK_TXFIFOUNDRNMSK_M  (USB_OTGHS_DIEPMSK_TXFIFOUNDRNMSK_V << USB_OTGHS_DIEPMSK_TXFIFOUNDRNMSK_S)
#define USB_OTGHS_DIEPMSK_TXFIFOUNDRNMSK_V  0x00000001U
#define USB_OTGHS_DIEPMSK_TXFIFOUNDRNMSK_S  8
/** USB_OTGHS_DIEPMSK_BNAININTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BNAInIntrMsk)
 */
#define USB_OTGHS_DIEPMSK_BNAININTRMSK    (BIT(9))
#define USB_OTGHS_DIEPMSK_BNAININTRMSK_M  (USB_OTGHS_DIEPMSK_BNAININTRMSK_V << USB_OTGHS_DIEPMSK_BNAININTRMSK_S)
#define USB_OTGHS_DIEPMSK_BNAININTRMSK_V  0x00000001U
#define USB_OTGHS_DIEPMSK_BNAININTRMSK_S  9
/** USB_OTGHS_DIEPMSK_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DIEPMSK_NAKMSK    (BIT(13))
#define USB_OTGHS_DIEPMSK_NAKMSK_M  (USB_OTGHS_DIEPMSK_NAKMSK_V << USB_OTGHS_DIEPMSK_NAKMSK_S)
#define USB_OTGHS_DIEPMSK_NAKMSK_V  0x00000001U
#define USB_OTGHS_DIEPMSK_NAKMSK_S  13

/** USB_OTGHS_DOEPMSK_REG register
 *  This register works with each of the Device OUT Endpoint Interrupt (DOEPINTn)
 *  registers for all endpoints to generate an interrupt per OUT endpoint. The OUT
 *  endpoint interrupt for a specific status in the DOEPINTn register can be masked by
 *  writing into the corresponding bit in this register. Status bits are masked by
 *  default.
 */
#define USB_OTGHS_DOEPMSK_REG (DR_REG_USB_OTGHS_BASE + 0x814)
/** USB_OTGHS_DOEPMSK_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DOEPMSK_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DOEPMSK_XFERCOMPLMSK_M  (USB_OTGHS_DOEPMSK_XFERCOMPLMSK_V << USB_OTGHS_DOEPMSK_XFERCOMPLMSK_S)
#define USB_OTGHS_DOEPMSK_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DOEPMSK_XFERCOMPLMSK_S  0
/** USB_OTGHS_DOEPMSK_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DOEPMSK_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DOEPMSK_EPDISBLDMSK_M  (USB_OTGHS_DOEPMSK_EPDISBLDMSK_V << USB_OTGHS_DOEPMSK_EPDISBLDMSK_S)
#define USB_OTGHS_DOEPMSK_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DOEPMSK_EPDISBLDMSK_S  1
/** USB_OTGHS_DOEPMSK_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErrMsk)
 */
#define USB_OTGHS_DOEPMSK_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DOEPMSK_AHBERRMSK_M  (USB_OTGHS_DOEPMSK_AHBERRMSK_V << USB_OTGHS_DOEPMSK_AHBERRMSK_S)
#define USB_OTGHS_DOEPMSK_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPMSK_AHBERRMSK_S  2
/** USB_OTGHS_DOEPMSK_SETUPMSK : R/W; bitpos: [3]; default: 0;
 *  SETUP Phase Done Mask (SetUPMsk)
 *
 *  Applies to control endpoints only.
 */
#define USB_OTGHS_DOEPMSK_SETUPMSK    (BIT(3))
#define USB_OTGHS_DOEPMSK_SETUPMSK_M  (USB_OTGHS_DOEPMSK_SETUPMSK_V << USB_OTGHS_DOEPMSK_SETUPMSK_S)
#define USB_OTGHS_DOEPMSK_SETUPMSK_V  0x00000001U
#define USB_OTGHS_DOEPMSK_SETUPMSK_S  3
/** USB_OTGHS_DOEPMSK_OUTTKNEPDISMSK : R/W; bitpos: [4]; default: 0;
 *  OUT Token Received when Endpoint Disabled Mask (OUTTknEPdisMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPMSK_OUTTKNEPDISMSK    (BIT(4))
#define USB_OTGHS_DOEPMSK_OUTTKNEPDISMSK_M  (USB_OTGHS_DOEPMSK_OUTTKNEPDISMSK_V << USB_OTGHS_DOEPMSK_OUTTKNEPDISMSK_S)
#define USB_OTGHS_DOEPMSK_OUTTKNEPDISMSK_V  0x00000001U
#define USB_OTGHS_DOEPMSK_OUTTKNEPDISMSK_S  4
/** USB_OTGHS_DOEPMSK_STSPHSERCVDMSK : R/W; bitpos: [5]; default: 0;
 *  Status Phase Received Mask (StsPhseRcvdMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPMSK_STSPHSERCVDMSK    (BIT(5))
#define USB_OTGHS_DOEPMSK_STSPHSERCVDMSK_M  (USB_OTGHS_DOEPMSK_STSPHSERCVDMSK_V << USB_OTGHS_DOEPMSK_STSPHSERCVDMSK_S)
#define USB_OTGHS_DOEPMSK_STSPHSERCVDMSK_V  0x00000001U
#define USB_OTGHS_DOEPMSK_STSPHSERCVDMSK_S  5
/** USB_OTGHS_DOEPMSK_BACK2BACKSETUP : R/W; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received Mask (Back2BackSETup)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPMSK_BACK2BACKSETUP    (BIT(6))
#define USB_OTGHS_DOEPMSK_BACK2BACKSETUP_M  (USB_OTGHS_DOEPMSK_BACK2BACKSETUP_V << USB_OTGHS_DOEPMSK_BACK2BACKSETUP_S)
#define USB_OTGHS_DOEPMSK_BACK2BACKSETUP_V  0x00000001U
#define USB_OTGHS_DOEPMSK_BACK2BACKSETUP_S  6
/** USB_OTGHS_DOEPMSK_OUTPKTERRMSK : R/W; bitpos: [8]; default: 0;
 *  OUT Packet Error Mask (OutPktErrMsk)
 */
#define USB_OTGHS_DOEPMSK_OUTPKTERRMSK    (BIT(8))
#define USB_OTGHS_DOEPMSK_OUTPKTERRMSK_M  (USB_OTGHS_DOEPMSK_OUTPKTERRMSK_V << USB_OTGHS_DOEPMSK_OUTPKTERRMSK_S)
#define USB_OTGHS_DOEPMSK_OUTPKTERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPMSK_OUTPKTERRMSK_S  8
/** USB_OTGHS_DOEPMSK_BNAOUTINTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BnaOutIntrMsk)
 */
#define USB_OTGHS_DOEPMSK_BNAOUTINTRMSK    (BIT(9))
#define USB_OTGHS_DOEPMSK_BNAOUTINTRMSK_M  (USB_OTGHS_DOEPMSK_BNAOUTINTRMSK_V << USB_OTGHS_DOEPMSK_BNAOUTINTRMSK_S)
#define USB_OTGHS_DOEPMSK_BNAOUTINTRMSK_V  0x00000001U
#define USB_OTGHS_DOEPMSK_BNAOUTINTRMSK_S  9
/** USB_OTGHS_DOEPMSK_BBLEERRMSK : R/W; bitpos: [12]; default: 0;
 *  Babble Error interrupt Mask (BbleErrMsk)
 */
#define USB_OTGHS_DOEPMSK_BBLEERRMSK    (BIT(12))
#define USB_OTGHS_DOEPMSK_BBLEERRMSK_M  (USB_OTGHS_DOEPMSK_BBLEERRMSK_V << USB_OTGHS_DOEPMSK_BBLEERRMSK_S)
#define USB_OTGHS_DOEPMSK_BBLEERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPMSK_BBLEERRMSK_S  12
/** USB_OTGHS_DOEPMSK_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DOEPMSK_NAKMSK    (BIT(13))
#define USB_OTGHS_DOEPMSK_NAKMSK_M  (USB_OTGHS_DOEPMSK_NAKMSK_V << USB_OTGHS_DOEPMSK_NAKMSK_S)
#define USB_OTGHS_DOEPMSK_NAKMSK_V  0x00000001U
#define USB_OTGHS_DOEPMSK_NAKMSK_S  13
/** USB_OTGHS_DOEPMSK_NYETMSK : R/W; bitpos: [14]; default: 0;
 *  NYET interrupt Mask (NYETMsk)
 */
#define USB_OTGHS_DOEPMSK_NYETMSK    (BIT(14))
#define USB_OTGHS_DOEPMSK_NYETMSK_M  (USB_OTGHS_DOEPMSK_NYETMSK_V << USB_OTGHS_DOEPMSK_NYETMSK_S)
#define USB_OTGHS_DOEPMSK_NYETMSK_V  0x00000001U
#define USB_OTGHS_DOEPMSK_NYETMSK_S  14

/** USB_OTGHS_DAINT_REG register
 *  When a significant event occurs on an endpoint, a Device All Endpoints Interrupt
 *  register interrupts the application using the Device OUT Endpoints Interrupt bit or
 *  Device IN Endpoints Interrupt bit of the Core Interrupt register (GINTSTS.OEPInt or
 *  GINTSTS.IEPInt, respectively). This is shown in Figure 5-2. There is one interrupt
 *  bit per endpoint, up to a maximum of 16 bits for OUT endpoints and 16 bits for IN
 *  endpoints. For a bidirectional endpoint, the corresponding IN and OUT interrupt
 *  bits are used. Bits in this register are set and cleared when the application sets
 *  and clears bits in the corresponding Device Endpoint-n Interrupt register
 *  (DIEPINTn/DOEPINTn).
 */
#define USB_OTGHS_DAINT_REG (DR_REG_USB_OTGHS_BASE + 0x818)
/** USB_OTGHS_DAINT_INEPINT0 : RO; bitpos: [0]; default: 0;
 *  IN Endpoint 0 Interrupt Bit
 */
#define USB_OTGHS_DAINT_INEPINT0    (BIT(0))
#define USB_OTGHS_DAINT_INEPINT0_M  (USB_OTGHS_DAINT_INEPINT0_V << USB_OTGHS_DAINT_INEPINT0_S)
#define USB_OTGHS_DAINT_INEPINT0_V  0x00000001U
#define USB_OTGHS_DAINT_INEPINT0_S  0
/** USB_OTGHS_DAINT_INEPINT1 : RO; bitpos: [1]; default: 0;
 *  IN Endpoint 1 Interrupt Bit
 */
#define USB_OTGHS_DAINT_INEPINT1    (BIT(1))
#define USB_OTGHS_DAINT_INEPINT1_M  (USB_OTGHS_DAINT_INEPINT1_V << USB_OTGHS_DAINT_INEPINT1_S)
#define USB_OTGHS_DAINT_INEPINT1_V  0x00000001U
#define USB_OTGHS_DAINT_INEPINT1_S  1
/** USB_OTGHS_DAINT_INEPINT2 : RO; bitpos: [2]; default: 0;
 *  IN Endpoint 2 Interrupt Bit
 */
#define USB_OTGHS_DAINT_INEPINT2    (BIT(2))
#define USB_OTGHS_DAINT_INEPINT2_M  (USB_OTGHS_DAINT_INEPINT2_V << USB_OTGHS_DAINT_INEPINT2_S)
#define USB_OTGHS_DAINT_INEPINT2_V  0x00000001U
#define USB_OTGHS_DAINT_INEPINT2_S  2
/** USB_OTGHS_DAINT_INEPINT3 : RO; bitpos: [3]; default: 0;
 *  IN Endpoint 3 Interrupt Bit
 */
#define USB_OTGHS_DAINT_INEPINT3    (BIT(3))
#define USB_OTGHS_DAINT_INEPINT3_M  (USB_OTGHS_DAINT_INEPINT3_V << USB_OTGHS_DAINT_INEPINT3_S)
#define USB_OTGHS_DAINT_INEPINT3_V  0x00000001U
#define USB_OTGHS_DAINT_INEPINT3_S  3
/** USB_OTGHS_DAINT_INEPINT4 : RO; bitpos: [4]; default: 0;
 *  IN Endpoint 4 Interrupt Bit
 */
#define USB_OTGHS_DAINT_INEPINT4    (BIT(4))
#define USB_OTGHS_DAINT_INEPINT4_M  (USB_OTGHS_DAINT_INEPINT4_V << USB_OTGHS_DAINT_INEPINT4_S)
#define USB_OTGHS_DAINT_INEPINT4_V  0x00000001U
#define USB_OTGHS_DAINT_INEPINT4_S  4
/** USB_OTGHS_DAINT_INEPINT5 : RO; bitpos: [5]; default: 0;
 *  IN Endpoint 5 Interrupt Bit
 */
#define USB_OTGHS_DAINT_INEPINT5    (BIT(5))
#define USB_OTGHS_DAINT_INEPINT5_M  (USB_OTGHS_DAINT_INEPINT5_V << USB_OTGHS_DAINT_INEPINT5_S)
#define USB_OTGHS_DAINT_INEPINT5_V  0x00000001U
#define USB_OTGHS_DAINT_INEPINT5_S  5
/** USB_OTGHS_DAINT_INEPINT6 : RO; bitpos: [6]; default: 0;
 *  IN Endpoint 6 Interrupt Bit
 */
#define USB_OTGHS_DAINT_INEPINT6    (BIT(6))
#define USB_OTGHS_DAINT_INEPINT6_M  (USB_OTGHS_DAINT_INEPINT6_V << USB_OTGHS_DAINT_INEPINT6_S)
#define USB_OTGHS_DAINT_INEPINT6_V  0x00000001U
#define USB_OTGHS_DAINT_INEPINT6_S  6
/** USB_OTGHS_DAINT_INEPINT7 : RO; bitpos: [7]; default: 0;
 *  IN Endpoint 7 Interrupt Bit
 */
#define USB_OTGHS_DAINT_INEPINT7    (BIT(7))
#define USB_OTGHS_DAINT_INEPINT7_M  (USB_OTGHS_DAINT_INEPINT7_V << USB_OTGHS_DAINT_INEPINT7_S)
#define USB_OTGHS_DAINT_INEPINT7_V  0x00000001U
#define USB_OTGHS_DAINT_INEPINT7_S  7
/** USB_OTGHS_DAINT_INEPINT8 : RO; bitpos: [8]; default: 0;
 *  IN Endpoint 8 Interrupt Bit
 */
#define USB_OTGHS_DAINT_INEPINT8    (BIT(8))
#define USB_OTGHS_DAINT_INEPINT8_M  (USB_OTGHS_DAINT_INEPINT8_V << USB_OTGHS_DAINT_INEPINT8_S)
#define USB_OTGHS_DAINT_INEPINT8_V  0x00000001U
#define USB_OTGHS_DAINT_INEPINT8_S  8
/** USB_OTGHS_DAINT_INEPINT9 : RO; bitpos: [9]; default: 0;
 *  IN Endpoint 9 Interrupt Bit
 */
#define USB_OTGHS_DAINT_INEPINT9    (BIT(9))
#define USB_OTGHS_DAINT_INEPINT9_M  (USB_OTGHS_DAINT_INEPINT9_V << USB_OTGHS_DAINT_INEPINT9_S)
#define USB_OTGHS_DAINT_INEPINT9_V  0x00000001U
#define USB_OTGHS_DAINT_INEPINT9_S  9
/** USB_OTGHS_DAINT_INEPINT10 : RO; bitpos: [10]; default: 0;
 *  IN Endpoint 10 Interrupt Bit
 */
#define USB_OTGHS_DAINT_INEPINT10    (BIT(10))
#define USB_OTGHS_DAINT_INEPINT10_M  (USB_OTGHS_DAINT_INEPINT10_V << USB_OTGHS_DAINT_INEPINT10_S)
#define USB_OTGHS_DAINT_INEPINT10_V  0x00000001U
#define USB_OTGHS_DAINT_INEPINT10_S  10
/** USB_OTGHS_DAINT_INEPINT11 : RO; bitpos: [11]; default: 0;
 *  IN Endpoint 11 Interrupt Bit
 */
#define USB_OTGHS_DAINT_INEPINT11    (BIT(11))
#define USB_OTGHS_DAINT_INEPINT11_M  (USB_OTGHS_DAINT_INEPINT11_V << USB_OTGHS_DAINT_INEPINT11_S)
#define USB_OTGHS_DAINT_INEPINT11_V  0x00000001U
#define USB_OTGHS_DAINT_INEPINT11_S  11
/** USB_OTGHS_DAINT_INEPINT12 : RO; bitpos: [12]; default: 0;
 *  IN Endpoint 12 Interrupt Bit
 */
#define USB_OTGHS_DAINT_INEPINT12    (BIT(12))
#define USB_OTGHS_DAINT_INEPINT12_M  (USB_OTGHS_DAINT_INEPINT12_V << USB_OTGHS_DAINT_INEPINT12_S)
#define USB_OTGHS_DAINT_INEPINT12_V  0x00000001U
#define USB_OTGHS_DAINT_INEPINT12_S  12
/** USB_OTGHS_DAINT_INEPINT13 : RO; bitpos: [13]; default: 0;
 *  IN Endpoint 13 Interrupt Bit
 */
#define USB_OTGHS_DAINT_INEPINT13    (BIT(13))
#define USB_OTGHS_DAINT_INEPINT13_M  (USB_OTGHS_DAINT_INEPINT13_V << USB_OTGHS_DAINT_INEPINT13_S)
#define USB_OTGHS_DAINT_INEPINT13_V  0x00000001U
#define USB_OTGHS_DAINT_INEPINT13_S  13
/** USB_OTGHS_DAINT_INEPINT14 : RO; bitpos: [14]; default: 0;
 *  IN Endpoint 14 Interrupt Bit
 */
#define USB_OTGHS_DAINT_INEPINT14    (BIT(14))
#define USB_OTGHS_DAINT_INEPINT14_M  (USB_OTGHS_DAINT_INEPINT14_V << USB_OTGHS_DAINT_INEPINT14_S)
#define USB_OTGHS_DAINT_INEPINT14_V  0x00000001U
#define USB_OTGHS_DAINT_INEPINT14_S  14
/** USB_OTGHS_DAINT_INEPINT15 : RO; bitpos: [15]; default: 0;
 *  IN Endpoint 15 Interrupt Bit
 */
#define USB_OTGHS_DAINT_INEPINT15    (BIT(15))
#define USB_OTGHS_DAINT_INEPINT15_M  (USB_OTGHS_DAINT_INEPINT15_V << USB_OTGHS_DAINT_INEPINT15_S)
#define USB_OTGHS_DAINT_INEPINT15_V  0x00000001U
#define USB_OTGHS_DAINT_INEPINT15_S  15
/** USB_OTGHS_DAINT_OUTEPINT0 : RO; bitpos: [16]; default: 0;
 *  OUT Endpoint 0 Interrupt Bit
 */
#define USB_OTGHS_DAINT_OUTEPINT0    (BIT(16))
#define USB_OTGHS_DAINT_OUTEPINT0_M  (USB_OTGHS_DAINT_OUTEPINT0_V << USB_OTGHS_DAINT_OUTEPINT0_S)
#define USB_OTGHS_DAINT_OUTEPINT0_V  0x00000001U
#define USB_OTGHS_DAINT_OUTEPINT0_S  16
/** USB_OTGHS_DAINT_OUTEPINT1 : RO; bitpos: [17]; default: 0;
 *  OUT Endpoint 1 Interrupt Bit
 */
#define USB_OTGHS_DAINT_OUTEPINT1    (BIT(17))
#define USB_OTGHS_DAINT_OUTEPINT1_M  (USB_OTGHS_DAINT_OUTEPINT1_V << USB_OTGHS_DAINT_OUTEPINT1_S)
#define USB_OTGHS_DAINT_OUTEPINT1_V  0x00000001U
#define USB_OTGHS_DAINT_OUTEPINT1_S  17
/** USB_OTGHS_DAINT_OUTEPINT2 : RO; bitpos: [18]; default: 0;
 *  OUT Endpoint 2 Interrupt Bit
 */
#define USB_OTGHS_DAINT_OUTEPINT2    (BIT(18))
#define USB_OTGHS_DAINT_OUTEPINT2_M  (USB_OTGHS_DAINT_OUTEPINT2_V << USB_OTGHS_DAINT_OUTEPINT2_S)
#define USB_OTGHS_DAINT_OUTEPINT2_V  0x00000001U
#define USB_OTGHS_DAINT_OUTEPINT2_S  18
/** USB_OTGHS_DAINT_OUTEPINT3 : RO; bitpos: [19]; default: 0;
 *  OUT Endpoint 3 Interrupt Bit
 */
#define USB_OTGHS_DAINT_OUTEPINT3    (BIT(19))
#define USB_OTGHS_DAINT_OUTEPINT3_M  (USB_OTGHS_DAINT_OUTEPINT3_V << USB_OTGHS_DAINT_OUTEPINT3_S)
#define USB_OTGHS_DAINT_OUTEPINT3_V  0x00000001U
#define USB_OTGHS_DAINT_OUTEPINT3_S  19
/** USB_OTGHS_DAINT_OUTEPINT4 : RO; bitpos: [20]; default: 0;
 *  OUT Endpoint 4 Interrupt Bit
 */
#define USB_OTGHS_DAINT_OUTEPINT4    (BIT(20))
#define USB_OTGHS_DAINT_OUTEPINT4_M  (USB_OTGHS_DAINT_OUTEPINT4_V << USB_OTGHS_DAINT_OUTEPINT4_S)
#define USB_OTGHS_DAINT_OUTEPINT4_V  0x00000001U
#define USB_OTGHS_DAINT_OUTEPINT4_S  20
/** USB_OTGHS_DAINT_OUTEPINT5 : RO; bitpos: [21]; default: 0;
 *  OUT Endpoint 5 Interrupt Bit
 */
#define USB_OTGHS_DAINT_OUTEPINT5    (BIT(21))
#define USB_OTGHS_DAINT_OUTEPINT5_M  (USB_OTGHS_DAINT_OUTEPINT5_V << USB_OTGHS_DAINT_OUTEPINT5_S)
#define USB_OTGHS_DAINT_OUTEPINT5_V  0x00000001U
#define USB_OTGHS_DAINT_OUTEPINT5_S  21
/** USB_OTGHS_DAINT_OUTEPINT6 : RO; bitpos: [22]; default: 0;
 *  OUT Endpoint 6 Interrupt Bit
 */
#define USB_OTGHS_DAINT_OUTEPINT6    (BIT(22))
#define USB_OTGHS_DAINT_OUTEPINT6_M  (USB_OTGHS_DAINT_OUTEPINT6_V << USB_OTGHS_DAINT_OUTEPINT6_S)
#define USB_OTGHS_DAINT_OUTEPINT6_V  0x00000001U
#define USB_OTGHS_DAINT_OUTEPINT6_S  22
/** USB_OTGHS_DAINT_OUTEPINT7 : RO; bitpos: [23]; default: 0;
 *  OUT Endpoint 7 Interrupt Bit
 */
#define USB_OTGHS_DAINT_OUTEPINT7    (BIT(23))
#define USB_OTGHS_DAINT_OUTEPINT7_M  (USB_OTGHS_DAINT_OUTEPINT7_V << USB_OTGHS_DAINT_OUTEPINT7_S)
#define USB_OTGHS_DAINT_OUTEPINT7_V  0x00000001U
#define USB_OTGHS_DAINT_OUTEPINT7_S  23
/** USB_OTGHS_DAINT_OUTEPINT8 : RO; bitpos: [24]; default: 0;
 *  OUT Endpoint 8 Interrupt Bit
 */
#define USB_OTGHS_DAINT_OUTEPINT8    (BIT(24))
#define USB_OTGHS_DAINT_OUTEPINT8_M  (USB_OTGHS_DAINT_OUTEPINT8_V << USB_OTGHS_DAINT_OUTEPINT8_S)
#define USB_OTGHS_DAINT_OUTEPINT8_V  0x00000001U
#define USB_OTGHS_DAINT_OUTEPINT8_S  24
/** USB_OTGHS_DAINT_OUTEPINT9 : RO; bitpos: [25]; default: 0;
 *  OUT Endpoint 9 Interrupt Bit
 */
#define USB_OTGHS_DAINT_OUTEPINT9    (BIT(25))
#define USB_OTGHS_DAINT_OUTEPINT9_M  (USB_OTGHS_DAINT_OUTEPINT9_V << USB_OTGHS_DAINT_OUTEPINT9_S)
#define USB_OTGHS_DAINT_OUTEPINT9_V  0x00000001U
#define USB_OTGHS_DAINT_OUTEPINT9_S  25
/** USB_OTGHS_DAINT_OUTEPINT10 : RO; bitpos: [26]; default: 0;
 *  OUT Endpoint 10 Interrupt Bit
 */
#define USB_OTGHS_DAINT_OUTEPINT10    (BIT(26))
#define USB_OTGHS_DAINT_OUTEPINT10_M  (USB_OTGHS_DAINT_OUTEPINT10_V << USB_OTGHS_DAINT_OUTEPINT10_S)
#define USB_OTGHS_DAINT_OUTEPINT10_V  0x00000001U
#define USB_OTGHS_DAINT_OUTEPINT10_S  26
/** USB_OTGHS_DAINT_OUTEPINT11 : RO; bitpos: [27]; default: 0;
 *  OUT Endpoint 11 Interrupt Bit
 */
#define USB_OTGHS_DAINT_OUTEPINT11    (BIT(27))
#define USB_OTGHS_DAINT_OUTEPINT11_M  (USB_OTGHS_DAINT_OUTEPINT11_V << USB_OTGHS_DAINT_OUTEPINT11_S)
#define USB_OTGHS_DAINT_OUTEPINT11_V  0x00000001U
#define USB_OTGHS_DAINT_OUTEPINT11_S  27
/** USB_OTGHS_DAINT_OUTEPINT12 : RO; bitpos: [28]; default: 0;
 *  OUT Endpoint 12 Interrupt Bit
 */
#define USB_OTGHS_DAINT_OUTEPINT12    (BIT(28))
#define USB_OTGHS_DAINT_OUTEPINT12_M  (USB_OTGHS_DAINT_OUTEPINT12_V << USB_OTGHS_DAINT_OUTEPINT12_S)
#define USB_OTGHS_DAINT_OUTEPINT12_V  0x00000001U
#define USB_OTGHS_DAINT_OUTEPINT12_S  28
/** USB_OTGHS_DAINT_OUTEPINT13 : RO; bitpos: [29]; default: 0;
 *  OUT Endpoint 13 Interrupt Bit
 */
#define USB_OTGHS_DAINT_OUTEPINT13    (BIT(29))
#define USB_OTGHS_DAINT_OUTEPINT13_M  (USB_OTGHS_DAINT_OUTEPINT13_V << USB_OTGHS_DAINT_OUTEPINT13_S)
#define USB_OTGHS_DAINT_OUTEPINT13_V  0x00000001U
#define USB_OTGHS_DAINT_OUTEPINT13_S  29
/** USB_OTGHS_DAINT_OUTEPINT14 : RO; bitpos: [30]; default: 0;
 *  OUT Endpoint 14 Interrupt Bit
 */
#define USB_OTGHS_DAINT_OUTEPINT14    (BIT(30))
#define USB_OTGHS_DAINT_OUTEPINT14_M  (USB_OTGHS_DAINT_OUTEPINT14_V << USB_OTGHS_DAINT_OUTEPINT14_S)
#define USB_OTGHS_DAINT_OUTEPINT14_V  0x00000001U
#define USB_OTGHS_DAINT_OUTEPINT14_S  30
/** USB_OTGHS_DAINT_OUTEPINT15 : RO; bitpos: [31]; default: 0;
 *  OUT Endpoint 15 Interrupt Bit
 */
#define USB_OTGHS_DAINT_OUTEPINT15    (BIT(31))
#define USB_OTGHS_DAINT_OUTEPINT15_M  (USB_OTGHS_DAINT_OUTEPINT15_V << USB_OTGHS_DAINT_OUTEPINT15_S)
#define USB_OTGHS_DAINT_OUTEPINT15_V  0x00000001U
#define USB_OTGHS_DAINT_OUTEPINT15_S  31

