espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_DAINTMSK_REG register
 *  The Device Endpoint Interrupt Mask register works with the Device Endpoint
 *  Interrupt register to interrupt the application when an event occurs on a device
 *  endpoint. However, the Device All Endpoints Interrupt (DAINT) register bit
 *  corresponding to that interrupt is still set.
 */
#define USB_OTGHS_DAINTMSK_REG (DR_REG_USB_OTGHS_BASE + 0x81c)
/** USB_OTGHS_DAINTMSK_INEPMSK0 : R/W; bitpos: [0]; default: 0;
 *  IN Endpoint 0 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_INEPMSK0    (BIT(0))
#define USB_OTGHS_DAINTMSK_INEPMSK0_M  (USB_OTGHS_DAINTMSK_INEPMSK0_V << USB_OTGHS_DAINTMSK_INEPMSK0_S)
#define USB_OTGHS_DAINTMSK_INEPMSK0_V  0x00000001U
#define USB_OTGHS_DAINTMSK_INEPMSK0_S  0
/** USB_OTGHS_DAINTMSK_INEPMSK1 : R/W; bitpos: [1]; default: 0;
 *  IN Endpoint 1 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_INEPMSK1    (BIT(1))
#define USB_OTGHS_DAINTMSK_INEPMSK1_M  (USB_OTGHS_DAINTMSK_INEPMSK1_V << USB_OTGHS_DAINTMSK_INEPMSK1_S)
#define USB_OTGHS_DAINTMSK_INEPMSK1_V  0x00000001U
#define USB_OTGHS_DAINTMSK_INEPMSK1_S  1
/** USB_OTGHS_DAINTMSK_INEPMSK2 : R/W; bitpos: [2]; default: 0;
 *  IN Endpoint 2 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_INEPMSK2    (BIT(2))
#define USB_OTGHS_DAINTMSK_INEPMSK2_M  (USB_OTGHS_DAINTMSK_INEPMSK2_V << USB_OTGHS_DAINTMSK_INEPMSK2_S)
#define USB_OTGHS_DAINTMSK_INEPMSK2_V  0x00000001U
#define USB_OTGHS_DAINTMSK_INEPMSK2_S  2
/** USB_OTGHS_DAINTMSK_INEPMSK3 : R/W; bitpos: [3]; default: 0;
 *  IN Endpoint 3 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_INEPMSK3    (BIT(3))
#define USB_OTGHS_DAINTMSK_INEPMSK3_M  (USB_OTGHS_DAINTMSK_INEPMSK3_V << USB_OTGHS_DAINTMSK_INEPMSK3_S)
#define USB_OTGHS_DAINTMSK_INEPMSK3_V  0x00000001U
#define USB_OTGHS_DAINTMSK_INEPMSK3_S  3
/** USB_OTGHS_DAINTMSK_INEPMSK4 : R/W; bitpos: [4]; default: 0;
 *  IN Endpoint 4 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_INEPMSK4    (BIT(4))
#define USB_OTGHS_DAINTMSK_INEPMSK4_M  (USB_OTGHS_DAINTMSK_INEPMSK4_V << USB_OTGHS_DAINTMSK_INEPMSK4_S)
#define USB_OTGHS_DAINTMSK_INEPMSK4_V  0x00000001U
#define USB_OTGHS_DAINTMSK_INEPMSK4_S  4
/** USB_OTGHS_DAINTMSK_INEPMSK5 : R/W; bitpos: [5]; default: 0;
 *  IN Endpoint 5 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_INEPMSK5    (BIT(5))
#define USB_OTGHS_DAINTMSK_INEPMSK5_M  (USB_OTGHS_DAINTMSK_INEPMSK5_V << USB_OTGHS_DAINTMSK_INEPMSK5_S)
#define USB_OTGHS_DAINTMSK_INEPMSK5_V  0x00000001U
#define USB_OTGHS_DAINTMSK_INEPMSK5_S  5
/** USB_OTGHS_DAINTMSK_INEPMSK6 : R/W; bitpos: [6]; default: 0;
 *  IN Endpoint 6 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_INEPMSK6    (BIT(6))
#define USB_OTGHS_DAINTMSK_INEPMSK6_M  (USB_OTGHS_DAINTMSK_INEPMSK6_V << USB_OTGHS_DAINTMSK_INEPMSK6_S)
#define USB_OTGHS_DAINTMSK_INEPMSK6_V  0x00000001U
#define USB_OTGHS_DAINTMSK_INEPMSK6_S  6
/** USB_OTGHS_DAINTMSK_INEPMSK7 : R/W; bitpos: [7]; default: 0;
 *  IN Endpoint 7 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_INEPMSK7    (BIT(7))
#define USB_OTGHS_DAINTMSK_INEPMSK7_M  (USB_OTGHS_DAINTMSK_INEPMSK7_V << USB_OTGHS_DAINTMSK_INEPMSK7_S)
#define USB_OTGHS_DAINTMSK_INEPMSK7_V  0x00000001U
#define USB_OTGHS_DAINTMSK_INEPMSK7_S  7
/** USB_OTGHS_DAINTMSK_INEPMSK8 : R/W; bitpos: [8]; default: 0;
 *  IN Endpoint 8 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_INEPMSK8    (BIT(8))
#define USB_OTGHS_DAINTMSK_INEPMSK8_M  (USB_OTGHS_DAINTMSK_INEPMSK8_V << USB_OTGHS_DAINTMSK_INEPMSK8_S)
#define USB_OTGHS_DAINTMSK_INEPMSK8_V  0x00000001U
#define USB_OTGHS_DAINTMSK_INEPMSK8_S  8
/** USB_OTGHS_DAINTMSK_INEPMSK9 : R/W; bitpos: [9]; default: 0;
 *  IN Endpoint 9 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_INEPMSK9    (BIT(9))
#define USB_OTGHS_DAINTMSK_INEPMSK9_M  (USB_OTGHS_DAINTMSK_INEPMSK9_V << USB_OTGHS_DAINTMSK_INEPMSK9_S)
#define USB_OTGHS_DAINTMSK_INEPMSK9_V  0x00000001U
#define USB_OTGHS_DAINTMSK_INEPMSK9_S  9
/** USB_OTGHS_DAINTMSK_INEPMSK10 : R/W; bitpos: [10]; default: 0;
 *  IN Endpoint 10 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_INEPMSK10    (BIT(10))
#define USB_OTGHS_DAINTMSK_INEPMSK10_M  (USB_OTGHS_DAINTMSK_INEPMSK10_V << USB_OTGHS_DAINTMSK_INEPMSK10_S)
#define USB_OTGHS_DAINTMSK_INEPMSK10_V  0x00000001U
#define USB_OTGHS_DAINTMSK_INEPMSK10_S  10
/** USB_OTGHS_DAINTMSK_INEPMSK11 : R/W; bitpos: [11]; default: 0;
 *  IN Endpoint 11 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_INEPMSK11    (BIT(11))
#define USB_OTGHS_DAINTMSK_INEPMSK11_M  (USB_OTGHS_DAINTMSK_INEPMSK11_V << USB_OTGHS_DAINTMSK_INEPMSK11_S)
#define USB_OTGHS_DAINTMSK_INEPMSK11_V  0x00000001U
#define USB_OTGHS_DAINTMSK_INEPMSK11_S  11
/** USB_OTGHS_DAINTMSK_INEPMSK12 : R/W; bitpos: [12]; default: 0;
 *  IN Endpoint 12 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_INEPMSK12    (BIT(12))
#define USB_OTGHS_DAINTMSK_INEPMSK12_M  (USB_OTGHS_DAINTMSK_INEPMSK12_V << USB_OTGHS_DAINTMSK_INEPMSK12_S)
#define USB_OTGHS_DAINTMSK_INEPMSK12_V  0x00000001U
#define USB_OTGHS_DAINTMSK_INEPMSK12_S  12
/** USB_OTGHS_DAINTMSK_INEPMSK13 : R/W; bitpos: [13]; default: 0;
 *  IN Endpoint 13 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_INEPMSK13    (BIT(13))
#define USB_OTGHS_DAINTMSK_INEPMSK13_M  (USB_OTGHS_DAINTMSK_INEPMSK13_V << USB_OTGHS_DAINTMSK_INEPMSK13_S)
#define USB_OTGHS_DAINTMSK_INEPMSK13_V  0x00000001U
#define USB_OTGHS_DAINTMSK_INEPMSK13_S  13
/** USB_OTGHS_DAINTMSK_INEPMSK14 : R/W; bitpos: [14]; default: 0;
 *  IN Endpoint 14 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_INEPMSK14    (BIT(14))
#define USB_OTGHS_DAINTMSK_INEPMSK14_M  (USB_OTGHS_DAINTMSK_INEPMSK14_V << USB_OTGHS_DAINTMSK_INEPMSK14_S)
#define USB_OTGHS_DAINTMSK_INEPMSK14_V  0x00000001U
#define USB_OTGHS_DAINTMSK_INEPMSK14_S  14
/** USB_OTGHS_DAINTMSK_INEPMSK15 : R/W; bitpos: [15]; default: 0;
 *  IN Endpoint 15 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_INEPMSK15    (BIT(15))
#define USB_OTGHS_DAINTMSK_INEPMSK15_M  (USB_OTGHS_DAINTMSK_INEPMSK15_V << USB_OTGHS_DAINTMSK_INEPMSK15_S)
#define USB_OTGHS_DAINTMSK_INEPMSK15_V  0x00000001U
#define USB_OTGHS_DAINTMSK_INEPMSK15_S  15
/** USB_OTGHS_DAINTMSK_OUTEPMSK0 : R/W; bitpos: [16]; default: 0;
 *  OUT Endpoint 0 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_OUTEPMSK0    (BIT(16))
#define USB_OTGHS_DAINTMSK_OUTEPMSK0_M  (USB_OTGHS_DAINTMSK_OUTEPMSK0_V << USB_OTGHS_DAINTMSK_OUTEPMSK0_S)
#define USB_OTGHS_DAINTMSK_OUTEPMSK0_V  0x00000001U
#define USB_OTGHS_DAINTMSK_OUTEPMSK0_S  16
/** USB_OTGHS_DAINTMSK_OUTEPMSK1 : R/W; bitpos: [17]; default: 0;
 *  OUT Endpoint 1 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_OUTEPMSK1    (BIT(17))
#define USB_OTGHS_DAINTMSK_OUTEPMSK1_M  (USB_OTGHS_DAINTMSK_OUTEPMSK1_V << USB_OTGHS_DAINTMSK_OUTEPMSK1_S)
#define USB_OTGHS_DAINTMSK_OUTEPMSK1_V  0x00000001U
#define USB_OTGHS_DAINTMSK_OUTEPMSK1_S  17
/** USB_OTGHS_DAINTMSK_OUTEPMSK2 : R/W; bitpos: [18]; default: 0;
 *  OUT Endpoint 2 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_OUTEPMSK2    (BIT(18))
#define USB_OTGHS_DAINTMSK_OUTEPMSK2_M  (USB_OTGHS_DAINTMSK_OUTEPMSK2_V << USB_OTGHS_DAINTMSK_OUTEPMSK2_S)
#define USB_OTGHS_DAINTMSK_OUTEPMSK2_V  0x00000001U
#define USB_OTGHS_DAINTMSK_OUTEPMSK2_S  18
/** USB_OTGHS_DAINTMSK_OUTEPMSK3 : R/W; bitpos: [19]; default: 0;
 *  OUT Endpoint 3 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_OUTEPMSK3    (BIT(19))
#define USB_OTGHS_DAINTMSK_OUTEPMSK3_M  (USB_OTGHS_DAINTMSK_OUTEPMSK3_V << USB_OTGHS_DAINTMSK_OUTEPMSK3_S)
#define USB_OTGHS_DAINTMSK_OUTEPMSK3_V  0x00000001U
#define USB_OTGHS_DAINTMSK_OUTEPMSK3_S  19
/** USB_OTGHS_DAINTMSK_OUTEPMSK4 : R/W; bitpos: [20]; default: 0;
 *  OUT Endpoint 4 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_OUTEPMSK4    (BIT(20))
#define USB_OTGHS_DAINTMSK_OUTEPMSK4_M  (USB_OTGHS_DAINTMSK_OUTEPMSK4_V << USB_OTGHS_DAINTMSK_OUTEPMSK4_S)
#define USB_OTGHS_DAINTMSK_OUTEPMSK4_V  0x00000001U
#define USB_OTGHS_DAINTMSK_OUTEPMSK4_S  20
/** USB_OTGHS_DAINTMSK_OUTEPMSK5 : R/W; bitpos: [21]; default: 0;
 *  OUT Endpoint 5 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_OUTEPMSK5    (BIT(21))
#define USB_OTGHS_DAINTMSK_OUTEPMSK5_M  (USB_OTGHS_DAINTMSK_OUTEPMSK5_V << USB_OTGHS_DAINTMSK_OUTEPMSK5_S)
#define USB_OTGHS_DAINTMSK_OUTEPMSK5_V  0x00000001U
#define USB_OTGHS_DAINTMSK_OUTEPMSK5_S  21
/** USB_OTGHS_DAINTMSK_OUTEPMSK6 : R/W; bitpos: [22]; default: 0;
 *  OUT Endpoint 6 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_OUTEPMSK6    (BIT(22))
#define USB_OTGHS_DAINTMSK_OUTEPMSK6_M  (USB_OTGHS_DAINTMSK_OUTEPMSK6_V << USB_OTGHS_DAINTMSK_OUTEPMSK6_S)
#define USB_OTGHS_DAINTMSK_OUTEPMSK6_V  0x00000001U
#define USB_OTGHS_DAINTMSK_OUTEPMSK6_S  22
/** USB_OTGHS_DAINTMSK_OUTEPMSK7 : R/W; bitpos: [23]; default: 0;
 *  OUT Endpoint 7 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_OUTEPMSK7    (BIT(23))
#define USB_OTGHS_DAINTMSK_OUTEPMSK7_M  (USB_OTGHS_DAINTMSK_OUTEPMSK7_V << USB_OTGHS_DAINTMSK_OUTEPMSK7_S)
#define USB_OTGHS_DAINTMSK_OUTEPMSK7_V  0x00000001U
#define USB_OTGHS_DAINTMSK_OUTEPMSK7_S  23
/** USB_OTGHS_DAINTMSK_OUTEPMSK8 : R/W; bitpos: [24]; default: 0;
 *  OUT Endpoint 8 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_OUTEPMSK8    (BIT(24))
#define USB_OTGHS_DAINTMSK_OUTEPMSK8_M  (USB_OTGHS_DAINTMSK_OUTEPMSK8_V << USB_OTGHS_DAINTMSK_OUTEPMSK8_S)
#define USB_OTGHS_DAINTMSK_OUTEPMSK8_V  0x00000001U
#define USB_OTGHS_DAINTMSK_OUTEPMSK8_S  24
/** USB_OTGHS_DAINTMSK_OUTEPMSK9 : R/W; bitpos: [25]; default: 0;
 *  OUT Endpoint 9 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_OUTEPMSK9    (BIT(25))
#define USB_OTGHS_DAINTMSK_OUTEPMSK9_M  (USB_OTGHS_DAINTMSK_OUTEPMSK9_V << USB_OTGHS_DAINTMSK_OUTEPMSK9_S)
#define USB_OTGHS_DAINTMSK_OUTEPMSK9_V  0x00000001U
#define USB_OTGHS_DAINTMSK_OUTEPMSK9_S  25
/** USB_OTGHS_DAINTMSK_OUTEPMSK10 : R/W; bitpos: [26]; default: 0;
 *  OUT Endpoint 10 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_OUTEPMSK10    (BIT(26))
#define USB_OTGHS_DAINTMSK_OUTEPMSK10_M  (USB_OTGHS_DAINTMSK_OUTEPMSK10_V << USB_OTGHS_DAINTMSK_OUTEPMSK10_S)
#define USB_OTGHS_DAINTMSK_OUTEPMSK10_V  0x00000001U
#define USB_OTGHS_DAINTMSK_OUTEPMSK10_S  26
/** USB_OTGHS_DAINTMSK_OUTEPMSK11 : R/W; bitpos: [27]; default: 0;
 *  OUT Endpoint 11 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_OUTEPMSK11    (BIT(27))
#define USB_OTGHS_DAINTMSK_OUTEPMSK11_M  (USB_OTGHS_DAINTMSK_OUTEPMSK11_V << USB_OTGHS_DAINTMSK_OUTEPMSK11_S)
#define USB_OTGHS_DAINTMSK_OUTEPMSK11_V  0x00000001U
#define USB_OTGHS_DAINTMSK_OUTEPMSK11_S  27
/** USB_OTGHS_DAINTMSK_OUTEPMSK12 : R/W; bitpos: [28]; default: 0;
 *  OUT Endpoint 12 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_OUTEPMSK12    (BIT(28))
#define USB_OTGHS_DAINTMSK_OUTEPMSK12_M  (USB_OTGHS_DAINTMSK_OUTEPMSK12_V << USB_OTGHS_DAINTMSK_OUTEPMSK12_S)
#define USB_OTGHS_DAINTMSK_OUTEPMSK12_V  0x00000001U
#define USB_OTGHS_DAINTMSK_OUTEPMSK12_S  28
/** USB_OTGHS_DAINTMSK_OUTEPMSK13 : R/W; bitpos: [29]; default: 0;
 *  OUT Endpoint 13 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_OUTEPMSK13    (BIT(29))
#define USB_OTGHS_DAINTMSK_OUTEPMSK13_M  (USB_OTGHS_DAINTMSK_OUTEPMSK13_V << USB_OTGHS_DAINTMSK_OUTEPMSK13_S)
#define USB_OTGHS_DAINTMSK_OUTEPMSK13_V  0x00000001U
#define USB_OTGHS_DAINTMSK_OUTEPMSK13_S  29
/** USB_OTGHS_DAINTMSK_OUTEPMSK14 : R/W; bitpos: [30]; default: 0;
 *  OUT Endpoint 14 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_OUTEPMSK14    (BIT(30))
#define USB_OTGHS_DAINTMSK_OUTEPMSK14_M  (USB_OTGHS_DAINTMSK_OUTEPMSK14_V << USB_OTGHS_DAINTMSK_OUTEPMSK14_S)
#define USB_OTGHS_DAINTMSK_OUTEPMSK14_V  0x00000001U
#define USB_OTGHS_DAINTMSK_OUTEPMSK14_S  30
/** USB_OTGHS_DAINTMSK_OUTEPMSK15 : R/W; bitpos: [31]; default: 0;
 *  OUT Endpoint 15 Interrupt mask Bit
 */
#define USB_OTGHS_DAINTMSK_OUTEPMSK15    (BIT(31))
#define USB_OTGHS_DAINTMSK_OUTEPMSK15_M  (USB_OTGHS_DAINTMSK_OUTEPMSK15_V << USB_OTGHS_DAINTMSK_OUTEPMSK15_S)
#define USB_OTGHS_DAINTMSK_OUTEPMSK15_V  0x00000001U
#define USB_OTGHS_DAINTMSK_OUTEPMSK15_S  31

/** USB_OTGHS_DVBUSDIS_REG register
 *  This register specifies the VBUS discharge time after VBUS pulsing during SRP.
 */
#define USB_OTGHS_DVBUSDIS_REG (DR_REG_USB_OTGHS_BASE + 0x828)
/** USB_OTGHS_DVBUSDIS_DVBUSDIS : R/W; bitpos: [15:0]; default: 6103;
 *  Device VBUS Discharge Time (DVBUSDis)
 *
 *  Specifies the VBUS discharge time after VBUS pulsing during SRP. This value equals
 *  (VBUS discharge time in PHY clocks) / 1, 024.
 *
 *  The value you use depends whether the PHY is operating at 30MHz (16-bit data width)
 *  or 60 MHz (8-bit data width).
 *
 *  Depending on your VBUS load, this value can need adjustment.
 */
#define USB_OTGHS_DVBUSDIS_DVBUSDIS    0x0000FFFFU
#define USB_OTGHS_DVBUSDIS_DVBUSDIS_M  (USB_OTGHS_DVBUSDIS_DVBUSDIS_V << USB_OTGHS_DVBUSDIS_DVBUSDIS_S)
#define USB_OTGHS_DVBUSDIS_DVBUSDIS_V  0x0000FFFFU
#define USB_OTGHS_DVBUSDIS_DVBUSDIS_S  0

/** USB_OTGHS_DVBUSPULSE_REG register
 *  This register contains the VBUS pulsing time during SRP.
 */
#define USB_OTGHS_DVBUSPULSE_REG (DR_REG_USB_OTGHS_BASE + 0x82c)
/** USB_OTGHS_DVBUSPULSE_DVBUSPULSE : R/W; bitpos: [11:0]; default: 1464;
 *  Device VBUS Pulsing Time (DVBUSPulse)
 *
 *  Specifies the VBUS pulsing time during SRP. This value equals (VBUS pulsing time in
 *  PHY clocks) / 1, 024
 *
 *  The value you use depends whether the PHY is operating at 30MHz (16-bit data width)
 *  or 60 MHz (8-bit data width).
 */
#define USB_OTGHS_DVBUSPULSE_DVBUSPULSE    0x00000FFFU
#define USB_OTGHS_DVBUSPULSE_DVBUSPULSE_M  (USB_OTGHS_DVBUSPULSE_DVBUSPULSE_V << USB_OTGHS_DVBUSPULSE_DVBUSPULSE_S)
#define USB_OTGHS_DVBUSPULSE_DVBUSPULSE_V  0x00000FFFU
#define USB_OTGHS_DVBUSPULSE_DVBUSPULSE_S  0

/** USB_OTGHS_DTHRCTL_REG register
 *  This register contains the Receive and Transmit Threshold characteristics of the
 *  Device controller.
 */
#define USB_OTGHS_DTHRCTL_REG (DR_REG_USB_OTGHS_BASE + 0x830)
/** USB_OTGHS_DTHRCTL_NONISOTHREN : R/W; bitpos: [0]; default: 0;
 *  Non-ISO IN Endpoints Threshold Enable. (NonISOThrEn)
 *
 *  When this bit is Set, the core enables thresholding for Non Isochronous IN
 *  endpoints.
 */
#define USB_OTGHS_DTHRCTL_NONISOTHREN    (BIT(0))
#define USB_OTGHS_DTHRCTL_NONISOTHREN_M  (USB_OTGHS_DTHRCTL_NONISOTHREN_V << USB_OTGHS_DTHRCTL_NONISOTHREN_S)
#define USB_OTGHS_DTHRCTL_NONISOTHREN_V  0x00000001U
#define USB_OTGHS_DTHRCTL_NONISOTHREN_S  0
/** USB_OTGHS_DTHRCTL_ISOTHREN : R/W; bitpos: [1]; default: 0;
 *
 *  ISO IN Endpoints Threshold Enable. (ISOThrEn)
 *
 *  When this bit is Set, the core enables thresholding for isochronous IN
 *  endpoints.
 */
#define USB_OTGHS_DTHRCTL_ISOTHREN    (BIT(1))
#define USB_OTGHS_DTHRCTL_ISOTHREN_M  (USB_OTGHS_DTHRCTL_ISOTHREN_V << USB_OTGHS_DTHRCTL_ISOTHREN_S)
#define USB_OTGHS_DTHRCTL_ISOTHREN_V  0x00000001U
#define USB_OTGHS_DTHRCTL_ISOTHREN_S  1
/** USB_OTGHS_DTHRCTL_TXTHRLEN : R/W; bitpos: [10:2]; default: 8;
 *  Transmit Threshold Length (TxThrLen)
 *
 *  This field specifies Transmit thresholding size in DWORDS. This also forms
 *  the MAC threshold and specifies the amount of data in bytes to be in the
 *  corresponding endpoint transmit FIFO, before the core can start transmit
 *  on the USB. The threshold length has to be at least eight DWORDS when the
 *  value of AHBThrRatio is 2'h00. In case the AHBThrRatio is non zero the
 *  application needs to ensure that the AHB Threshold value does not go below
 *  the recommended eight DWORD.  This field controls both isochronous and
 *  non-isochronous IN endpoint thresholds. The recommended value for ThrLen
 *  is to be the same as the programmed AHB Burst Length (GAHBCFG.HBstLen).
 *
 *  Note:
 *  - When OTG_ARCHITECTURE=0, the reset value of this register field is 0.
 *  - When OTG_ARCHITECTURE=2, the reset value of this register field is 8.
 */
#define USB_OTGHS_DTHRCTL_TXTHRLEN    0x000001FFU
#define USB_OTGHS_DTHRCTL_TXTHRLEN_M  (USB_OTGHS_DTHRCTL_TXTHRLEN_V << USB_OTGHS_DTHRCTL_TXTHRLEN_S)
#define USB_OTGHS_DTHRCTL_TXTHRLEN_V  0x000001FFU
#define USB_OTGHS_DTHRCTL_TXTHRLEN_S  2
/** USB_OTGHS_DTHRCTL_AHBTHRRATIO : R/W; bitpos: [12:11]; default: 0;
 *  AHB Threshold Ratio (AHBThrRatio)
 *
 *  These bits define the ratio between the AHB threshold and the MAC threshold for the
 *  transmit path only. The AHB threshold always remains less than or equal to the USB
 *  threshold, because this does not increase overhead. Both the AHB and the MAC
 *  threshold must be DWORD-aligned. The application needs to program TxThrLen and the
 *  AHBThrRatio to make the AHB Threshold value DWORD aligned. If the AHB threshold
 *  value is not DWORD aligned, the core might not behave correctly. When programming
 *  the TxThrLen and AHBThrRatio, the application must ensure that the minimum AHB
 *  threshold value does not go below 8 DWORDS to meet the USB turnaround time
 *  requirements.
 *  - 2'b00: AHB threshold = MAC threshold
 *  - 2'b01: AHB threshold = MAC threshold / 2
 *  - 2'b10: AHB threshold = MAC threshold / 4
 *  - 2'b11: AHB threshold = MAC threshold / 8
 */
#define USB_OTGHS_DTHRCTL_AHBTHRRATIO    0x00000003U
#define USB_OTGHS_DTHRCTL_AHBTHRRATIO_M  (USB_OTGHS_DTHRCTL_AHBTHRRATIO_V << USB_OTGHS_DTHRCTL_AHBTHRRATIO_S)
#define USB_OTGHS_DTHRCTL_AHBTHRRATIO_V  0x00000003U
#define USB_OTGHS_DTHRCTL_AHBTHRRATIO_S  11
/** USB_OTGHS_DTHRCTL_RXTHREN : R/W; bitpos: [16]; default: 0;
 *  Receive Threshold Enable (RxThrEn)
 *
 *  When this bit is set, the core enables thresholding in the receive direction.
 *
 *  Note: We recommends that you do not enable RxThrEn, because it may cause issues in
 *  the RxFIFO especially during error conditions such as RxError and Babble.
 */
#define USB_OTGHS_DTHRCTL_RXTHREN    (BIT(16))
#define USB_OTGHS_DTHRCTL_RXTHREN_M  (USB_OTGHS_DTHRCTL_RXTHREN_V << USB_OTGHS_DTHRCTL_RXTHREN_S)
#define USB_OTGHS_DTHRCTL_RXTHREN_V  0x00000001U
#define USB_OTGHS_DTHRCTL_RXTHREN_S  16
/** USB_OTGHS_DTHRCTL_RXTHRLEN : R/W; bitpos: [25:17]; default: 8;
 *  Receive Threshold Length (RxThrLen)
 *
 *  This field specifies Receive thresholding size in DWORDS.
 *  This field also specifies the amount of data received on the USB before the core
 *  can start transmitting on the AHB.
 *  The threshold length has to be at least eight DWORDS.
 *  The recommended value for ThrLen is to be the same as the programmed
 *  AHB Burst Length (GAHBCFG.HBstLen).
 */
#define USB_OTGHS_DTHRCTL_RXTHRLEN    0x000001FFU
#define USB_OTGHS_DTHRCTL_RXTHRLEN_M  (USB_OTGHS_DTHRCTL_RXTHRLEN_V << USB_OTGHS_DTHRCTL_RXTHRLEN_S)
#define USB_OTGHS_DTHRCTL_RXTHRLEN_V  0x000001FFU
#define USB_OTGHS_DTHRCTL_RXTHRLEN_S  17
/** USB_OTGHS_DTHRCTL_ARBPRKEN : R/W; bitpos: [27]; default: 1;
 *  Arbiter Parking Enable (ArbPrkEn)
 *
 *  This bit controls internal DMA arbiter parking for IN endpoints. If thresholding is
 *  enabled and this bit is set to one, then the arbiter parks on the IN endpoint for
 *  which there is a token received on the USB. This is done to avoid getting into
 *  underrun conditions. By default, arbiter parking is enabled.
 */
#define USB_OTGHS_DTHRCTL_ARBPRKEN    (BIT(27))
#define USB_OTGHS_DTHRCTL_ARBPRKEN_M  (USB_OTGHS_DTHRCTL_ARBPRKEN_V << USB_OTGHS_DTHRCTL_ARBPRKEN_S)
#define USB_OTGHS_DTHRCTL_ARBPRKEN_V  0x00000001U
#define USB_OTGHS_DTHRCTL_ARBPRKEN_S  27

/** USB_OTGHS_DIEPEMPMSK_REG register
 *  This register is valid only in Dedicated FIFO operation (OTG_EN_DED_TX_FIFO = 1).
 *  This register is used to control the IN endpoint FIFO empty interrupt generation
 *  (DIEPINTn.TxfEmp).
 */
#define USB_OTGHS_DIEPEMPMSK_REG (DR_REG_USB_OTGHS_BASE + 0x834)
/** USB_OTGHS_DIEPEMPMSK_INEPTXFEMPMSK : R/W; bitpos: [15:0]; default: 0;
 *  IN EP Tx FIFO Empty Interrupt Mask Bits (InEpTxfEmpMsk)
 *
 *  These bits acts as mask bits for DIEPINTn.TxFEmp interrupt, one bit per IN Endpoint:
 *
 *  Bit 0 for IN EP 0, bit 15 for IN EP 15
 */
#define USB_OTGHS_DIEPEMPMSK_INEPTXFEMPMSK    0x0000FFFFU
#define USB_OTGHS_DIEPEMPMSK_INEPTXFEMPMSK_M  (USB_OTGHS_DIEPEMPMSK_INEPTXFEMPMSK_V << USB_OTGHS_DIEPEMPMSK_INEPTXFEMPMSK_S)
#define USB_OTGHS_DIEPEMPMSK_INEPTXFEMPMSK_V  0x0000FFFFU
#define USB_OTGHS_DIEPEMPMSK_INEPTXFEMPMSK_S  0

/** USB_OTGHS_DEACHINT_REG register
 *  This register is available in device mode and only when parameter
 *  OTG_MULTI_PROC_INTRPT on page 121=1. There is one interrupt bit per endpoint, up to
 *  a maximum of 16 bits for OUT endpoints and 16 bits for IN endpoints. For a
 *  bidirectional endpoint, the corresponding IN and OUT interrupt bits are used. Bits
 *  in this register are set and cleared when the application sets and clears bits in
 *  the corresponding Device Endpoint-n Interrupt register (DIEPINTn/DOEPINTn). The
 *  interrupt is automatically cleared once the DOEPINTn/DIEPINTn interrupt is cleared
 *  by the application.
 */
#define USB_OTGHS_DEACHINT_REG (DR_REG_USB_OTGHS_BASE + 0x838)
/** USB_OTGHS_DEACHINT_ECHINEPINT : RO; bitpos: [15:0]; default: 0;
 *  Each IN Endpoint Interrupt Bits (EchInEpInt)
 *
 *  One bit per IN Endpoint:
 *
 *  Bit 0 for IN endpoint 0, bit 15 for endpoint 15
 */
#define USB_OTGHS_DEACHINT_ECHINEPINT    0x0000FFFFU
#define USB_OTGHS_DEACHINT_ECHINEPINT_M  (USB_OTGHS_DEACHINT_ECHINEPINT_V << USB_OTGHS_DEACHINT_ECHINEPINT_S)
#define USB_OTGHS_DEACHINT_ECHINEPINT_V  0x0000FFFFU
#define USB_OTGHS_DEACHINT_ECHINEPINT_S  0
/** USB_OTGHS_DEACHINT_ECHOUTEPINT : RO; bitpos: [31:16]; default: 0;
 *  Each OUT Endpoint Interrupt Bits (EchOutEPInt)
 *
 *  One bit per OUT endpoint:
 *
 *  Bit 16 for OUT endpoint 0, bit 31 for OUT endpoint 15
 */
#define USB_OTGHS_DEACHINT_ECHOUTEPINT    0x0000FFFFU
#define USB_OTGHS_DEACHINT_ECHOUTEPINT_M  (USB_OTGHS_DEACHINT_ECHOUTEPINT_V << USB_OTGHS_DEACHINT_ECHOUTEPINT_S)
#define USB_OTGHS_DEACHINT_ECHOUTEPINT_V  0x0000FFFFU
#define USB_OTGHS_DEACHINT_ECHOUTEPINT_S  16

