espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_DEACHINTMSK_REG register
 *  This register is available only when parameter OTG_MULTI_PROC_INTRPT=1. The Device
 *  Each Endpoint Interrupt Mask register works with the Device Each Endpoint Interrupt
 *  register to interrupt the application when an event occurs on a device endpoint.
 *  However, the Device Each Endpoints Interrupt (DEACHINT) register bit corresponding
 *  to that interrupt remains set.
 */
#define USB_OTGHS_DEACHINTMSK_REG (DR_REG_USB_OTGHS_BASE + 0x83c)
/** USB_OTGHS_DEACHINTMSK_ECHINEPMSK0 : R/W; bitpos: [0]; default: 0;
 *  IN EP0 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK0    (BIT(0))
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK0_M  (USB_OTGHS_DEACHINTMSK_ECHINEPMSK0_V << USB_OTGHS_DEACHINTMSK_ECHINEPMSK0_S)
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK0_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK0_S  0
/** USB_OTGHS_DEACHINTMSK_ECHINEPMSK1 : R/W; bitpos: [1]; default: 0;
 *  IN EP1 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK1    (BIT(1))
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK1_M  (USB_OTGHS_DEACHINTMSK_ECHINEPMSK1_V << USB_OTGHS_DEACHINTMSK_ECHINEPMSK1_S)
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK1_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK1_S  1
/** USB_OTGHS_DEACHINTMSK_ECHINEPMSK2 : R/W; bitpos: [2]; default: 0;
 *  IN EP2 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK2    (BIT(2))
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK2_M  (USB_OTGHS_DEACHINTMSK_ECHINEPMSK2_V << USB_OTGHS_DEACHINTMSK_ECHINEPMSK2_S)
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK2_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK2_S  2
/** USB_OTGHS_DEACHINTMSK_ECHINEPMSK3 : R/W; bitpos: [3]; default: 0;
 *  IN EP3 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK3    (BIT(3))
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK3_M  (USB_OTGHS_DEACHINTMSK_ECHINEPMSK3_V << USB_OTGHS_DEACHINTMSK_ECHINEPMSK3_S)
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK3_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK3_S  3
/** USB_OTGHS_DEACHINTMSK_ECHINEPMSK4 : R/W; bitpos: [4]; default: 0;
 *  IN EP4 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK4    (BIT(4))
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK4_M  (USB_OTGHS_DEACHINTMSK_ECHINEPMSK4_V << USB_OTGHS_DEACHINTMSK_ECHINEPMSK4_S)
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK4_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK4_S  4
/** USB_OTGHS_DEACHINTMSK_ECHINEPMSK5 : R/W; bitpos: [5]; default: 0;
 *  IN EP5 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK5    (BIT(5))
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK5_M  (USB_OTGHS_DEACHINTMSK_ECHINEPMSK5_V << USB_OTGHS_DEACHINTMSK_ECHINEPMSK5_S)
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK5_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK5_S  5
/** USB_OTGHS_DEACHINTMSK_ECHINEPMSK6 : R/W; bitpos: [6]; default: 0;
 *  IN EP6 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK6    (BIT(6))
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK6_M  (USB_OTGHS_DEACHINTMSK_ECHINEPMSK6_V << USB_OTGHS_DEACHINTMSK_ECHINEPMSK6_S)
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK6_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK6_S  6
/** USB_OTGHS_DEACHINTMSK_ECHINEPMSK7 : R/W; bitpos: [7]; default: 0;
 *  IN EP7 Interrupt Mask Bits
 */
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK7    (BIT(7))
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK7_M  (USB_OTGHS_DEACHINTMSK_ECHINEPMSK7_V << USB_OTGHS_DEACHINTMSK_ECHINEPMSK7_S)
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK7_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK7_S  7
/** USB_OTGHS_DEACHINTMSK_ECHINEPMSK8 : R/W; bitpos: [8]; default: 0;
 *  IN EP8 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK8    (BIT(8))
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK8_M  (USB_OTGHS_DEACHINTMSK_ECHINEPMSK8_V << USB_OTGHS_DEACHINTMSK_ECHINEPMSK8_S)
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK8_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK8_S  8
/** USB_OTGHS_DEACHINTMSK_ECHINEPMSK9 : R/W; bitpos: [9]; default: 0;
 *  IN EP9 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK9    (BIT(9))
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK9_M  (USB_OTGHS_DEACHINTMSK_ECHINEPMSK9_V << USB_OTGHS_DEACHINTMSK_ECHINEPMSK9_S)
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK9_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK9_S  9
/** USB_OTGHS_DEACHINTMSK_ECHINEPMSK10 : R/W; bitpos: [10]; default: 0;
 *  IN EP10 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK10    (BIT(10))
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK10_M  (USB_OTGHS_DEACHINTMSK_ECHINEPMSK10_V << USB_OTGHS_DEACHINTMSK_ECHINEPMSK10_S)
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK10_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK10_S  10
/** USB_OTGHS_DEACHINTMSK_ECHINEPMSK11 : R/W; bitpos: [11]; default: 0;
 *  IN EP11 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK11    (BIT(11))
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK11_M  (USB_OTGHS_DEACHINTMSK_ECHINEPMSK11_V << USB_OTGHS_DEACHINTMSK_ECHINEPMSK11_S)
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK11_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK11_S  11
/** USB_OTGHS_DEACHINTMSK_ECHINEPMSK12 : R/W; bitpos: [12]; default: 0;
 *  IN EP12 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK12    (BIT(12))
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK12_M  (USB_OTGHS_DEACHINTMSK_ECHINEPMSK12_V << USB_OTGHS_DEACHINTMSK_ECHINEPMSK12_S)
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK12_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK12_S  12
/** USB_OTGHS_DEACHINTMSK_ECHINEPMSK13 : R/W; bitpos: [13]; default: 0;
 *  IN EP13 Interrupt Mask Bits
 */
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK13    (BIT(13))
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK13_M  (USB_OTGHS_DEACHINTMSK_ECHINEPMSK13_V << USB_OTGHS_DEACHINTMSK_ECHINEPMSK13_S)
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK13_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK13_S  13
/** USB_OTGHS_DEACHINTMSK_ECHINEPMSK14 : R/W; bitpos: [14]; default: 0;
 *  IN EP14 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK14    (BIT(14))
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK14_M  (USB_OTGHS_DEACHINTMSK_ECHINEPMSK14_V << USB_OTGHS_DEACHINTMSK_ECHINEPMSK14_S)
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK14_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK14_S  14
/** USB_OTGHS_DEACHINTMSK_ECHINEPMSK15 : R/W; bitpos: [15]; default: 0;
 *  IN EP15 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK15    (BIT(15))
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK15_M  (USB_OTGHS_DEACHINTMSK_ECHINEPMSK15_V << USB_OTGHS_DEACHINTMSK_ECHINEPMSK15_S)
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK15_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHINEPMSK15_S  15
/** USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK0 : R/W; bitpos: [16]; default: 0;
 *  OUT EP0 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK0    (BIT(16))
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK0_M  (USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK0_V << USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK0_S)
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK0_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK0_S  16
/** USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK1 : R/W; bitpos: [17]; default: 0;
 *  OUT EP1 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK1    (BIT(17))
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK1_M  (USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK1_V << USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK1_S)
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK1_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK1_S  17
/** USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK2 : R/W; bitpos: [18]; default: 0;
 *  OUT EP2 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK2    (BIT(18))
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK2_M  (USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK2_V << USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK2_S)
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK2_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK2_S  18
/** USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK3 : R/W; bitpos: [19]; default: 0;
 *  OUT EP3 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK3    (BIT(19))
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK3_M  (USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK3_V << USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK3_S)
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK3_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK3_S  19
/** USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK4 : R/W; bitpos: [20]; default: 0;
 *  OUT EP4 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK4    (BIT(20))
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK4_M  (USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK4_V << USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK4_S)
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK4_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK4_S  20
/** USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK5 : R/W; bitpos: [21]; default: 0;
 *  OUT EP5 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK5    (BIT(21))
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK5_M  (USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK5_V << USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK5_S)
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK5_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK5_S  21
/** USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK6 : R/W; bitpos: [22]; default: 0;
 *  OUT EP6 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK6    (BIT(22))
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK6_M  (USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK6_V << USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK6_S)
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK6_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK6_S  22
/** USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK7 : R/W; bitpos: [23]; default: 0;
 *  OUT EP7 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK7    (BIT(23))
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK7_M  (USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK7_V << USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK7_S)
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK7_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK7_S  23
/** USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK8 : R/W; bitpos: [24]; default: 0;
 *  OUT EP8 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK8    (BIT(24))
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK8_M  (USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK8_V << USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK8_S)
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK8_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK8_S  24
/** USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK9 : R/W; bitpos: [25]; default: 0;
 *  OUT EP9 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK9    (BIT(25))
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK9_M  (USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK9_V << USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK9_S)
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK9_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK9_S  25
/** USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK10 : R/W; bitpos: [26]; default: 0;
 *  OUT EP10 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK10    (BIT(26))
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK10_M  (USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK10_V << USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK10_S)
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK10_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK10_S  26
/** USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK11 : R/W; bitpos: [27]; default: 0;
 *  OUT EP11 Interrupt Mask Bits
 */
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK11    (BIT(27))
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK11_M  (USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK11_V << USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK11_S)
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK11_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK11_S  27
/** USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK12 : R/W; bitpos: [28]; default: 0;
 *  OUT EP12 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK12    (BIT(28))
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK12_M  (USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK12_V << USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK12_S)
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK12_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK12_S  28
/** USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK13 : R/W; bitpos: [29]; default: 0;
 *  OUT EP13 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK13    (BIT(29))
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK13_M  (USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK13_V << USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK13_S)
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK13_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK13_S  29
/** USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK14 : R/W; bitpos: [30]; default: 0;
 *  OUT EP14 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK14    (BIT(30))
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK14_M  (USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK14_V << USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK14_S)
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK14_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK14_S  30
/** USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK15 : R/W; bitpos: [31]; default: 0;
 *  OUT EP15 Interrupt Mask Bit
 */
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK15    (BIT(31))
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK15_M  (USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK15_V << USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK15_S)
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK15_V  0x00000001U
#define USB_OTGHS_DEACHINTMSK_ECHOUTEPMSK15_S  31

