espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_DIEPEACHMSK0_REG register
 *  This register is available in device mode and only when parameter
 *  OTG_MULTI_PROC_INTRPT on page 121=1. These registers are endpoint-specific mask
 *  registers for (DIEPINTn). The IN endpoint interrupt for a specific status in the
 *  DIEPINTn register can be masked by writing 0 to the corresponding bit in this
 *  register. Status bits are masked by default.  - Mask interrupt: 1'b0  - Unmask
 *  interrupt: 1'b1
 */
#define USB_OTGHS_DIEPEACHMSK0_REG (DR_REG_USB_OTGHS_BASE + 0x840)
/** USB_OTGHS_DIEPEACHMSK0_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DIEPEACHMSK0_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DIEPEACHMSK0_XFERCOMPLMSK_M  (USB_OTGHS_DIEPEACHMSK0_XFERCOMPLMSK_V << USB_OTGHS_DIEPEACHMSK0_XFERCOMPLMSK_S)
#define USB_OTGHS_DIEPEACHMSK0_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK0_XFERCOMPLMSK_S  0
/** USB_OTGHS_DIEPEACHMSK0_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DIEPEACHMSK0_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DIEPEACHMSK0_EPDISBLDMSK_M  (USB_OTGHS_DIEPEACHMSK0_EPDISBLDMSK_V << USB_OTGHS_DIEPEACHMSK0_EPDISBLDMSK_S)
#define USB_OTGHS_DIEPEACHMSK0_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK0_EPDISBLDMSK_S  1
/** USB_OTGHS_DIEPEACHMSK0_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error Mask (AHBErrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK0_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DIEPEACHMSK0_AHBERRMSK_M  (USB_OTGHS_DIEPEACHMSK0_AHBERRMSK_V << USB_OTGHS_DIEPEACHMSK0_AHBERRMSK_S)
#define USB_OTGHS_DIEPEACHMSK0_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK0_AHBERRMSK_S  2
/** USB_OTGHS_DIEPEACHMSK0_TIMEOUTMSK : R/W; bitpos: [3]; default: 0;
 *  Timeout Condition Mask (TimeOUTMsk) (Non-isochronous endpoints)
 */
#define USB_OTGHS_DIEPEACHMSK0_TIMEOUTMSK    (BIT(3))
#define USB_OTGHS_DIEPEACHMSK0_TIMEOUTMSK_M  (USB_OTGHS_DIEPEACHMSK0_TIMEOUTMSK_V << USB_OTGHS_DIEPEACHMSK0_TIMEOUTMSK_S)
#define USB_OTGHS_DIEPEACHMSK0_TIMEOUTMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK0_TIMEOUTMSK_S  3
/** USB_OTGHS_DIEPEACHMSK0_INTKNTXFEMPMSK : R/W; bitpos: [4]; default: 0;
 *  IN Token Received When TxFIFO Empty Mask (INTknTXFEmpMsk)
 */
#define USB_OTGHS_DIEPEACHMSK0_INTKNTXFEMPMSK    (BIT(4))
#define USB_OTGHS_DIEPEACHMSK0_INTKNTXFEMPMSK_M  (USB_OTGHS_DIEPEACHMSK0_INTKNTXFEMPMSK_V << USB_OTGHS_DIEPEACHMSK0_INTKNTXFEMPMSK_S)
#define USB_OTGHS_DIEPEACHMSK0_INTKNTXFEMPMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK0_INTKNTXFEMPMSK_S  4
/** USB_OTGHS_DIEPEACHMSK0_INTKNEPMISMSK : R/W; bitpos: [5]; default: 0;
 *  IN Token received with EP Mismatch Mask (INTknEPMisMsk)
 */
#define USB_OTGHS_DIEPEACHMSK0_INTKNEPMISMSK    (BIT(5))
#define USB_OTGHS_DIEPEACHMSK0_INTKNEPMISMSK_M  (USB_OTGHS_DIEPEACHMSK0_INTKNEPMISMSK_V << USB_OTGHS_DIEPEACHMSK0_INTKNEPMISMSK_S)
#define USB_OTGHS_DIEPEACHMSK0_INTKNEPMISMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK0_INTKNEPMISMSK_S  5
/** USB_OTGHS_DIEPEACHMSK0_INEPNAKEFFMSK : R/W; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective Mask (INEPNakEffMsk)
 */
#define USB_OTGHS_DIEPEACHMSK0_INEPNAKEFFMSK    (BIT(6))
#define USB_OTGHS_DIEPEACHMSK0_INEPNAKEFFMSK_M  (USB_OTGHS_DIEPEACHMSK0_INEPNAKEFFMSK_V << USB_OTGHS_DIEPEACHMSK0_INEPNAKEFFMSK_S)
#define USB_OTGHS_DIEPEACHMSK0_INEPNAKEFFMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK0_INEPNAKEFFMSK_S  6
/** USB_OTGHS_DIEPEACHMSK0_TXFIFOUNDRNMSK : R/W; bitpos: [8]; default: 0;
 *  Fifo Underrun Mask (TxfifoUndrnMsk)
 */
#define USB_OTGHS_DIEPEACHMSK0_TXFIFOUNDRNMSK    (BIT(8))
#define USB_OTGHS_DIEPEACHMSK0_TXFIFOUNDRNMSK_M  (USB_OTGHS_DIEPEACHMSK0_TXFIFOUNDRNMSK_V << USB_OTGHS_DIEPEACHMSK0_TXFIFOUNDRNMSK_S)
#define USB_OTGHS_DIEPEACHMSK0_TXFIFOUNDRNMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK0_TXFIFOUNDRNMSK_S  8
/** USB_OTGHS_DIEPEACHMSK0_BNAININTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BNAInIntrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK0_BNAININTRMSK    (BIT(9))
#define USB_OTGHS_DIEPEACHMSK0_BNAININTRMSK_M  (USB_OTGHS_DIEPEACHMSK0_BNAININTRMSK_V << USB_OTGHS_DIEPEACHMSK0_BNAININTRMSK_S)
#define USB_OTGHS_DIEPEACHMSK0_BNAININTRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK0_BNAININTRMSK_S  9
/** USB_OTGHS_DIEPEACHMSK0_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DIEPEACHMSK0_NAKMSK    (BIT(13))
#define USB_OTGHS_DIEPEACHMSK0_NAKMSK_M  (USB_OTGHS_DIEPEACHMSK0_NAKMSK_V << USB_OTGHS_DIEPEACHMSK0_NAKMSK_S)
#define USB_OTGHS_DIEPEACHMSK0_NAKMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK0_NAKMSK_S  13

/** USB_OTGHS_DIEPEACHMSK1_REG register
 *  This register contains the interrupts for the IN Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DIEPEACHMSK1_REG (DR_REG_USB_OTGHS_BASE + 0x844)
/** USB_OTGHS_DIEPEACHMSK1_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DIEPEACHMSK1_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DIEPEACHMSK1_XFERCOMPLMSK_M  (USB_OTGHS_DIEPEACHMSK1_XFERCOMPLMSK_V << USB_OTGHS_DIEPEACHMSK1_XFERCOMPLMSK_S)
#define USB_OTGHS_DIEPEACHMSK1_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK1_XFERCOMPLMSK_S  0
/** USB_OTGHS_DIEPEACHMSK1_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DIEPEACHMSK1_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DIEPEACHMSK1_EPDISBLDMSK_M  (USB_OTGHS_DIEPEACHMSK1_EPDISBLDMSK_V << USB_OTGHS_DIEPEACHMSK1_EPDISBLDMSK_S)
#define USB_OTGHS_DIEPEACHMSK1_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK1_EPDISBLDMSK_S  1
/** USB_OTGHS_DIEPEACHMSK1_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error Mask (AHBErrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK1_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DIEPEACHMSK1_AHBERRMSK_M  (USB_OTGHS_DIEPEACHMSK1_AHBERRMSK_V << USB_OTGHS_DIEPEACHMSK1_AHBERRMSK_S)
#define USB_OTGHS_DIEPEACHMSK1_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK1_AHBERRMSK_S  2
/** USB_OTGHS_DIEPEACHMSK1_TIMEOUTMSK : R/W; bitpos: [3]; default: 0;
 *  Timeout Condition Mask (TimeOUTMsk)
 *  (Non-isochronous endpoints)
 */
#define USB_OTGHS_DIEPEACHMSK1_TIMEOUTMSK    (BIT(3))
#define USB_OTGHS_DIEPEACHMSK1_TIMEOUTMSK_M  (USB_OTGHS_DIEPEACHMSK1_TIMEOUTMSK_V << USB_OTGHS_DIEPEACHMSK1_TIMEOUTMSK_S)
#define USB_OTGHS_DIEPEACHMSK1_TIMEOUTMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK1_TIMEOUTMSK_S  3
/** USB_OTGHS_DIEPEACHMSK1_INTKNTXFEMPMSK : R/W; bitpos: [4]; default: 0;
 *  IN Token Received When TxFIFO Empty Mask(INTknTXFEmpMsk)
 */
#define USB_OTGHS_DIEPEACHMSK1_INTKNTXFEMPMSK    (BIT(4))
#define USB_OTGHS_DIEPEACHMSK1_INTKNTXFEMPMSK_M  (USB_OTGHS_DIEPEACHMSK1_INTKNTXFEMPMSK_V << USB_OTGHS_DIEPEACHMSK1_INTKNTXFEMPMSK_S)
#define USB_OTGHS_DIEPEACHMSK1_INTKNTXFEMPMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK1_INTKNTXFEMPMSK_S  4
/** USB_OTGHS_DIEPEACHMSK1_INTKNEPMISMSK : R/W; bitpos: [5]; default: 0;
 *  IN Token received with EP Mismatch Mask (INTknEPMisMsk)
 */
#define USB_OTGHS_DIEPEACHMSK1_INTKNEPMISMSK    (BIT(5))
#define USB_OTGHS_DIEPEACHMSK1_INTKNEPMISMSK_M  (USB_OTGHS_DIEPEACHMSK1_INTKNEPMISMSK_V << USB_OTGHS_DIEPEACHMSK1_INTKNEPMISMSK_S)
#define USB_OTGHS_DIEPEACHMSK1_INTKNEPMISMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK1_INTKNEPMISMSK_S  5
/** USB_OTGHS_DIEPEACHMSK1_INEPNAKEFFMSK : R/W; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective Mask (INEPNakEffMsk)
 */
#define USB_OTGHS_DIEPEACHMSK1_INEPNAKEFFMSK    (BIT(6))
#define USB_OTGHS_DIEPEACHMSK1_INEPNAKEFFMSK_M  (USB_OTGHS_DIEPEACHMSK1_INEPNAKEFFMSK_V << USB_OTGHS_DIEPEACHMSK1_INEPNAKEFFMSK_S)
#define USB_OTGHS_DIEPEACHMSK1_INEPNAKEFFMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK1_INEPNAKEFFMSK_S  6
/** USB_OTGHS_DIEPEACHMSK1_TXFIFOUNDRNMSK : R/W; bitpos: [8]; default: 0;
 *  Fifo Underrun Mask (TxfifoUndrnMsk)
 */
#define USB_OTGHS_DIEPEACHMSK1_TXFIFOUNDRNMSK    (BIT(8))
#define USB_OTGHS_DIEPEACHMSK1_TXFIFOUNDRNMSK_M  (USB_OTGHS_DIEPEACHMSK1_TXFIFOUNDRNMSK_V << USB_OTGHS_DIEPEACHMSK1_TXFIFOUNDRNMSK_S)
#define USB_OTGHS_DIEPEACHMSK1_TXFIFOUNDRNMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK1_TXFIFOUNDRNMSK_S  8
/** USB_OTGHS_DIEPEACHMSK1_BNAININTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BNAInIntrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK1_BNAININTRMSK    (BIT(9))
#define USB_OTGHS_DIEPEACHMSK1_BNAININTRMSK_M  (USB_OTGHS_DIEPEACHMSK1_BNAININTRMSK_V << USB_OTGHS_DIEPEACHMSK1_BNAININTRMSK_S)
#define USB_OTGHS_DIEPEACHMSK1_BNAININTRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK1_BNAININTRMSK_S  9
/** USB_OTGHS_DIEPEACHMSK1_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DIEPEACHMSK1_NAKMSK    (BIT(13))
#define USB_OTGHS_DIEPEACHMSK1_NAKMSK_M  (USB_OTGHS_DIEPEACHMSK1_NAKMSK_V << USB_OTGHS_DIEPEACHMSK1_NAKMSK_S)
#define USB_OTGHS_DIEPEACHMSK1_NAKMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK1_NAKMSK_S  13

/** USB_OTGHS_DIEPEACHMSK2_REG register
 *  This register contains the interrupts for the IN Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DIEPEACHMSK2_REG (DR_REG_USB_OTGHS_BASE + 0x848)
/** USB_OTGHS_DIEPEACHMSK2_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DIEPEACHMSK2_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DIEPEACHMSK2_XFERCOMPLMSK_M  (USB_OTGHS_DIEPEACHMSK2_XFERCOMPLMSK_V << USB_OTGHS_DIEPEACHMSK2_XFERCOMPLMSK_S)
#define USB_OTGHS_DIEPEACHMSK2_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK2_XFERCOMPLMSK_S  0
/** USB_OTGHS_DIEPEACHMSK2_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DIEPEACHMSK2_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DIEPEACHMSK2_EPDISBLDMSK_M  (USB_OTGHS_DIEPEACHMSK2_EPDISBLDMSK_V << USB_OTGHS_DIEPEACHMSK2_EPDISBLDMSK_S)
#define USB_OTGHS_DIEPEACHMSK2_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK2_EPDISBLDMSK_S  1
/** USB_OTGHS_DIEPEACHMSK2_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error Mask (AHBErrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK2_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DIEPEACHMSK2_AHBERRMSK_M  (USB_OTGHS_DIEPEACHMSK2_AHBERRMSK_V << USB_OTGHS_DIEPEACHMSK2_AHBERRMSK_S)
#define USB_OTGHS_DIEPEACHMSK2_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK2_AHBERRMSK_S  2
/** USB_OTGHS_DIEPEACHMSK2_TIMEOUTMSK : R/W; bitpos: [3]; default: 0;
 *  Timeout Condition Mask (TimeOUTMsk)
 *  (Non-isochronous endpoints)
 */
#define USB_OTGHS_DIEPEACHMSK2_TIMEOUTMSK    (BIT(3))
#define USB_OTGHS_DIEPEACHMSK2_TIMEOUTMSK_M  (USB_OTGHS_DIEPEACHMSK2_TIMEOUTMSK_V << USB_OTGHS_DIEPEACHMSK2_TIMEOUTMSK_S)
#define USB_OTGHS_DIEPEACHMSK2_TIMEOUTMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK2_TIMEOUTMSK_S  3
/** USB_OTGHS_DIEPEACHMSK2_INTKNTXFEMPMSK : R/W; bitpos: [4]; default: 0;
 *  IN Token Received When TxFIFO Empty Mask(INTknTXFEmpMsk)
 */
#define USB_OTGHS_DIEPEACHMSK2_INTKNTXFEMPMSK    (BIT(4))
#define USB_OTGHS_DIEPEACHMSK2_INTKNTXFEMPMSK_M  (USB_OTGHS_DIEPEACHMSK2_INTKNTXFEMPMSK_V << USB_OTGHS_DIEPEACHMSK2_INTKNTXFEMPMSK_S)
#define USB_OTGHS_DIEPEACHMSK2_INTKNTXFEMPMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK2_INTKNTXFEMPMSK_S  4
/** USB_OTGHS_DIEPEACHMSK2_INTKNEPMISMSK : R/W; bitpos: [5]; default: 0;
 *  IN Token received with EP Mismatch Mask (INTknEPMisMsk)
 */
#define USB_OTGHS_DIEPEACHMSK2_INTKNEPMISMSK    (BIT(5))
#define USB_OTGHS_DIEPEACHMSK2_INTKNEPMISMSK_M  (USB_OTGHS_DIEPEACHMSK2_INTKNEPMISMSK_V << USB_OTGHS_DIEPEACHMSK2_INTKNEPMISMSK_S)
#define USB_OTGHS_DIEPEACHMSK2_INTKNEPMISMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK2_INTKNEPMISMSK_S  5
/** USB_OTGHS_DIEPEACHMSK2_INEPNAKEFFMSK : R/W; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective Mask (INEPNakEffMsk)
 */
#define USB_OTGHS_DIEPEACHMSK2_INEPNAKEFFMSK    (BIT(6))
#define USB_OTGHS_DIEPEACHMSK2_INEPNAKEFFMSK_M  (USB_OTGHS_DIEPEACHMSK2_INEPNAKEFFMSK_V << USB_OTGHS_DIEPEACHMSK2_INEPNAKEFFMSK_S)
#define USB_OTGHS_DIEPEACHMSK2_INEPNAKEFFMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK2_INEPNAKEFFMSK_S  6
/** USB_OTGHS_DIEPEACHMSK2_TXFIFOUNDRNMSK : R/W; bitpos: [8]; default: 0;
 *  Fifo Underrun Mask (TxfifoUndrnMsk)
 */
#define USB_OTGHS_DIEPEACHMSK2_TXFIFOUNDRNMSK    (BIT(8))
#define USB_OTGHS_DIEPEACHMSK2_TXFIFOUNDRNMSK_M  (USB_OTGHS_DIEPEACHMSK2_TXFIFOUNDRNMSK_V << USB_OTGHS_DIEPEACHMSK2_TXFIFOUNDRNMSK_S)
#define USB_OTGHS_DIEPEACHMSK2_TXFIFOUNDRNMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK2_TXFIFOUNDRNMSK_S  8
/** USB_OTGHS_DIEPEACHMSK2_BNAININTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BNAInIntrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK2_BNAININTRMSK    (BIT(9))
#define USB_OTGHS_DIEPEACHMSK2_BNAININTRMSK_M  (USB_OTGHS_DIEPEACHMSK2_BNAININTRMSK_V << USB_OTGHS_DIEPEACHMSK2_BNAININTRMSK_S)
#define USB_OTGHS_DIEPEACHMSK2_BNAININTRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK2_BNAININTRMSK_S  9
/** USB_OTGHS_DIEPEACHMSK2_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DIEPEACHMSK2_NAKMSK    (BIT(13))
#define USB_OTGHS_DIEPEACHMSK2_NAKMSK_M  (USB_OTGHS_DIEPEACHMSK2_NAKMSK_V << USB_OTGHS_DIEPEACHMSK2_NAKMSK_S)
#define USB_OTGHS_DIEPEACHMSK2_NAKMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK2_NAKMSK_S  13

/** USB_OTGHS_DIEPEACHMSK3_REG register
 *  This register contains the interrupts for the IN Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DIEPEACHMSK3_REG (DR_REG_USB_OTGHS_BASE + 0x84c)
/** USB_OTGHS_DIEPEACHMSK3_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DIEPEACHMSK3_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DIEPEACHMSK3_XFERCOMPLMSK_M  (USB_OTGHS_DIEPEACHMSK3_XFERCOMPLMSK_V << USB_OTGHS_DIEPEACHMSK3_XFERCOMPLMSK_S)
#define USB_OTGHS_DIEPEACHMSK3_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK3_XFERCOMPLMSK_S  0
/** USB_OTGHS_DIEPEACHMSK3_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DIEPEACHMSK3_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DIEPEACHMSK3_EPDISBLDMSK_M  (USB_OTGHS_DIEPEACHMSK3_EPDISBLDMSK_V << USB_OTGHS_DIEPEACHMSK3_EPDISBLDMSK_S)
#define USB_OTGHS_DIEPEACHMSK3_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK3_EPDISBLDMSK_S  1
/** USB_OTGHS_DIEPEACHMSK3_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error Mask (AHBErrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK3_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DIEPEACHMSK3_AHBERRMSK_M  (USB_OTGHS_DIEPEACHMSK3_AHBERRMSK_V << USB_OTGHS_DIEPEACHMSK3_AHBERRMSK_S)
#define USB_OTGHS_DIEPEACHMSK3_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK3_AHBERRMSK_S  2
/** USB_OTGHS_DIEPEACHMSK3_TIMEOUTMSK : R/W; bitpos: [3]; default: 0;
 *  Timeout Condition Mask (TimeOUTMsk)
 *  (Non-isochronous endpoints)
 */
#define USB_OTGHS_DIEPEACHMSK3_TIMEOUTMSK    (BIT(3))
#define USB_OTGHS_DIEPEACHMSK3_TIMEOUTMSK_M  (USB_OTGHS_DIEPEACHMSK3_TIMEOUTMSK_V << USB_OTGHS_DIEPEACHMSK3_TIMEOUTMSK_S)
#define USB_OTGHS_DIEPEACHMSK3_TIMEOUTMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK3_TIMEOUTMSK_S  3
/** USB_OTGHS_DIEPEACHMSK3_INTKNTXFEMPMSK : R/W; bitpos: [4]; default: 0;
 *  IN Token Received When TxFIFO Empty Mask(INTknTXFEmpMsk)
 */
#define USB_OTGHS_DIEPEACHMSK3_INTKNTXFEMPMSK    (BIT(4))
#define USB_OTGHS_DIEPEACHMSK3_INTKNTXFEMPMSK_M  (USB_OTGHS_DIEPEACHMSK3_INTKNTXFEMPMSK_V << USB_OTGHS_DIEPEACHMSK3_INTKNTXFEMPMSK_S)
#define USB_OTGHS_DIEPEACHMSK3_INTKNTXFEMPMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK3_INTKNTXFEMPMSK_S  4
/** USB_OTGHS_DIEPEACHMSK3_INTKNEPMISMSK : R/W; bitpos: [5]; default: 0;
 *  IN Token received with EP Mismatch Mask (INTknEPMisMsk)
 */
#define USB_OTGHS_DIEPEACHMSK3_INTKNEPMISMSK    (BIT(5))
#define USB_OTGHS_DIEPEACHMSK3_INTKNEPMISMSK_M  (USB_OTGHS_DIEPEACHMSK3_INTKNEPMISMSK_V << USB_OTGHS_DIEPEACHMSK3_INTKNEPMISMSK_S)
#define USB_OTGHS_DIEPEACHMSK3_INTKNEPMISMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK3_INTKNEPMISMSK_S  5
/** USB_OTGHS_DIEPEACHMSK3_INEPNAKEFFMSK : R/W; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective Mask (INEPNakEffMsk)
 */
#define USB_OTGHS_DIEPEACHMSK3_INEPNAKEFFMSK    (BIT(6))
#define USB_OTGHS_DIEPEACHMSK3_INEPNAKEFFMSK_M  (USB_OTGHS_DIEPEACHMSK3_INEPNAKEFFMSK_V << USB_OTGHS_DIEPEACHMSK3_INEPNAKEFFMSK_S)
#define USB_OTGHS_DIEPEACHMSK3_INEPNAKEFFMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK3_INEPNAKEFFMSK_S  6
/** USB_OTGHS_DIEPEACHMSK3_TXFIFOUNDRNMSK : R/W; bitpos: [8]; default: 0;
 *  Fifo Underrun Mask (TxfifoUndrnMsk)
 */
#define USB_OTGHS_DIEPEACHMSK3_TXFIFOUNDRNMSK    (BIT(8))
#define USB_OTGHS_DIEPEACHMSK3_TXFIFOUNDRNMSK_M  (USB_OTGHS_DIEPEACHMSK3_TXFIFOUNDRNMSK_V << USB_OTGHS_DIEPEACHMSK3_TXFIFOUNDRNMSK_S)
#define USB_OTGHS_DIEPEACHMSK3_TXFIFOUNDRNMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK3_TXFIFOUNDRNMSK_S  8
/** USB_OTGHS_DIEPEACHMSK3_BNAININTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BNAInIntrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK3_BNAININTRMSK    (BIT(9))
#define USB_OTGHS_DIEPEACHMSK3_BNAININTRMSK_M  (USB_OTGHS_DIEPEACHMSK3_BNAININTRMSK_V << USB_OTGHS_DIEPEACHMSK3_BNAININTRMSK_S)
#define USB_OTGHS_DIEPEACHMSK3_BNAININTRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK3_BNAININTRMSK_S  9
/** USB_OTGHS_DIEPEACHMSK3_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DIEPEACHMSK3_NAKMSK    (BIT(13))
#define USB_OTGHS_DIEPEACHMSK3_NAKMSK_M  (USB_OTGHS_DIEPEACHMSK3_NAKMSK_V << USB_OTGHS_DIEPEACHMSK3_NAKMSK_S)
#define USB_OTGHS_DIEPEACHMSK3_NAKMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK3_NAKMSK_S  13

/** USB_OTGHS_DIEPEACHMSK4_REG register
 *  This register contains the interrupts for the IN Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DIEPEACHMSK4_REG (DR_REG_USB_OTGHS_BASE + 0x850)
/** USB_OTGHS_DIEPEACHMSK4_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DIEPEACHMSK4_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DIEPEACHMSK4_XFERCOMPLMSK_M  (USB_OTGHS_DIEPEACHMSK4_XFERCOMPLMSK_V << USB_OTGHS_DIEPEACHMSK4_XFERCOMPLMSK_S)
#define USB_OTGHS_DIEPEACHMSK4_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK4_XFERCOMPLMSK_S  0
/** USB_OTGHS_DIEPEACHMSK4_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DIEPEACHMSK4_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DIEPEACHMSK4_EPDISBLDMSK_M  (USB_OTGHS_DIEPEACHMSK4_EPDISBLDMSK_V << USB_OTGHS_DIEPEACHMSK4_EPDISBLDMSK_S)
#define USB_OTGHS_DIEPEACHMSK4_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK4_EPDISBLDMSK_S  1
/** USB_OTGHS_DIEPEACHMSK4_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error Mask (AHBErrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK4_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DIEPEACHMSK4_AHBERRMSK_M  (USB_OTGHS_DIEPEACHMSK4_AHBERRMSK_V << USB_OTGHS_DIEPEACHMSK4_AHBERRMSK_S)
#define USB_OTGHS_DIEPEACHMSK4_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK4_AHBERRMSK_S  2
/** USB_OTGHS_DIEPEACHMSK4_TIMEOUTMSK : R/W; bitpos: [3]; default: 0;
 *  Timeout Condition Mask (TimeOUTMsk)
 *  (Non-isochronous endpoints)
 */
#define USB_OTGHS_DIEPEACHMSK4_TIMEOUTMSK    (BIT(3))
#define USB_OTGHS_DIEPEACHMSK4_TIMEOUTMSK_M  (USB_OTGHS_DIEPEACHMSK4_TIMEOUTMSK_V << USB_OTGHS_DIEPEACHMSK4_TIMEOUTMSK_S)
#define USB_OTGHS_DIEPEACHMSK4_TIMEOUTMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK4_TIMEOUTMSK_S  3
/** USB_OTGHS_DIEPEACHMSK4_INTKNTXFEMPMSK : R/W; bitpos: [4]; default: 0;
 *  IN Token Received When TxFIFO Empty Mask(INTknTXFEmpMsk)
 */
#define USB_OTGHS_DIEPEACHMSK4_INTKNTXFEMPMSK    (BIT(4))
#define USB_OTGHS_DIEPEACHMSK4_INTKNTXFEMPMSK_M  (USB_OTGHS_DIEPEACHMSK4_INTKNTXFEMPMSK_V << USB_OTGHS_DIEPEACHMSK4_INTKNTXFEMPMSK_S)
#define USB_OTGHS_DIEPEACHMSK4_INTKNTXFEMPMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK4_INTKNTXFEMPMSK_S  4
/** USB_OTGHS_DIEPEACHMSK4_INTKNEPMISMSK : R/W; bitpos: [5]; default: 0;
 *  IN Token received with EP Mismatch Mask (INTknEPMisMsk)
 */
#define USB_OTGHS_DIEPEACHMSK4_INTKNEPMISMSK    (BIT(5))
#define USB_OTGHS_DIEPEACHMSK4_INTKNEPMISMSK_M  (USB_OTGHS_DIEPEACHMSK4_INTKNEPMISMSK_V << USB_OTGHS_DIEPEACHMSK4_INTKNEPMISMSK_S)
#define USB_OTGHS_DIEPEACHMSK4_INTKNEPMISMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK4_INTKNEPMISMSK_S  5
/** USB_OTGHS_DIEPEACHMSK4_INEPNAKEFFMSK : R/W; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective Mask (INEPNakEffMsk)
 */
#define USB_OTGHS_DIEPEACHMSK4_INEPNAKEFFMSK    (BIT(6))
#define USB_OTGHS_DIEPEACHMSK4_INEPNAKEFFMSK_M  (USB_OTGHS_DIEPEACHMSK4_INEPNAKEFFMSK_V << USB_OTGHS_DIEPEACHMSK4_INEPNAKEFFMSK_S)
#define USB_OTGHS_DIEPEACHMSK4_INEPNAKEFFMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK4_INEPNAKEFFMSK_S  6
/** USB_OTGHS_DIEPEACHMSK4_TXFIFOUNDRNMSK : R/W; bitpos: [8]; default: 0;
 *  Fifo Underrun Mask (TxfifoUndrnMsk)
 */
#define USB_OTGHS_DIEPEACHMSK4_TXFIFOUNDRNMSK    (BIT(8))
#define USB_OTGHS_DIEPEACHMSK4_TXFIFOUNDRNMSK_M  (USB_OTGHS_DIEPEACHMSK4_TXFIFOUNDRNMSK_V << USB_OTGHS_DIEPEACHMSK4_TXFIFOUNDRNMSK_S)
#define USB_OTGHS_DIEPEACHMSK4_TXFIFOUNDRNMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK4_TXFIFOUNDRNMSK_S  8
/** USB_OTGHS_DIEPEACHMSK4_BNAININTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BNAInIntrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK4_BNAININTRMSK    (BIT(9))
#define USB_OTGHS_DIEPEACHMSK4_BNAININTRMSK_M  (USB_OTGHS_DIEPEACHMSK4_BNAININTRMSK_V << USB_OTGHS_DIEPEACHMSK4_BNAININTRMSK_S)
#define USB_OTGHS_DIEPEACHMSK4_BNAININTRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK4_BNAININTRMSK_S  9
/** USB_OTGHS_DIEPEACHMSK4_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DIEPEACHMSK4_NAKMSK    (BIT(13))
#define USB_OTGHS_DIEPEACHMSK4_NAKMSK_M  (USB_OTGHS_DIEPEACHMSK4_NAKMSK_V << USB_OTGHS_DIEPEACHMSK4_NAKMSK_S)
#define USB_OTGHS_DIEPEACHMSK4_NAKMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK4_NAKMSK_S  13

