espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_DIEPEACHMSK5_REG register
 *  This register contains the interrupts for the IN Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DIEPEACHMSK5_REG (DR_REG_USB_OTGHS_BASE + 0x854)
/** USB_OTGHS_DIEPEACHMSK5_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DIEPEACHMSK5_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DIEPEACHMSK5_XFERCOMPLMSK_M  (USB_OTGHS_DIEPEACHMSK5_XFERCOMPLMSK_V << USB_OTGHS_DIEPEACHMSK5_XFERCOMPLMSK_S)
#define USB_OTGHS_DIEPEACHMSK5_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK5_XFERCOMPLMSK_S  0
/** USB_OTGHS_DIEPEACHMSK5_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DIEPEACHMSK5_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DIEPEACHMSK5_EPDISBLDMSK_M  (USB_OTGHS_DIEPEACHMSK5_EPDISBLDMSK_V << USB_OTGHS_DIEPEACHMSK5_EPDISBLDMSK_S)
#define USB_OTGHS_DIEPEACHMSK5_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK5_EPDISBLDMSK_S  1
/** USB_OTGHS_DIEPEACHMSK5_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error Mask (AHBErrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK5_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DIEPEACHMSK5_AHBERRMSK_M  (USB_OTGHS_DIEPEACHMSK5_AHBERRMSK_V << USB_OTGHS_DIEPEACHMSK5_AHBERRMSK_S)
#define USB_OTGHS_DIEPEACHMSK5_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK5_AHBERRMSK_S  2
/** USB_OTGHS_DIEPEACHMSK5_TIMEOUTMSK : R/W; bitpos: [3]; default: 0;
 *  Timeout Condition Mask (TimeOUTMsk)
 *  (Non-isochronous endpoints)
 */
#define USB_OTGHS_DIEPEACHMSK5_TIMEOUTMSK    (BIT(3))
#define USB_OTGHS_DIEPEACHMSK5_TIMEOUTMSK_M  (USB_OTGHS_DIEPEACHMSK5_TIMEOUTMSK_V << USB_OTGHS_DIEPEACHMSK5_TIMEOUTMSK_S)
#define USB_OTGHS_DIEPEACHMSK5_TIMEOUTMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK5_TIMEOUTMSK_S  3
/** USB_OTGHS_DIEPEACHMSK5_INTKNTXFEMPMSK : R/W; bitpos: [4]; default: 0;
 *  IN Token Received When TxFIFO Empty Mask(INTknTXFEmpMsk)
 */
#define USB_OTGHS_DIEPEACHMSK5_INTKNTXFEMPMSK    (BIT(4))
#define USB_OTGHS_DIEPEACHMSK5_INTKNTXFEMPMSK_M  (USB_OTGHS_DIEPEACHMSK5_INTKNTXFEMPMSK_V << USB_OTGHS_DIEPEACHMSK5_INTKNTXFEMPMSK_S)
#define USB_OTGHS_DIEPEACHMSK5_INTKNTXFEMPMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK5_INTKNTXFEMPMSK_S  4
/** USB_OTGHS_DIEPEACHMSK5_INTKNEPMISMSK : R/W; bitpos: [5]; default: 0;
 *  IN Token received with EP Mismatch Mask (INTknEPMisMsk)
 */
#define USB_OTGHS_DIEPEACHMSK5_INTKNEPMISMSK    (BIT(5))
#define USB_OTGHS_DIEPEACHMSK5_INTKNEPMISMSK_M  (USB_OTGHS_DIEPEACHMSK5_INTKNEPMISMSK_V << USB_OTGHS_DIEPEACHMSK5_INTKNEPMISMSK_S)
#define USB_OTGHS_DIEPEACHMSK5_INTKNEPMISMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK5_INTKNEPMISMSK_S  5
/** USB_OTGHS_DIEPEACHMSK5_INEPNAKEFFMSK : R/W; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective Mask (INEPNakEffMsk)
 */
#define USB_OTGHS_DIEPEACHMSK5_INEPNAKEFFMSK    (BIT(6))
#define USB_OTGHS_DIEPEACHMSK5_INEPNAKEFFMSK_M  (USB_OTGHS_DIEPEACHMSK5_INEPNAKEFFMSK_V << USB_OTGHS_DIEPEACHMSK5_INEPNAKEFFMSK_S)
#define USB_OTGHS_DIEPEACHMSK5_INEPNAKEFFMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK5_INEPNAKEFFMSK_S  6
/** USB_OTGHS_DIEPEACHMSK5_TXFIFOUNDRNMSK : R/W; bitpos: [8]; default: 0;
 *  Fifo Underrun Mask (TxfifoUndrnMsk)
 */
#define USB_OTGHS_DIEPEACHMSK5_TXFIFOUNDRNMSK    (BIT(8))
#define USB_OTGHS_DIEPEACHMSK5_TXFIFOUNDRNMSK_M  (USB_OTGHS_DIEPEACHMSK5_TXFIFOUNDRNMSK_V << USB_OTGHS_DIEPEACHMSK5_TXFIFOUNDRNMSK_S)
#define USB_OTGHS_DIEPEACHMSK5_TXFIFOUNDRNMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK5_TXFIFOUNDRNMSK_S  8
/** USB_OTGHS_DIEPEACHMSK5_BNAININTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BNAInIntrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK5_BNAININTRMSK    (BIT(9))
#define USB_OTGHS_DIEPEACHMSK5_BNAININTRMSK_M  (USB_OTGHS_DIEPEACHMSK5_BNAININTRMSK_V << USB_OTGHS_DIEPEACHMSK5_BNAININTRMSK_S)
#define USB_OTGHS_DIEPEACHMSK5_BNAININTRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK5_BNAININTRMSK_S  9
/** USB_OTGHS_DIEPEACHMSK5_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DIEPEACHMSK5_NAKMSK    (BIT(13))
#define USB_OTGHS_DIEPEACHMSK5_NAKMSK_M  (USB_OTGHS_DIEPEACHMSK5_NAKMSK_V << USB_OTGHS_DIEPEACHMSK5_NAKMSK_S)
#define USB_OTGHS_DIEPEACHMSK5_NAKMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK5_NAKMSK_S  13

/** USB_OTGHS_DIEPEACHMSK6_REG register
 *  This register contains the interrupts for the IN Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DIEPEACHMSK6_REG (DR_REG_USB_OTGHS_BASE + 0x858)
/** USB_OTGHS_DIEPEACHMSK6_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DIEPEACHMSK6_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DIEPEACHMSK6_XFERCOMPLMSK_M  (USB_OTGHS_DIEPEACHMSK6_XFERCOMPLMSK_V << USB_OTGHS_DIEPEACHMSK6_XFERCOMPLMSK_S)
#define USB_OTGHS_DIEPEACHMSK6_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK6_XFERCOMPLMSK_S  0
/** USB_OTGHS_DIEPEACHMSK6_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DIEPEACHMSK6_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DIEPEACHMSK6_EPDISBLDMSK_M  (USB_OTGHS_DIEPEACHMSK6_EPDISBLDMSK_V << USB_OTGHS_DIEPEACHMSK6_EPDISBLDMSK_S)
#define USB_OTGHS_DIEPEACHMSK6_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK6_EPDISBLDMSK_S  1
/** USB_OTGHS_DIEPEACHMSK6_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error Mask (AHBErrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK6_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DIEPEACHMSK6_AHBERRMSK_M  (USB_OTGHS_DIEPEACHMSK6_AHBERRMSK_V << USB_OTGHS_DIEPEACHMSK6_AHBERRMSK_S)
#define USB_OTGHS_DIEPEACHMSK6_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK6_AHBERRMSK_S  2
/** USB_OTGHS_DIEPEACHMSK6_TIMEOUTMSK : R/W; bitpos: [3]; default: 0;
 *  Timeout Condition Mask (TimeOUTMsk)
 *  (Non-isochronous endpoints)
 */
#define USB_OTGHS_DIEPEACHMSK6_TIMEOUTMSK    (BIT(3))
#define USB_OTGHS_DIEPEACHMSK6_TIMEOUTMSK_M  (USB_OTGHS_DIEPEACHMSK6_TIMEOUTMSK_V << USB_OTGHS_DIEPEACHMSK6_TIMEOUTMSK_S)
#define USB_OTGHS_DIEPEACHMSK6_TIMEOUTMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK6_TIMEOUTMSK_S  3
/** USB_OTGHS_DIEPEACHMSK6_INTKNTXFEMPMSK : R/W; bitpos: [4]; default: 0;
 *  IN Token Received When TxFIFO Empty Mask(INTknTXFEmpMsk)
 */
#define USB_OTGHS_DIEPEACHMSK6_INTKNTXFEMPMSK    (BIT(4))
#define USB_OTGHS_DIEPEACHMSK6_INTKNTXFEMPMSK_M  (USB_OTGHS_DIEPEACHMSK6_INTKNTXFEMPMSK_V << USB_OTGHS_DIEPEACHMSK6_INTKNTXFEMPMSK_S)
#define USB_OTGHS_DIEPEACHMSK6_INTKNTXFEMPMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK6_INTKNTXFEMPMSK_S  4
/** USB_OTGHS_DIEPEACHMSK6_INTKNEPMISMSK : R/W; bitpos: [5]; default: 0;
 *  IN Token received with EP Mismatch Mask (INTknEPMisMsk)
 */
#define USB_OTGHS_DIEPEACHMSK6_INTKNEPMISMSK    (BIT(5))
#define USB_OTGHS_DIEPEACHMSK6_INTKNEPMISMSK_M  (USB_OTGHS_DIEPEACHMSK6_INTKNEPMISMSK_V << USB_OTGHS_DIEPEACHMSK6_INTKNEPMISMSK_S)
#define USB_OTGHS_DIEPEACHMSK6_INTKNEPMISMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK6_INTKNEPMISMSK_S  5
/** USB_OTGHS_DIEPEACHMSK6_INEPNAKEFFMSK : R/W; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective Mask (INEPNakEffMsk)
 */
#define USB_OTGHS_DIEPEACHMSK6_INEPNAKEFFMSK    (BIT(6))
#define USB_OTGHS_DIEPEACHMSK6_INEPNAKEFFMSK_M  (USB_OTGHS_DIEPEACHMSK6_INEPNAKEFFMSK_V << USB_OTGHS_DIEPEACHMSK6_INEPNAKEFFMSK_S)
#define USB_OTGHS_DIEPEACHMSK6_INEPNAKEFFMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK6_INEPNAKEFFMSK_S  6
/** USB_OTGHS_DIEPEACHMSK6_TXFIFOUNDRNMSK : R/W; bitpos: [8]; default: 0;
 *  Fifo Underrun Mask (TxfifoUndrnMsk)
 */
#define USB_OTGHS_DIEPEACHMSK6_TXFIFOUNDRNMSK    (BIT(8))
#define USB_OTGHS_DIEPEACHMSK6_TXFIFOUNDRNMSK_M  (USB_OTGHS_DIEPEACHMSK6_TXFIFOUNDRNMSK_V << USB_OTGHS_DIEPEACHMSK6_TXFIFOUNDRNMSK_S)
#define USB_OTGHS_DIEPEACHMSK6_TXFIFOUNDRNMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK6_TXFIFOUNDRNMSK_S  8
/** USB_OTGHS_DIEPEACHMSK6_BNAININTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BNAInIntrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK6_BNAININTRMSK    (BIT(9))
#define USB_OTGHS_DIEPEACHMSK6_BNAININTRMSK_M  (USB_OTGHS_DIEPEACHMSK6_BNAININTRMSK_V << USB_OTGHS_DIEPEACHMSK6_BNAININTRMSK_S)
#define USB_OTGHS_DIEPEACHMSK6_BNAININTRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK6_BNAININTRMSK_S  9
/** USB_OTGHS_DIEPEACHMSK6_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DIEPEACHMSK6_NAKMSK    (BIT(13))
#define USB_OTGHS_DIEPEACHMSK6_NAKMSK_M  (USB_OTGHS_DIEPEACHMSK6_NAKMSK_V << USB_OTGHS_DIEPEACHMSK6_NAKMSK_S)
#define USB_OTGHS_DIEPEACHMSK6_NAKMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK6_NAKMSK_S  13

