espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_DIEPEACHMSK9_REG register
 *  This register contains the interrupts for the IN Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DIEPEACHMSK9_REG (DR_REG_USB_OTGHS_BASE + 0x864)
/** USB_OTGHS_DIEPEACHMSK9_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DIEPEACHMSK9_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DIEPEACHMSK9_XFERCOMPLMSK_M  (USB_OTGHS_DIEPEACHMSK9_XFERCOMPLMSK_V << USB_OTGHS_DIEPEACHMSK9_XFERCOMPLMSK_S)
#define USB_OTGHS_DIEPEACHMSK9_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK9_XFERCOMPLMSK_S  0
/** USB_OTGHS_DIEPEACHMSK9_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DIEPEACHMSK9_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DIEPEACHMSK9_EPDISBLDMSK_M  (USB_OTGHS_DIEPEACHMSK9_EPDISBLDMSK_V << USB_OTGHS_DIEPEACHMSK9_EPDISBLDMSK_S)
#define USB_OTGHS_DIEPEACHMSK9_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK9_EPDISBLDMSK_S  1
/** USB_OTGHS_DIEPEACHMSK9_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error Mask (AHBErrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK9_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DIEPEACHMSK9_AHBERRMSK_M  (USB_OTGHS_DIEPEACHMSK9_AHBERRMSK_V << USB_OTGHS_DIEPEACHMSK9_AHBERRMSK_S)
#define USB_OTGHS_DIEPEACHMSK9_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK9_AHBERRMSK_S  2
/** USB_OTGHS_DIEPEACHMSK9_TIMEOUTMSK : R/W; bitpos: [3]; default: 0;
 *  Timeout Condition Mask (TimeOUTMsk)
 *  (Non-isochronous endpoints)
 */
#define USB_OTGHS_DIEPEACHMSK9_TIMEOUTMSK    (BIT(3))
#define USB_OTGHS_DIEPEACHMSK9_TIMEOUTMSK_M  (USB_OTGHS_DIEPEACHMSK9_TIMEOUTMSK_V << USB_OTGHS_DIEPEACHMSK9_TIMEOUTMSK_S)
#define USB_OTGHS_DIEPEACHMSK9_TIMEOUTMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK9_TIMEOUTMSK_S  3
/** USB_OTGHS_DIEPEACHMSK9_INTKNTXFEMPMSK : R/W; bitpos: [4]; default: 0;
 *  IN Token Received When TxFIFO Empty Mask(INTknTXFEmpMsk)
 */
#define USB_OTGHS_DIEPEACHMSK9_INTKNTXFEMPMSK    (BIT(4))
#define USB_OTGHS_DIEPEACHMSK9_INTKNTXFEMPMSK_M  (USB_OTGHS_DIEPEACHMSK9_INTKNTXFEMPMSK_V << USB_OTGHS_DIEPEACHMSK9_INTKNTXFEMPMSK_S)
#define USB_OTGHS_DIEPEACHMSK9_INTKNTXFEMPMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK9_INTKNTXFEMPMSK_S  4
/** USB_OTGHS_DIEPEACHMSK9_INTKNEPMISMSK : R/W; bitpos: [5]; default: 0;
 *  IN Token received with EP Mismatch Mask (INTknEPMisMsk)
 */
#define USB_OTGHS_DIEPEACHMSK9_INTKNEPMISMSK    (BIT(5))
#define USB_OTGHS_DIEPEACHMSK9_INTKNEPMISMSK_M  (USB_OTGHS_DIEPEACHMSK9_INTKNEPMISMSK_V << USB_OTGHS_DIEPEACHMSK9_INTKNEPMISMSK_S)
#define USB_OTGHS_DIEPEACHMSK9_INTKNEPMISMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK9_INTKNEPMISMSK_S  5
/** USB_OTGHS_DIEPEACHMSK9_INEPNAKEFFMSK : R/W; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective Mask (INEPNakEffMsk)
 */
#define USB_OTGHS_DIEPEACHMSK9_INEPNAKEFFMSK    (BIT(6))
#define USB_OTGHS_DIEPEACHMSK9_INEPNAKEFFMSK_M  (USB_OTGHS_DIEPEACHMSK9_INEPNAKEFFMSK_V << USB_OTGHS_DIEPEACHMSK9_INEPNAKEFFMSK_S)
#define USB_OTGHS_DIEPEACHMSK9_INEPNAKEFFMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK9_INEPNAKEFFMSK_S  6
/** USB_OTGHS_DIEPEACHMSK9_TXFIFOUNDRNMSK : R/W; bitpos: [8]; default: 0;
 *  Fifo Underrun Mask (TxfifoUndrnMsk)
 */
#define USB_OTGHS_DIEPEACHMSK9_TXFIFOUNDRNMSK    (BIT(8))
#define USB_OTGHS_DIEPEACHMSK9_TXFIFOUNDRNMSK_M  (USB_OTGHS_DIEPEACHMSK9_TXFIFOUNDRNMSK_V << USB_OTGHS_DIEPEACHMSK9_TXFIFOUNDRNMSK_S)
#define USB_OTGHS_DIEPEACHMSK9_TXFIFOUNDRNMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK9_TXFIFOUNDRNMSK_S  8
/** USB_OTGHS_DIEPEACHMSK9_BNAININTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BNAInIntrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK9_BNAININTRMSK    (BIT(9))
#define USB_OTGHS_DIEPEACHMSK9_BNAININTRMSK_M  (USB_OTGHS_DIEPEACHMSK9_BNAININTRMSK_V << USB_OTGHS_DIEPEACHMSK9_BNAININTRMSK_S)
#define USB_OTGHS_DIEPEACHMSK9_BNAININTRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK9_BNAININTRMSK_S  9
/** USB_OTGHS_DIEPEACHMSK9_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DIEPEACHMSK9_NAKMSK    (BIT(13))
#define USB_OTGHS_DIEPEACHMSK9_NAKMSK_M  (USB_OTGHS_DIEPEACHMSK9_NAKMSK_V << USB_OTGHS_DIEPEACHMSK9_NAKMSK_S)
#define USB_OTGHS_DIEPEACHMSK9_NAKMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK9_NAKMSK_S  13

/** USB_OTGHS_DIEPEACHMSK10_REG register
 *  This register contains the interrupts for the IN Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DIEPEACHMSK10_REG (DR_REG_USB_OTGHS_BASE + 0x868)
/** USB_OTGHS_DIEPEACHMSK10_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DIEPEACHMSK10_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DIEPEACHMSK10_XFERCOMPLMSK_M  (USB_OTGHS_DIEPEACHMSK10_XFERCOMPLMSK_V << USB_OTGHS_DIEPEACHMSK10_XFERCOMPLMSK_S)
#define USB_OTGHS_DIEPEACHMSK10_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK10_XFERCOMPLMSK_S  0
/** USB_OTGHS_DIEPEACHMSK10_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DIEPEACHMSK10_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DIEPEACHMSK10_EPDISBLDMSK_M  (USB_OTGHS_DIEPEACHMSK10_EPDISBLDMSK_V << USB_OTGHS_DIEPEACHMSK10_EPDISBLDMSK_S)
#define USB_OTGHS_DIEPEACHMSK10_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK10_EPDISBLDMSK_S  1
/** USB_OTGHS_DIEPEACHMSK10_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error Mask (AHBErrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK10_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DIEPEACHMSK10_AHBERRMSK_M  (USB_OTGHS_DIEPEACHMSK10_AHBERRMSK_V << USB_OTGHS_DIEPEACHMSK10_AHBERRMSK_S)
#define USB_OTGHS_DIEPEACHMSK10_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK10_AHBERRMSK_S  2
/** USB_OTGHS_DIEPEACHMSK10_TIMEOUTMSK : R/W; bitpos: [3]; default: 0;
 *  Timeout Condition Mask (TimeOUTMsk)
 *  (Non-isochronous endpoints)
 */
#define USB_OTGHS_DIEPEACHMSK10_TIMEOUTMSK    (BIT(3))
#define USB_OTGHS_DIEPEACHMSK10_TIMEOUTMSK_M  (USB_OTGHS_DIEPEACHMSK10_TIMEOUTMSK_V << USB_OTGHS_DIEPEACHMSK10_TIMEOUTMSK_S)
#define USB_OTGHS_DIEPEACHMSK10_TIMEOUTMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK10_TIMEOUTMSK_S  3
/** USB_OTGHS_DIEPEACHMSK10_INTKNTXFEMPMSK : R/W; bitpos: [4]; default: 0;
 *  IN Token Received When TxFIFO Empty Mask(INTknTXFEmpMsk)
 */
#define USB_OTGHS_DIEPEACHMSK10_INTKNTXFEMPMSK    (BIT(4))
#define USB_OTGHS_DIEPEACHMSK10_INTKNTXFEMPMSK_M  (USB_OTGHS_DIEPEACHMSK10_INTKNTXFEMPMSK_V << USB_OTGHS_DIEPEACHMSK10_INTKNTXFEMPMSK_S)
#define USB_OTGHS_DIEPEACHMSK10_INTKNTXFEMPMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK10_INTKNTXFEMPMSK_S  4
/** USB_OTGHS_DIEPEACHMSK10_INTKNEPMISMSK : R/W; bitpos: [5]; default: 0;
 *  IN Token received with EP Mismatch Mask (INTknEPMisMsk)
 */
#define USB_OTGHS_DIEPEACHMSK10_INTKNEPMISMSK    (BIT(5))
#define USB_OTGHS_DIEPEACHMSK10_INTKNEPMISMSK_M  (USB_OTGHS_DIEPEACHMSK10_INTKNEPMISMSK_V << USB_OTGHS_DIEPEACHMSK10_INTKNEPMISMSK_S)
#define USB_OTGHS_DIEPEACHMSK10_INTKNEPMISMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK10_INTKNEPMISMSK_S  5
/** USB_OTGHS_DIEPEACHMSK10_INEPNAKEFFMSK : R/W; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective Mask (INEPNakEffMsk)
 */
#define USB_OTGHS_DIEPEACHMSK10_INEPNAKEFFMSK    (BIT(6))
#define USB_OTGHS_DIEPEACHMSK10_INEPNAKEFFMSK_M  (USB_OTGHS_DIEPEACHMSK10_INEPNAKEFFMSK_V << USB_OTGHS_DIEPEACHMSK10_INEPNAKEFFMSK_S)
#define USB_OTGHS_DIEPEACHMSK10_INEPNAKEFFMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK10_INEPNAKEFFMSK_S  6
/** USB_OTGHS_DIEPEACHMSK10_TXFIFOUNDRNMSK : R/W; bitpos: [8]; default: 0;
 *  Fifo Underrun Mask (TxfifoUndrnMsk)
 */
#define USB_OTGHS_DIEPEACHMSK10_TXFIFOUNDRNMSK    (BIT(8))
#define USB_OTGHS_DIEPEACHMSK10_TXFIFOUNDRNMSK_M  (USB_OTGHS_DIEPEACHMSK10_TXFIFOUNDRNMSK_V << USB_OTGHS_DIEPEACHMSK10_TXFIFOUNDRNMSK_S)
#define USB_OTGHS_DIEPEACHMSK10_TXFIFOUNDRNMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK10_TXFIFOUNDRNMSK_S  8
/** USB_OTGHS_DIEPEACHMSK10_BNAININTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BNAInIntrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK10_BNAININTRMSK    (BIT(9))
#define USB_OTGHS_DIEPEACHMSK10_BNAININTRMSK_M  (USB_OTGHS_DIEPEACHMSK10_BNAININTRMSK_V << USB_OTGHS_DIEPEACHMSK10_BNAININTRMSK_S)
#define USB_OTGHS_DIEPEACHMSK10_BNAININTRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK10_BNAININTRMSK_S  9
/** USB_OTGHS_DIEPEACHMSK10_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DIEPEACHMSK10_NAKMSK    (BIT(13))
#define USB_OTGHS_DIEPEACHMSK10_NAKMSK_M  (USB_OTGHS_DIEPEACHMSK10_NAKMSK_V << USB_OTGHS_DIEPEACHMSK10_NAKMSK_S)
#define USB_OTGHS_DIEPEACHMSK10_NAKMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK10_NAKMSK_S  13

/** USB_OTGHS_DIEPEACHMSK11_REG register
 *  This register contains the interrupts for the IN Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DIEPEACHMSK11_REG (DR_REG_USB_OTGHS_BASE + 0x86c)
/** USB_OTGHS_DIEPEACHMSK11_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DIEPEACHMSK11_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DIEPEACHMSK11_XFERCOMPLMSK_M  (USB_OTGHS_DIEPEACHMSK11_XFERCOMPLMSK_V << USB_OTGHS_DIEPEACHMSK11_XFERCOMPLMSK_S)
#define USB_OTGHS_DIEPEACHMSK11_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK11_XFERCOMPLMSK_S  0
/** USB_OTGHS_DIEPEACHMSK11_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DIEPEACHMSK11_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DIEPEACHMSK11_EPDISBLDMSK_M  (USB_OTGHS_DIEPEACHMSK11_EPDISBLDMSK_V << USB_OTGHS_DIEPEACHMSK11_EPDISBLDMSK_S)
#define USB_OTGHS_DIEPEACHMSK11_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK11_EPDISBLDMSK_S  1
/** USB_OTGHS_DIEPEACHMSK11_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error Mask (AHBErrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK11_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DIEPEACHMSK11_AHBERRMSK_M  (USB_OTGHS_DIEPEACHMSK11_AHBERRMSK_V << USB_OTGHS_DIEPEACHMSK11_AHBERRMSK_S)
#define USB_OTGHS_DIEPEACHMSK11_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK11_AHBERRMSK_S  2
/** USB_OTGHS_DIEPEACHMSK11_TIMEOUTMSK : R/W; bitpos: [3]; default: 0;
 *  Timeout Condition Mask (TimeOUTMsk)
 *  (Non-isochronous endpoints)
 */
#define USB_OTGHS_DIEPEACHMSK11_TIMEOUTMSK    (BIT(3))
#define USB_OTGHS_DIEPEACHMSK11_TIMEOUTMSK_M  (USB_OTGHS_DIEPEACHMSK11_TIMEOUTMSK_V << USB_OTGHS_DIEPEACHMSK11_TIMEOUTMSK_S)
#define USB_OTGHS_DIEPEACHMSK11_TIMEOUTMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK11_TIMEOUTMSK_S  3
/** USB_OTGHS_DIEPEACHMSK11_INTKNTXFEMPMSK : R/W; bitpos: [4]; default: 0;
 *  IN Token Received When TxFIFO Empty Mask(INTknTXFEmpMsk)
 */
#define USB_OTGHS_DIEPEACHMSK11_INTKNTXFEMPMSK    (BIT(4))
#define USB_OTGHS_DIEPEACHMSK11_INTKNTXFEMPMSK_M  (USB_OTGHS_DIEPEACHMSK11_INTKNTXFEMPMSK_V << USB_OTGHS_DIEPEACHMSK11_INTKNTXFEMPMSK_S)
#define USB_OTGHS_DIEPEACHMSK11_INTKNTXFEMPMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK11_INTKNTXFEMPMSK_S  4
/** USB_OTGHS_DIEPEACHMSK11_INTKNEPMISMSK : R/W; bitpos: [5]; default: 0;
 *  IN Token received with EP Mismatch Mask (INTknEPMisMsk)
 */
#define USB_OTGHS_DIEPEACHMSK11_INTKNEPMISMSK    (BIT(5))
#define USB_OTGHS_DIEPEACHMSK11_INTKNEPMISMSK_M  (USB_OTGHS_DIEPEACHMSK11_INTKNEPMISMSK_V << USB_OTGHS_DIEPEACHMSK11_INTKNEPMISMSK_S)
#define USB_OTGHS_DIEPEACHMSK11_INTKNEPMISMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK11_INTKNEPMISMSK_S  5
/** USB_OTGHS_DIEPEACHMSK11_INEPNAKEFFMSK : R/W; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective Mask (INEPNakEffMsk)
 */
#define USB_OTGHS_DIEPEACHMSK11_INEPNAKEFFMSK    (BIT(6))
#define USB_OTGHS_DIEPEACHMSK11_INEPNAKEFFMSK_M  (USB_OTGHS_DIEPEACHMSK11_INEPNAKEFFMSK_V << USB_OTGHS_DIEPEACHMSK11_INEPNAKEFFMSK_S)
#define USB_OTGHS_DIEPEACHMSK11_INEPNAKEFFMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK11_INEPNAKEFFMSK_S  6
/** USB_OTGHS_DIEPEACHMSK11_TXFIFOUNDRNMSK : R/W; bitpos: [8]; default: 0;
 *  Fifo Underrun Mask (TxfifoUndrnMsk)
 */
#define USB_OTGHS_DIEPEACHMSK11_TXFIFOUNDRNMSK    (BIT(8))
#define USB_OTGHS_DIEPEACHMSK11_TXFIFOUNDRNMSK_M  (USB_OTGHS_DIEPEACHMSK11_TXFIFOUNDRNMSK_V << USB_OTGHS_DIEPEACHMSK11_TXFIFOUNDRNMSK_S)
#define USB_OTGHS_DIEPEACHMSK11_TXFIFOUNDRNMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK11_TXFIFOUNDRNMSK_S  8
/** USB_OTGHS_DIEPEACHMSK11_BNAININTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BNAInIntrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK11_BNAININTRMSK    (BIT(9))
#define USB_OTGHS_DIEPEACHMSK11_BNAININTRMSK_M  (USB_OTGHS_DIEPEACHMSK11_BNAININTRMSK_V << USB_OTGHS_DIEPEACHMSK11_BNAININTRMSK_S)
#define USB_OTGHS_DIEPEACHMSK11_BNAININTRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK11_BNAININTRMSK_S  9
/** USB_OTGHS_DIEPEACHMSK11_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DIEPEACHMSK11_NAKMSK    (BIT(13))
#define USB_OTGHS_DIEPEACHMSK11_NAKMSK_M  (USB_OTGHS_DIEPEACHMSK11_NAKMSK_V << USB_OTGHS_DIEPEACHMSK11_NAKMSK_S)
#define USB_OTGHS_DIEPEACHMSK11_NAKMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK11_NAKMSK_S  13

/** USB_OTGHS_DIEPEACHMSK12_REG register
 *  This register contains the interrupts for the IN Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DIEPEACHMSK12_REG (DR_REG_USB_OTGHS_BASE + 0x870)
/** USB_OTGHS_DIEPEACHMSK12_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DIEPEACHMSK12_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DIEPEACHMSK12_XFERCOMPLMSK_M  (USB_OTGHS_DIEPEACHMSK12_XFERCOMPLMSK_V << USB_OTGHS_DIEPEACHMSK12_XFERCOMPLMSK_S)
#define USB_OTGHS_DIEPEACHMSK12_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK12_XFERCOMPLMSK_S  0
/** USB_OTGHS_DIEPEACHMSK12_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DIEPEACHMSK12_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DIEPEACHMSK12_EPDISBLDMSK_M  (USB_OTGHS_DIEPEACHMSK12_EPDISBLDMSK_V << USB_OTGHS_DIEPEACHMSK12_EPDISBLDMSK_S)
#define USB_OTGHS_DIEPEACHMSK12_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK12_EPDISBLDMSK_S  1
/** USB_OTGHS_DIEPEACHMSK12_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error Mask (AHBErrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK12_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DIEPEACHMSK12_AHBERRMSK_M  (USB_OTGHS_DIEPEACHMSK12_AHBERRMSK_V << USB_OTGHS_DIEPEACHMSK12_AHBERRMSK_S)
#define USB_OTGHS_DIEPEACHMSK12_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK12_AHBERRMSK_S  2
/** USB_OTGHS_DIEPEACHMSK12_TIMEOUTMSK : R/W; bitpos: [3]; default: 0;
 *  Timeout Condition Mask (TimeOUTMsk)
 *  (Non-isochronous endpoints)
 */
#define USB_OTGHS_DIEPEACHMSK12_TIMEOUTMSK    (BIT(3))
#define USB_OTGHS_DIEPEACHMSK12_TIMEOUTMSK_M  (USB_OTGHS_DIEPEACHMSK12_TIMEOUTMSK_V << USB_OTGHS_DIEPEACHMSK12_TIMEOUTMSK_S)
#define USB_OTGHS_DIEPEACHMSK12_TIMEOUTMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK12_TIMEOUTMSK_S  3
/** USB_OTGHS_DIEPEACHMSK12_INTKNTXFEMPMSK : R/W; bitpos: [4]; default: 0;
 *  IN Token Received When TxFIFO Empty Mask(INTknTXFEmpMsk)
 */
#define USB_OTGHS_DIEPEACHMSK12_INTKNTXFEMPMSK    (BIT(4))
#define USB_OTGHS_DIEPEACHMSK12_INTKNTXFEMPMSK_M  (USB_OTGHS_DIEPEACHMSK12_INTKNTXFEMPMSK_V << USB_OTGHS_DIEPEACHMSK12_INTKNTXFEMPMSK_S)
#define USB_OTGHS_DIEPEACHMSK12_INTKNTXFEMPMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK12_INTKNTXFEMPMSK_S  4
/** USB_OTGHS_DIEPEACHMSK12_INTKNEPMISMSK : R/W; bitpos: [5]; default: 0;
 *  IN Token received with EP Mismatch Mask (INTknEPMisMsk)
 */
#define USB_OTGHS_DIEPEACHMSK12_INTKNEPMISMSK    (BIT(5))
#define USB_OTGHS_DIEPEACHMSK12_INTKNEPMISMSK_M  (USB_OTGHS_DIEPEACHMSK12_INTKNEPMISMSK_V << USB_OTGHS_DIEPEACHMSK12_INTKNEPMISMSK_S)
#define USB_OTGHS_DIEPEACHMSK12_INTKNEPMISMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK12_INTKNEPMISMSK_S  5
/** USB_OTGHS_DIEPEACHMSK12_INEPNAKEFFMSK : R/W; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective Mask (INEPNakEffMsk)
 */
#define USB_OTGHS_DIEPEACHMSK12_INEPNAKEFFMSK    (BIT(6))
#define USB_OTGHS_DIEPEACHMSK12_INEPNAKEFFMSK_M  (USB_OTGHS_DIEPEACHMSK12_INEPNAKEFFMSK_V << USB_OTGHS_DIEPEACHMSK12_INEPNAKEFFMSK_S)
#define USB_OTGHS_DIEPEACHMSK12_INEPNAKEFFMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK12_INEPNAKEFFMSK_S  6
/** USB_OTGHS_DIEPEACHMSK12_TXFIFOUNDRNMSK : R/W; bitpos: [8]; default: 0;
 *  Fifo Underrun Mask (TxfifoUndrnMsk)
 */
#define USB_OTGHS_DIEPEACHMSK12_TXFIFOUNDRNMSK    (BIT(8))
#define USB_OTGHS_DIEPEACHMSK12_TXFIFOUNDRNMSK_M  (USB_OTGHS_DIEPEACHMSK12_TXFIFOUNDRNMSK_V << USB_OTGHS_DIEPEACHMSK12_TXFIFOUNDRNMSK_S)
#define USB_OTGHS_DIEPEACHMSK12_TXFIFOUNDRNMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK12_TXFIFOUNDRNMSK_S  8
/** USB_OTGHS_DIEPEACHMSK12_BNAININTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BNAInIntrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK12_BNAININTRMSK    (BIT(9))
#define USB_OTGHS_DIEPEACHMSK12_BNAININTRMSK_M  (USB_OTGHS_DIEPEACHMSK12_BNAININTRMSK_V << USB_OTGHS_DIEPEACHMSK12_BNAININTRMSK_S)
#define USB_OTGHS_DIEPEACHMSK12_BNAININTRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK12_BNAININTRMSK_S  9
/** USB_OTGHS_DIEPEACHMSK12_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DIEPEACHMSK12_NAKMSK    (BIT(13))
#define USB_OTGHS_DIEPEACHMSK12_NAKMSK_M  (USB_OTGHS_DIEPEACHMSK12_NAKMSK_V << USB_OTGHS_DIEPEACHMSK12_NAKMSK_S)
#define USB_OTGHS_DIEPEACHMSK12_NAKMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK12_NAKMSK_S  13

/** USB_OTGHS_DIEPEACHMSK13_REG register
 *  This register contains the interrupts for the IN Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DIEPEACHMSK13_REG (DR_REG_USB_OTGHS_BASE + 0x874)
/** USB_OTGHS_DIEPEACHMSK13_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DIEPEACHMSK13_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DIEPEACHMSK13_XFERCOMPLMSK_M  (USB_OTGHS_DIEPEACHMSK13_XFERCOMPLMSK_V << USB_OTGHS_DIEPEACHMSK13_XFERCOMPLMSK_S)
#define USB_OTGHS_DIEPEACHMSK13_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK13_XFERCOMPLMSK_S  0
/** USB_OTGHS_DIEPEACHMSK13_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DIEPEACHMSK13_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DIEPEACHMSK13_EPDISBLDMSK_M  (USB_OTGHS_DIEPEACHMSK13_EPDISBLDMSK_V << USB_OTGHS_DIEPEACHMSK13_EPDISBLDMSK_S)
#define USB_OTGHS_DIEPEACHMSK13_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK13_EPDISBLDMSK_S  1
/** USB_OTGHS_DIEPEACHMSK13_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error Mask (AHBErrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK13_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DIEPEACHMSK13_AHBERRMSK_M  (USB_OTGHS_DIEPEACHMSK13_AHBERRMSK_V << USB_OTGHS_DIEPEACHMSK13_AHBERRMSK_S)
#define USB_OTGHS_DIEPEACHMSK13_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK13_AHBERRMSK_S  2
/** USB_OTGHS_DIEPEACHMSK13_TIMEOUTMSK : R/W; bitpos: [3]; default: 0;
 *  Timeout Condition Mask (TimeOUTMsk)
 *  (Non-isochronous endpoints)
 */
#define USB_OTGHS_DIEPEACHMSK13_TIMEOUTMSK    (BIT(3))
#define USB_OTGHS_DIEPEACHMSK13_TIMEOUTMSK_M  (USB_OTGHS_DIEPEACHMSK13_TIMEOUTMSK_V << USB_OTGHS_DIEPEACHMSK13_TIMEOUTMSK_S)
#define USB_OTGHS_DIEPEACHMSK13_TIMEOUTMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK13_TIMEOUTMSK_S  3
/** USB_OTGHS_DIEPEACHMSK13_INTKNTXFEMPMSK : R/W; bitpos: [4]; default: 0;
 *  IN Token Received When TxFIFO Empty Mask(INTknTXFEmpMsk)
 */
#define USB_OTGHS_DIEPEACHMSK13_INTKNTXFEMPMSK    (BIT(4))
#define USB_OTGHS_DIEPEACHMSK13_INTKNTXFEMPMSK_M  (USB_OTGHS_DIEPEACHMSK13_INTKNTXFEMPMSK_V << USB_OTGHS_DIEPEACHMSK13_INTKNTXFEMPMSK_S)
#define USB_OTGHS_DIEPEACHMSK13_INTKNTXFEMPMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK13_INTKNTXFEMPMSK_S  4
/** USB_OTGHS_DIEPEACHMSK13_INTKNEPMISMSK : R/W; bitpos: [5]; default: 0;
 *  IN Token received with EP Mismatch Mask (INTknEPMisMsk)
 */
#define USB_OTGHS_DIEPEACHMSK13_INTKNEPMISMSK    (BIT(5))
#define USB_OTGHS_DIEPEACHMSK13_INTKNEPMISMSK_M  (USB_OTGHS_DIEPEACHMSK13_INTKNEPMISMSK_V << USB_OTGHS_DIEPEACHMSK13_INTKNEPMISMSK_S)
#define USB_OTGHS_DIEPEACHMSK13_INTKNEPMISMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK13_INTKNEPMISMSK_S  5
/** USB_OTGHS_DIEPEACHMSK13_INEPNAKEFFMSK : R/W; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective Mask (INEPNakEffMsk)
 */
#define USB_OTGHS_DIEPEACHMSK13_INEPNAKEFFMSK    (BIT(6))
#define USB_OTGHS_DIEPEACHMSK13_INEPNAKEFFMSK_M  (USB_OTGHS_DIEPEACHMSK13_INEPNAKEFFMSK_V << USB_OTGHS_DIEPEACHMSK13_INEPNAKEFFMSK_S)
#define USB_OTGHS_DIEPEACHMSK13_INEPNAKEFFMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK13_INEPNAKEFFMSK_S  6
/** USB_OTGHS_DIEPEACHMSK13_TXFIFOUNDRNMSK : R/W; bitpos: [8]; default: 0;
 *  Fifo Underrun Mask (TxfifoUndrnMsk)
 */
#define USB_OTGHS_DIEPEACHMSK13_TXFIFOUNDRNMSK    (BIT(8))
#define USB_OTGHS_DIEPEACHMSK13_TXFIFOUNDRNMSK_M  (USB_OTGHS_DIEPEACHMSK13_TXFIFOUNDRNMSK_V << USB_OTGHS_DIEPEACHMSK13_TXFIFOUNDRNMSK_S)
#define USB_OTGHS_DIEPEACHMSK13_TXFIFOUNDRNMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK13_TXFIFOUNDRNMSK_S  8
/** USB_OTGHS_DIEPEACHMSK13_BNAININTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BNAInIntrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK13_BNAININTRMSK    (BIT(9))
#define USB_OTGHS_DIEPEACHMSK13_BNAININTRMSK_M  (USB_OTGHS_DIEPEACHMSK13_BNAININTRMSK_V << USB_OTGHS_DIEPEACHMSK13_BNAININTRMSK_S)
#define USB_OTGHS_DIEPEACHMSK13_BNAININTRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK13_BNAININTRMSK_S  9
/** USB_OTGHS_DIEPEACHMSK13_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DIEPEACHMSK13_NAKMSK    (BIT(13))
#define USB_OTGHS_DIEPEACHMSK13_NAKMSK_M  (USB_OTGHS_DIEPEACHMSK13_NAKMSK_V << USB_OTGHS_DIEPEACHMSK13_NAKMSK_S)
#define USB_OTGHS_DIEPEACHMSK13_NAKMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK13_NAKMSK_S  13

