espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_DIEPEACHMSK14_REG register
 *  This register contains the interrupts for the IN Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DIEPEACHMSK14_REG (DR_REG_USB_OTGHS_BASE + 0x878)
/** USB_OTGHS_DIEPEACHMSK14_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DIEPEACHMSK14_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DIEPEACHMSK14_XFERCOMPLMSK_M  (USB_OTGHS_DIEPEACHMSK14_XFERCOMPLMSK_V << USB_OTGHS_DIEPEACHMSK14_XFERCOMPLMSK_S)
#define USB_OTGHS_DIEPEACHMSK14_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK14_XFERCOMPLMSK_S  0
/** USB_OTGHS_DIEPEACHMSK14_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DIEPEACHMSK14_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DIEPEACHMSK14_EPDISBLDMSK_M  (USB_OTGHS_DIEPEACHMSK14_EPDISBLDMSK_V << USB_OTGHS_DIEPEACHMSK14_EPDISBLDMSK_S)
#define USB_OTGHS_DIEPEACHMSK14_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK14_EPDISBLDMSK_S  1
/** USB_OTGHS_DIEPEACHMSK14_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error Mask (AHBErrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK14_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DIEPEACHMSK14_AHBERRMSK_M  (USB_OTGHS_DIEPEACHMSK14_AHBERRMSK_V << USB_OTGHS_DIEPEACHMSK14_AHBERRMSK_S)
#define USB_OTGHS_DIEPEACHMSK14_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK14_AHBERRMSK_S  2
/** USB_OTGHS_DIEPEACHMSK14_TIMEOUTMSK : R/W; bitpos: [3]; default: 0;
 *  Timeout Condition Mask (TimeOUTMsk)
 *  (Non-isochronous endpoints)
 */
#define USB_OTGHS_DIEPEACHMSK14_TIMEOUTMSK    (BIT(3))
#define USB_OTGHS_DIEPEACHMSK14_TIMEOUTMSK_M  (USB_OTGHS_DIEPEACHMSK14_TIMEOUTMSK_V << USB_OTGHS_DIEPEACHMSK14_TIMEOUTMSK_S)
#define USB_OTGHS_DIEPEACHMSK14_TIMEOUTMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK14_TIMEOUTMSK_S  3
/** USB_OTGHS_DIEPEACHMSK14_INTKNTXFEMPMSK : R/W; bitpos: [4]; default: 0;
 *  IN Token Received When TxFIFO Empty Mask(INTknTXFEmpMsk)
 */
#define USB_OTGHS_DIEPEACHMSK14_INTKNTXFEMPMSK    (BIT(4))
#define USB_OTGHS_DIEPEACHMSK14_INTKNTXFEMPMSK_M  (USB_OTGHS_DIEPEACHMSK14_INTKNTXFEMPMSK_V << USB_OTGHS_DIEPEACHMSK14_INTKNTXFEMPMSK_S)
#define USB_OTGHS_DIEPEACHMSK14_INTKNTXFEMPMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK14_INTKNTXFEMPMSK_S  4
/** USB_OTGHS_DIEPEACHMSK14_INTKNEPMISMSK : R/W; bitpos: [5]; default: 0;
 *  IN Token received with EP Mismatch Mask (INTknEPMisMsk)
 */
#define USB_OTGHS_DIEPEACHMSK14_INTKNEPMISMSK    (BIT(5))
#define USB_OTGHS_DIEPEACHMSK14_INTKNEPMISMSK_M  (USB_OTGHS_DIEPEACHMSK14_INTKNEPMISMSK_V << USB_OTGHS_DIEPEACHMSK14_INTKNEPMISMSK_S)
#define USB_OTGHS_DIEPEACHMSK14_INTKNEPMISMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK14_INTKNEPMISMSK_S  5
/** USB_OTGHS_DIEPEACHMSK14_INEPNAKEFFMSK : R/W; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective Mask (INEPNakEffMsk)
 */
#define USB_OTGHS_DIEPEACHMSK14_INEPNAKEFFMSK    (BIT(6))
#define USB_OTGHS_DIEPEACHMSK14_INEPNAKEFFMSK_M  (USB_OTGHS_DIEPEACHMSK14_INEPNAKEFFMSK_V << USB_OTGHS_DIEPEACHMSK14_INEPNAKEFFMSK_S)
#define USB_OTGHS_DIEPEACHMSK14_INEPNAKEFFMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK14_INEPNAKEFFMSK_S  6
/** USB_OTGHS_DIEPEACHMSK14_TXFIFOUNDRNMSK : R/W; bitpos: [8]; default: 0;
 *  Fifo Underrun Mask (TxfifoUndrnMsk)
 */
#define USB_OTGHS_DIEPEACHMSK14_TXFIFOUNDRNMSK    (BIT(8))
#define USB_OTGHS_DIEPEACHMSK14_TXFIFOUNDRNMSK_M  (USB_OTGHS_DIEPEACHMSK14_TXFIFOUNDRNMSK_V << USB_OTGHS_DIEPEACHMSK14_TXFIFOUNDRNMSK_S)
#define USB_OTGHS_DIEPEACHMSK14_TXFIFOUNDRNMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK14_TXFIFOUNDRNMSK_S  8
/** USB_OTGHS_DIEPEACHMSK14_BNAININTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BNAInIntrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK14_BNAININTRMSK    (BIT(9))
#define USB_OTGHS_DIEPEACHMSK14_BNAININTRMSK_M  (USB_OTGHS_DIEPEACHMSK14_BNAININTRMSK_V << USB_OTGHS_DIEPEACHMSK14_BNAININTRMSK_S)
#define USB_OTGHS_DIEPEACHMSK14_BNAININTRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK14_BNAININTRMSK_S  9
/** USB_OTGHS_DIEPEACHMSK14_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DIEPEACHMSK14_NAKMSK    (BIT(13))
#define USB_OTGHS_DIEPEACHMSK14_NAKMSK_M  (USB_OTGHS_DIEPEACHMSK14_NAKMSK_V << USB_OTGHS_DIEPEACHMSK14_NAKMSK_S)
#define USB_OTGHS_DIEPEACHMSK14_NAKMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK14_NAKMSK_S  13

/** USB_OTGHS_DIEPEACHMSK15_REG register
 *  This register contains the interrupts for the IN Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DIEPEACHMSK15_REG (DR_REG_USB_OTGHS_BASE + 0x87c)
/** USB_OTGHS_DIEPEACHMSK15_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DIEPEACHMSK15_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DIEPEACHMSK15_XFERCOMPLMSK_M  (USB_OTGHS_DIEPEACHMSK15_XFERCOMPLMSK_V << USB_OTGHS_DIEPEACHMSK15_XFERCOMPLMSK_S)
#define USB_OTGHS_DIEPEACHMSK15_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK15_XFERCOMPLMSK_S  0
/** USB_OTGHS_DIEPEACHMSK15_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DIEPEACHMSK15_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DIEPEACHMSK15_EPDISBLDMSK_M  (USB_OTGHS_DIEPEACHMSK15_EPDISBLDMSK_V << USB_OTGHS_DIEPEACHMSK15_EPDISBLDMSK_S)
#define USB_OTGHS_DIEPEACHMSK15_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK15_EPDISBLDMSK_S  1
/** USB_OTGHS_DIEPEACHMSK15_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error Mask (AHBErrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK15_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DIEPEACHMSK15_AHBERRMSK_M  (USB_OTGHS_DIEPEACHMSK15_AHBERRMSK_V << USB_OTGHS_DIEPEACHMSK15_AHBERRMSK_S)
#define USB_OTGHS_DIEPEACHMSK15_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK15_AHBERRMSK_S  2
/** USB_OTGHS_DIEPEACHMSK15_TIMEOUTMSK : R/W; bitpos: [3]; default: 0;
 *  Timeout Condition Mask (TimeOUTMsk)
 *  (Non-isochronous endpoints)
 */
#define USB_OTGHS_DIEPEACHMSK15_TIMEOUTMSK    (BIT(3))
#define USB_OTGHS_DIEPEACHMSK15_TIMEOUTMSK_M  (USB_OTGHS_DIEPEACHMSK15_TIMEOUTMSK_V << USB_OTGHS_DIEPEACHMSK15_TIMEOUTMSK_S)
#define USB_OTGHS_DIEPEACHMSK15_TIMEOUTMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK15_TIMEOUTMSK_S  3
/** USB_OTGHS_DIEPEACHMSK15_INTKNTXFEMPMSK : R/W; bitpos: [4]; default: 0;
 *  IN Token Received When TxFIFO Empty Mask(INTknTXFEmpMsk)
 */
#define USB_OTGHS_DIEPEACHMSK15_INTKNTXFEMPMSK    (BIT(4))
#define USB_OTGHS_DIEPEACHMSK15_INTKNTXFEMPMSK_M  (USB_OTGHS_DIEPEACHMSK15_INTKNTXFEMPMSK_V << USB_OTGHS_DIEPEACHMSK15_INTKNTXFEMPMSK_S)
#define USB_OTGHS_DIEPEACHMSK15_INTKNTXFEMPMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK15_INTKNTXFEMPMSK_S  4
/** USB_OTGHS_DIEPEACHMSK15_INTKNEPMISMSK : R/W; bitpos: [5]; default: 0;
 *  IN Token received with EP Mismatch Mask (INTknEPMisMsk)
 */
#define USB_OTGHS_DIEPEACHMSK15_INTKNEPMISMSK    (BIT(5))
#define USB_OTGHS_DIEPEACHMSK15_INTKNEPMISMSK_M  (USB_OTGHS_DIEPEACHMSK15_INTKNEPMISMSK_V << USB_OTGHS_DIEPEACHMSK15_INTKNEPMISMSK_S)
#define USB_OTGHS_DIEPEACHMSK15_INTKNEPMISMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK15_INTKNEPMISMSK_S  5
/** USB_OTGHS_DIEPEACHMSK15_INEPNAKEFFMSK : R/W; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective Mask (INEPNakEffMsk)
 */
#define USB_OTGHS_DIEPEACHMSK15_INEPNAKEFFMSK    (BIT(6))
#define USB_OTGHS_DIEPEACHMSK15_INEPNAKEFFMSK_M  (USB_OTGHS_DIEPEACHMSK15_INEPNAKEFFMSK_V << USB_OTGHS_DIEPEACHMSK15_INEPNAKEFFMSK_S)
#define USB_OTGHS_DIEPEACHMSK15_INEPNAKEFFMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK15_INEPNAKEFFMSK_S  6
/** USB_OTGHS_DIEPEACHMSK15_TXFIFOUNDRNMSK : R/W; bitpos: [8]; default: 0;
 *  Fifo Underrun Mask (TxfifoUndrnMsk)
 */
#define USB_OTGHS_DIEPEACHMSK15_TXFIFOUNDRNMSK    (BIT(8))
#define USB_OTGHS_DIEPEACHMSK15_TXFIFOUNDRNMSK_M  (USB_OTGHS_DIEPEACHMSK15_TXFIFOUNDRNMSK_V << USB_OTGHS_DIEPEACHMSK15_TXFIFOUNDRNMSK_S)
#define USB_OTGHS_DIEPEACHMSK15_TXFIFOUNDRNMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK15_TXFIFOUNDRNMSK_S  8
/** USB_OTGHS_DIEPEACHMSK15_BNAININTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BNAInIntrMsk)
 */
#define USB_OTGHS_DIEPEACHMSK15_BNAININTRMSK    (BIT(9))
#define USB_OTGHS_DIEPEACHMSK15_BNAININTRMSK_M  (USB_OTGHS_DIEPEACHMSK15_BNAININTRMSK_V << USB_OTGHS_DIEPEACHMSK15_BNAININTRMSK_S)
#define USB_OTGHS_DIEPEACHMSK15_BNAININTRMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK15_BNAININTRMSK_S  9
/** USB_OTGHS_DIEPEACHMSK15_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DIEPEACHMSK15_NAKMSK    (BIT(13))
#define USB_OTGHS_DIEPEACHMSK15_NAKMSK_M  (USB_OTGHS_DIEPEACHMSK15_NAKMSK_V << USB_OTGHS_DIEPEACHMSK15_NAKMSK_S)
#define USB_OTGHS_DIEPEACHMSK15_NAKMSK_V  0x00000001U
#define USB_OTGHS_DIEPEACHMSK15_NAKMSK_S  13

