espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_DOEPEACHMSK0_REG register
 *  This register is available in device mode and only when parameter
 *  OTG_MULTI_PROC_INTRPT=1. These registers are endpoint specific mask registers for
 *  (DOEPINTn). The OUT endpoint interrupt for a specific status in the DOEPINTn
 *  register can be masked by writing 0 to the corresponding bit in this register.
 *  Status bits are masked by default.
 */
#define USB_OTGHS_DOEPEACHMSK0_REG (DR_REG_USB_OTGHS_BASE + 0x880)
/** USB_OTGHS_DOEPEACHMSK0_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DOEPEACHMSK0_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DOEPEACHMSK0_XFERCOMPLMSK_M  (USB_OTGHS_DOEPEACHMSK0_XFERCOMPLMSK_V << USB_OTGHS_DOEPEACHMSK0_XFERCOMPLMSK_S)
#define USB_OTGHS_DOEPEACHMSK0_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK0_XFERCOMPLMSK_S  0
/** USB_OTGHS_DOEPEACHMSK0_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DOEPEACHMSK0_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DOEPEACHMSK0_EPDISBLDMSK_M  (USB_OTGHS_DOEPEACHMSK0_EPDISBLDMSK_V << USB_OTGHS_DOEPEACHMSK0_EPDISBLDMSK_S)
#define USB_OTGHS_DOEPEACHMSK0_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK0_EPDISBLDMSK_S  1
/** USB_OTGHS_DOEPEACHMSK0_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK0_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DOEPEACHMSK0_AHBERRMSK_M  (USB_OTGHS_DOEPEACHMSK0_AHBERRMSK_V << USB_OTGHS_DOEPEACHMSK0_AHBERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK0_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK0_AHBERRMSK_S  2
/** USB_OTGHS_DOEPEACHMSK0_SETUPMSK : R/W; bitpos: [3]; default: 0;
 *  SETUP Phase Done Mask (SetUPMsk)
 *
 *  Applies to control endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK0_SETUPMSK    (BIT(3))
#define USB_OTGHS_DOEPEACHMSK0_SETUPMSK_M  (USB_OTGHS_DOEPEACHMSK0_SETUPMSK_V << USB_OTGHS_DOEPEACHMSK0_SETUPMSK_S)
#define USB_OTGHS_DOEPEACHMSK0_SETUPMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK0_SETUPMSK_S  3
/** USB_OTGHS_DOEPEACHMSK0_OUTTKNEPDISMSK : R/W; bitpos: [4]; default: 0;
 *  OUT Token Received when Endpoint Disabled Mask (OUTTknEPdisMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK0_OUTTKNEPDISMSK    (BIT(4))
#define USB_OTGHS_DOEPEACHMSK0_OUTTKNEPDISMSK_M  (USB_OTGHS_DOEPEACHMSK0_OUTTKNEPDISMSK_V << USB_OTGHS_DOEPEACHMSK0_OUTTKNEPDISMSK_S)
#define USB_OTGHS_DOEPEACHMSK0_OUTTKNEPDISMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK0_OUTTKNEPDISMSK_S  4
/** USB_OTGHS_DOEPEACHMSK0_STSPHSRCVDMSK : R/W; bitpos: [5]; default: 0;
 *  Status Phase Received Mask (StsPhsRcvdMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK0_STSPHSRCVDMSK    (BIT(5))
#define USB_OTGHS_DOEPEACHMSK0_STSPHSRCVDMSK_M  (USB_OTGHS_DOEPEACHMSK0_STSPHSRCVDMSK_V << USB_OTGHS_DOEPEACHMSK0_STSPHSRCVDMSK_S)
#define USB_OTGHS_DOEPEACHMSK0_STSPHSRCVDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK0_STSPHSRCVDMSK_S  5
/** USB_OTGHS_DOEPEACHMSK0_BACK2BACKSETUP : R/W; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received Mask (Back2BackSETup)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK0_BACK2BACKSETUP    (BIT(6))
#define USB_OTGHS_DOEPEACHMSK0_BACK2BACKSETUP_M  (USB_OTGHS_DOEPEACHMSK0_BACK2BACKSETUP_V << USB_OTGHS_DOEPEACHMSK0_BACK2BACKSETUP_S)
#define USB_OTGHS_DOEPEACHMSK0_BACK2BACKSETUP_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK0_BACK2BACKSETUP_S  6
/** USB_OTGHS_DOEPEACHMSK0_OUTPKTERRMSK : R/W; bitpos: [8]; default: 0;
 *  OUT Packet Error Mask (OutPktErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK0_OUTPKTERRMSK    (BIT(8))
#define USB_OTGHS_DOEPEACHMSK0_OUTPKTERRMSK_M  (USB_OTGHS_DOEPEACHMSK0_OUTPKTERRMSK_V << USB_OTGHS_DOEPEACHMSK0_OUTPKTERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK0_OUTPKTERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK0_OUTPKTERRMSK_S  8
/** USB_OTGHS_DOEPEACHMSK0_BNAOUTINTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BnaOutIntrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK0_BNAOUTINTRMSK    (BIT(9))
#define USB_OTGHS_DOEPEACHMSK0_BNAOUTINTRMSK_M  (USB_OTGHS_DOEPEACHMSK0_BNAOUTINTRMSK_V << USB_OTGHS_DOEPEACHMSK0_BNAOUTINTRMSK_S)
#define USB_OTGHS_DOEPEACHMSK0_BNAOUTINTRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK0_BNAOUTINTRMSK_S  9
/** USB_OTGHS_DOEPEACHMSK0_BBLEERRMSK : R/W; bitpos: [12]; default: 0;
 *  Babble Error interrupt Mask (BbleErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK0_BBLEERRMSK    (BIT(12))
#define USB_OTGHS_DOEPEACHMSK0_BBLEERRMSK_M  (USB_OTGHS_DOEPEACHMSK0_BBLEERRMSK_V << USB_OTGHS_DOEPEACHMSK0_BBLEERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK0_BBLEERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK0_BBLEERRMSK_S  12
/** USB_OTGHS_DOEPEACHMSK0_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DOEPEACHMSK0_NAKMSK    (BIT(13))
#define USB_OTGHS_DOEPEACHMSK0_NAKMSK_M  (USB_OTGHS_DOEPEACHMSK0_NAKMSK_V << USB_OTGHS_DOEPEACHMSK0_NAKMSK_S)
#define USB_OTGHS_DOEPEACHMSK0_NAKMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK0_NAKMSK_S  13
/** USB_OTGHS_DOEPEACHMSK0_NYETMSK : R/W; bitpos: [14]; default: 0;
 *  NYET interrupt Mask (NYETMsk)
 */
#define USB_OTGHS_DOEPEACHMSK0_NYETMSK    (BIT(14))
#define USB_OTGHS_DOEPEACHMSK0_NYETMSK_M  (USB_OTGHS_DOEPEACHMSK0_NYETMSK_V << USB_OTGHS_DOEPEACHMSK0_NYETMSK_S)
#define USB_OTGHS_DOEPEACHMSK0_NYETMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK0_NYETMSK_S  14

/** USB_OTGHS_DOEPEACHMSK1_REG register
 *  This register contains the interrupts for the OUT Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DOEPEACHMSK1_REG (DR_REG_USB_OTGHS_BASE + 0x884)
/** USB_OTGHS_DOEPEACHMSK1_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DOEPEACHMSK1_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DOEPEACHMSK1_XFERCOMPLMSK_M  (USB_OTGHS_DOEPEACHMSK1_XFERCOMPLMSK_V << USB_OTGHS_DOEPEACHMSK1_XFERCOMPLMSK_S)
#define USB_OTGHS_DOEPEACHMSK1_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK1_XFERCOMPLMSK_S  0
/** USB_OTGHS_DOEPEACHMSK1_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DOEPEACHMSK1_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DOEPEACHMSK1_EPDISBLDMSK_M  (USB_OTGHS_DOEPEACHMSK1_EPDISBLDMSK_V << USB_OTGHS_DOEPEACHMSK1_EPDISBLDMSK_S)
#define USB_OTGHS_DOEPEACHMSK1_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK1_EPDISBLDMSK_S  1
/** USB_OTGHS_DOEPEACHMSK1_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK1_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DOEPEACHMSK1_AHBERRMSK_M  (USB_OTGHS_DOEPEACHMSK1_AHBERRMSK_V << USB_OTGHS_DOEPEACHMSK1_AHBERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK1_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK1_AHBERRMSK_S  2
/** USB_OTGHS_DOEPEACHMSK1_SETUPMSK : R/W; bitpos: [3]; default: 0;
 *  SETUP Phase Done Mask (SetUPMsk)
 *
 *  Applies to control endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK1_SETUPMSK    (BIT(3))
#define USB_OTGHS_DOEPEACHMSK1_SETUPMSK_M  (USB_OTGHS_DOEPEACHMSK1_SETUPMSK_V << USB_OTGHS_DOEPEACHMSK1_SETUPMSK_S)
#define USB_OTGHS_DOEPEACHMSK1_SETUPMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK1_SETUPMSK_S  3
/** USB_OTGHS_DOEPEACHMSK1_OUTTKNEPDISMSK : R/W; bitpos: [4]; default: 0;
 *  OUT Token Received when Endpoint Disabled Mask (OUTTknEPdisMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK1_OUTTKNEPDISMSK    (BIT(4))
#define USB_OTGHS_DOEPEACHMSK1_OUTTKNEPDISMSK_M  (USB_OTGHS_DOEPEACHMSK1_OUTTKNEPDISMSK_V << USB_OTGHS_DOEPEACHMSK1_OUTTKNEPDISMSK_S)
#define USB_OTGHS_DOEPEACHMSK1_OUTTKNEPDISMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK1_OUTTKNEPDISMSK_S  4
/** USB_OTGHS_DOEPEACHMSK1_STSPHSRCVDMSK : R/W; bitpos: [5]; default: 0;
 *  Status Phase Received Mask (StsPhsRcvdMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK1_STSPHSRCVDMSK    (BIT(5))
#define USB_OTGHS_DOEPEACHMSK1_STSPHSRCVDMSK_M  (USB_OTGHS_DOEPEACHMSK1_STSPHSRCVDMSK_V << USB_OTGHS_DOEPEACHMSK1_STSPHSRCVDMSK_S)
#define USB_OTGHS_DOEPEACHMSK1_STSPHSRCVDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK1_STSPHSRCVDMSK_S  5
/** USB_OTGHS_DOEPEACHMSK1_BACK2BACKSETUP : R/W; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received Mask (Back2BackSETup)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK1_BACK2BACKSETUP    (BIT(6))
#define USB_OTGHS_DOEPEACHMSK1_BACK2BACKSETUP_M  (USB_OTGHS_DOEPEACHMSK1_BACK2BACKSETUP_V << USB_OTGHS_DOEPEACHMSK1_BACK2BACKSETUP_S)
#define USB_OTGHS_DOEPEACHMSK1_BACK2BACKSETUP_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK1_BACK2BACKSETUP_S  6
/** USB_OTGHS_DOEPEACHMSK1_OUTPKTERRMSK : R/W; bitpos: [8]; default: 0;
 *  OUT Packet Error Mask (OutPktErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK1_OUTPKTERRMSK    (BIT(8))
#define USB_OTGHS_DOEPEACHMSK1_OUTPKTERRMSK_M  (USB_OTGHS_DOEPEACHMSK1_OUTPKTERRMSK_V << USB_OTGHS_DOEPEACHMSK1_OUTPKTERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK1_OUTPKTERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK1_OUTPKTERRMSK_S  8
/** USB_OTGHS_DOEPEACHMSK1_BNAOUTINTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BnaOutIntrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK1_BNAOUTINTRMSK    (BIT(9))
#define USB_OTGHS_DOEPEACHMSK1_BNAOUTINTRMSK_M  (USB_OTGHS_DOEPEACHMSK1_BNAOUTINTRMSK_V << USB_OTGHS_DOEPEACHMSK1_BNAOUTINTRMSK_S)
#define USB_OTGHS_DOEPEACHMSK1_BNAOUTINTRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK1_BNAOUTINTRMSK_S  9
/** USB_OTGHS_DOEPEACHMSK1_BBLEERRMSK : R/W; bitpos: [12]; default: 0;
 *  Babble Error interrupt Mask (BbleErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK1_BBLEERRMSK    (BIT(12))
#define USB_OTGHS_DOEPEACHMSK1_BBLEERRMSK_M  (USB_OTGHS_DOEPEACHMSK1_BBLEERRMSK_V << USB_OTGHS_DOEPEACHMSK1_BBLEERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK1_BBLEERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK1_BBLEERRMSK_S  12
/** USB_OTGHS_DOEPEACHMSK1_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DOEPEACHMSK1_NAKMSK    (BIT(13))
#define USB_OTGHS_DOEPEACHMSK1_NAKMSK_M  (USB_OTGHS_DOEPEACHMSK1_NAKMSK_V << USB_OTGHS_DOEPEACHMSK1_NAKMSK_S)
#define USB_OTGHS_DOEPEACHMSK1_NAKMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK1_NAKMSK_S  13
/** USB_OTGHS_DOEPEACHMSK1_NYETMSK : R/W; bitpos: [14]; default: 0;
 *  NYET interrupt Mask (NYETMsk)
 */
#define USB_OTGHS_DOEPEACHMSK1_NYETMSK    (BIT(14))
#define USB_OTGHS_DOEPEACHMSK1_NYETMSK_M  (USB_OTGHS_DOEPEACHMSK1_NYETMSK_V << USB_OTGHS_DOEPEACHMSK1_NYETMSK_S)
#define USB_OTGHS_DOEPEACHMSK1_NYETMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK1_NYETMSK_S  14

/** USB_OTGHS_DOEPEACHMSK2_REG register
 *  This register contains the interrupts for the OUT Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DOEPEACHMSK2_REG (DR_REG_USB_OTGHS_BASE + 0x888)
/** USB_OTGHS_DOEPEACHMSK2_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DOEPEACHMSK2_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DOEPEACHMSK2_XFERCOMPLMSK_M  (USB_OTGHS_DOEPEACHMSK2_XFERCOMPLMSK_V << USB_OTGHS_DOEPEACHMSK2_XFERCOMPLMSK_S)
#define USB_OTGHS_DOEPEACHMSK2_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK2_XFERCOMPLMSK_S  0
/** USB_OTGHS_DOEPEACHMSK2_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DOEPEACHMSK2_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DOEPEACHMSK2_EPDISBLDMSK_M  (USB_OTGHS_DOEPEACHMSK2_EPDISBLDMSK_V << USB_OTGHS_DOEPEACHMSK2_EPDISBLDMSK_S)
#define USB_OTGHS_DOEPEACHMSK2_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK2_EPDISBLDMSK_S  1
/** USB_OTGHS_DOEPEACHMSK2_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK2_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DOEPEACHMSK2_AHBERRMSK_M  (USB_OTGHS_DOEPEACHMSK2_AHBERRMSK_V << USB_OTGHS_DOEPEACHMSK2_AHBERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK2_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK2_AHBERRMSK_S  2
/** USB_OTGHS_DOEPEACHMSK2_SETUPMSK : R/W; bitpos: [3]; default: 0;
 *  SETUP Phase Done Mask (SetUPMsk)
 *
 *  Applies to control endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK2_SETUPMSK    (BIT(3))
#define USB_OTGHS_DOEPEACHMSK2_SETUPMSK_M  (USB_OTGHS_DOEPEACHMSK2_SETUPMSK_V << USB_OTGHS_DOEPEACHMSK2_SETUPMSK_S)
#define USB_OTGHS_DOEPEACHMSK2_SETUPMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK2_SETUPMSK_S  3
/** USB_OTGHS_DOEPEACHMSK2_OUTTKNEPDISMSK : R/W; bitpos: [4]; default: 0;
 *  OUT Token Received when Endpoint Disabled Mask (OUTTknEPdisMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK2_OUTTKNEPDISMSK    (BIT(4))
#define USB_OTGHS_DOEPEACHMSK2_OUTTKNEPDISMSK_M  (USB_OTGHS_DOEPEACHMSK2_OUTTKNEPDISMSK_V << USB_OTGHS_DOEPEACHMSK2_OUTTKNEPDISMSK_S)
#define USB_OTGHS_DOEPEACHMSK2_OUTTKNEPDISMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK2_OUTTKNEPDISMSK_S  4
/** USB_OTGHS_DOEPEACHMSK2_STSPHSRCVDMSK : R/W; bitpos: [5]; default: 0;
 *  Status Phase Received Mask (StsPhsRcvdMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK2_STSPHSRCVDMSK    (BIT(5))
#define USB_OTGHS_DOEPEACHMSK2_STSPHSRCVDMSK_M  (USB_OTGHS_DOEPEACHMSK2_STSPHSRCVDMSK_V << USB_OTGHS_DOEPEACHMSK2_STSPHSRCVDMSK_S)
#define USB_OTGHS_DOEPEACHMSK2_STSPHSRCVDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK2_STSPHSRCVDMSK_S  5
/** USB_OTGHS_DOEPEACHMSK2_BACK2BACKSETUP : R/W; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received Mask (Back2BackSETup)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK2_BACK2BACKSETUP    (BIT(6))
#define USB_OTGHS_DOEPEACHMSK2_BACK2BACKSETUP_M  (USB_OTGHS_DOEPEACHMSK2_BACK2BACKSETUP_V << USB_OTGHS_DOEPEACHMSK2_BACK2BACKSETUP_S)
#define USB_OTGHS_DOEPEACHMSK2_BACK2BACKSETUP_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK2_BACK2BACKSETUP_S  6
/** USB_OTGHS_DOEPEACHMSK2_OUTPKTERRMSK : R/W; bitpos: [8]; default: 0;
 *  OUT Packet Error Mask (OutPktErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK2_OUTPKTERRMSK    (BIT(8))
#define USB_OTGHS_DOEPEACHMSK2_OUTPKTERRMSK_M  (USB_OTGHS_DOEPEACHMSK2_OUTPKTERRMSK_V << USB_OTGHS_DOEPEACHMSK2_OUTPKTERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK2_OUTPKTERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK2_OUTPKTERRMSK_S  8
/** USB_OTGHS_DOEPEACHMSK2_BNAOUTINTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BnaOutIntrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK2_BNAOUTINTRMSK    (BIT(9))
#define USB_OTGHS_DOEPEACHMSK2_BNAOUTINTRMSK_M  (USB_OTGHS_DOEPEACHMSK2_BNAOUTINTRMSK_V << USB_OTGHS_DOEPEACHMSK2_BNAOUTINTRMSK_S)
#define USB_OTGHS_DOEPEACHMSK2_BNAOUTINTRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK2_BNAOUTINTRMSK_S  9
/** USB_OTGHS_DOEPEACHMSK2_BBLEERRMSK : R/W; bitpos: [12]; default: 0;
 *  Babble Error interrupt Mask (BbleErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK2_BBLEERRMSK    (BIT(12))
#define USB_OTGHS_DOEPEACHMSK2_BBLEERRMSK_M  (USB_OTGHS_DOEPEACHMSK2_BBLEERRMSK_V << USB_OTGHS_DOEPEACHMSK2_BBLEERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK2_BBLEERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK2_BBLEERRMSK_S  12
/** USB_OTGHS_DOEPEACHMSK2_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DOEPEACHMSK2_NAKMSK    (BIT(13))
#define USB_OTGHS_DOEPEACHMSK2_NAKMSK_M  (USB_OTGHS_DOEPEACHMSK2_NAKMSK_V << USB_OTGHS_DOEPEACHMSK2_NAKMSK_S)
#define USB_OTGHS_DOEPEACHMSK2_NAKMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK2_NAKMSK_S  13
/** USB_OTGHS_DOEPEACHMSK2_NYETMSK : R/W; bitpos: [14]; default: 0;
 *  NYET interrupt Mask (NYETMsk)
 */
#define USB_OTGHS_DOEPEACHMSK2_NYETMSK    (BIT(14))
#define USB_OTGHS_DOEPEACHMSK2_NYETMSK_M  (USB_OTGHS_DOEPEACHMSK2_NYETMSK_V << USB_OTGHS_DOEPEACHMSK2_NYETMSK_S)
#define USB_OTGHS_DOEPEACHMSK2_NYETMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK2_NYETMSK_S  14

/** USB_OTGHS_DOEPEACHMSK3_REG register
 *  This register contains the interrupts for the OUT Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DOEPEACHMSK3_REG (DR_REG_USB_OTGHS_BASE + 0x88c)
/** USB_OTGHS_DOEPEACHMSK3_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DOEPEACHMSK3_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DOEPEACHMSK3_XFERCOMPLMSK_M  (USB_OTGHS_DOEPEACHMSK3_XFERCOMPLMSK_V << USB_OTGHS_DOEPEACHMSK3_XFERCOMPLMSK_S)
#define USB_OTGHS_DOEPEACHMSK3_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK3_XFERCOMPLMSK_S  0
/** USB_OTGHS_DOEPEACHMSK3_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DOEPEACHMSK3_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DOEPEACHMSK3_EPDISBLDMSK_M  (USB_OTGHS_DOEPEACHMSK3_EPDISBLDMSK_V << USB_OTGHS_DOEPEACHMSK3_EPDISBLDMSK_S)
#define USB_OTGHS_DOEPEACHMSK3_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK3_EPDISBLDMSK_S  1
/** USB_OTGHS_DOEPEACHMSK3_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK3_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DOEPEACHMSK3_AHBERRMSK_M  (USB_OTGHS_DOEPEACHMSK3_AHBERRMSK_V << USB_OTGHS_DOEPEACHMSK3_AHBERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK3_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK3_AHBERRMSK_S  2
/** USB_OTGHS_DOEPEACHMSK3_SETUPMSK : R/W; bitpos: [3]; default: 0;
 *  SETUP Phase Done Mask (SetUPMsk)
 *
 *  Applies to control endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK3_SETUPMSK    (BIT(3))
#define USB_OTGHS_DOEPEACHMSK3_SETUPMSK_M  (USB_OTGHS_DOEPEACHMSK3_SETUPMSK_V << USB_OTGHS_DOEPEACHMSK3_SETUPMSK_S)
#define USB_OTGHS_DOEPEACHMSK3_SETUPMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK3_SETUPMSK_S  3
/** USB_OTGHS_DOEPEACHMSK3_OUTTKNEPDISMSK : R/W; bitpos: [4]; default: 0;
 *  OUT Token Received when Endpoint Disabled Mask (OUTTknEPdisMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK3_OUTTKNEPDISMSK    (BIT(4))
#define USB_OTGHS_DOEPEACHMSK3_OUTTKNEPDISMSK_M  (USB_OTGHS_DOEPEACHMSK3_OUTTKNEPDISMSK_V << USB_OTGHS_DOEPEACHMSK3_OUTTKNEPDISMSK_S)
#define USB_OTGHS_DOEPEACHMSK3_OUTTKNEPDISMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK3_OUTTKNEPDISMSK_S  4
/** USB_OTGHS_DOEPEACHMSK3_STSPHSRCVDMSK : R/W; bitpos: [5]; default: 0;
 *  Status Phase Received Mask (StsPhsRcvdMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK3_STSPHSRCVDMSK    (BIT(5))
#define USB_OTGHS_DOEPEACHMSK3_STSPHSRCVDMSK_M  (USB_OTGHS_DOEPEACHMSK3_STSPHSRCVDMSK_V << USB_OTGHS_DOEPEACHMSK3_STSPHSRCVDMSK_S)
#define USB_OTGHS_DOEPEACHMSK3_STSPHSRCVDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK3_STSPHSRCVDMSK_S  5
/** USB_OTGHS_DOEPEACHMSK3_BACK2BACKSETUP : R/W; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received Mask (Back2BackSETup)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK3_BACK2BACKSETUP    (BIT(6))
#define USB_OTGHS_DOEPEACHMSK3_BACK2BACKSETUP_M  (USB_OTGHS_DOEPEACHMSK3_BACK2BACKSETUP_V << USB_OTGHS_DOEPEACHMSK3_BACK2BACKSETUP_S)
#define USB_OTGHS_DOEPEACHMSK3_BACK2BACKSETUP_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK3_BACK2BACKSETUP_S  6
/** USB_OTGHS_DOEPEACHMSK3_OUTPKTERRMSK : R/W; bitpos: [8]; default: 0;
 *  OUT Packet Error Mask (OutPktErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK3_OUTPKTERRMSK    (BIT(8))
#define USB_OTGHS_DOEPEACHMSK3_OUTPKTERRMSK_M  (USB_OTGHS_DOEPEACHMSK3_OUTPKTERRMSK_V << USB_OTGHS_DOEPEACHMSK3_OUTPKTERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK3_OUTPKTERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK3_OUTPKTERRMSK_S  8
/** USB_OTGHS_DOEPEACHMSK3_BNAOUTINTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BnaOutIntrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK3_BNAOUTINTRMSK    (BIT(9))
#define USB_OTGHS_DOEPEACHMSK3_BNAOUTINTRMSK_M  (USB_OTGHS_DOEPEACHMSK3_BNAOUTINTRMSK_V << USB_OTGHS_DOEPEACHMSK3_BNAOUTINTRMSK_S)
#define USB_OTGHS_DOEPEACHMSK3_BNAOUTINTRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK3_BNAOUTINTRMSK_S  9
/** USB_OTGHS_DOEPEACHMSK3_BBLEERRMSK : R/W; bitpos: [12]; default: 0;
 *  Babble Error interrupt Mask (BbleErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK3_BBLEERRMSK    (BIT(12))
#define USB_OTGHS_DOEPEACHMSK3_BBLEERRMSK_M  (USB_OTGHS_DOEPEACHMSK3_BBLEERRMSK_V << USB_OTGHS_DOEPEACHMSK3_BBLEERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK3_BBLEERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK3_BBLEERRMSK_S  12
/** USB_OTGHS_DOEPEACHMSK3_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DOEPEACHMSK3_NAKMSK    (BIT(13))
#define USB_OTGHS_DOEPEACHMSK3_NAKMSK_M  (USB_OTGHS_DOEPEACHMSK3_NAKMSK_V << USB_OTGHS_DOEPEACHMSK3_NAKMSK_S)
#define USB_OTGHS_DOEPEACHMSK3_NAKMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK3_NAKMSK_S  13
/** USB_OTGHS_DOEPEACHMSK3_NYETMSK : R/W; bitpos: [14]; default: 0;
 *  NYET interrupt Mask (NYETMsk)
 */
#define USB_OTGHS_DOEPEACHMSK3_NYETMSK    (BIT(14))
#define USB_OTGHS_DOEPEACHMSK3_NYETMSK_M  (USB_OTGHS_DOEPEACHMSK3_NYETMSK_V << USB_OTGHS_DOEPEACHMSK3_NYETMSK_S)
#define USB_OTGHS_DOEPEACHMSK3_NYETMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK3_NYETMSK_S  14

