espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_DOEPEACHMSK4_REG register
 *  This register contains the interrupts for the OUT Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DOEPEACHMSK4_REG (DR_REG_USB_OTGHS_BASE + 0x890)
/** USB_OTGHS_DOEPEACHMSK4_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DOEPEACHMSK4_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DOEPEACHMSK4_XFERCOMPLMSK_M  (USB_OTGHS_DOEPEACHMSK4_XFERCOMPLMSK_V << USB_OTGHS_DOEPEACHMSK4_XFERCOMPLMSK_S)
#define USB_OTGHS_DOEPEACHMSK4_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK4_XFERCOMPLMSK_S  0
/** USB_OTGHS_DOEPEACHMSK4_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DOEPEACHMSK4_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DOEPEACHMSK4_EPDISBLDMSK_M  (USB_OTGHS_DOEPEACHMSK4_EPDISBLDMSK_V << USB_OTGHS_DOEPEACHMSK4_EPDISBLDMSK_S)
#define USB_OTGHS_DOEPEACHMSK4_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK4_EPDISBLDMSK_S  1
/** USB_OTGHS_DOEPEACHMSK4_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK4_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DOEPEACHMSK4_AHBERRMSK_M  (USB_OTGHS_DOEPEACHMSK4_AHBERRMSK_V << USB_OTGHS_DOEPEACHMSK4_AHBERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK4_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK4_AHBERRMSK_S  2
/** USB_OTGHS_DOEPEACHMSK4_SETUPMSK : R/W; bitpos: [3]; default: 0;
 *  SETUP Phase Done Mask (SetUPMsk)
 *
 *  Applies to control endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK4_SETUPMSK    (BIT(3))
#define USB_OTGHS_DOEPEACHMSK4_SETUPMSK_M  (USB_OTGHS_DOEPEACHMSK4_SETUPMSK_V << USB_OTGHS_DOEPEACHMSK4_SETUPMSK_S)
#define USB_OTGHS_DOEPEACHMSK4_SETUPMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK4_SETUPMSK_S  3
/** USB_OTGHS_DOEPEACHMSK4_OUTTKNEPDISMSK : R/W; bitpos: [4]; default: 0;
 *  OUT Token Received when Endpoint Disabled Mask (OUTTknEPdisMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK4_OUTTKNEPDISMSK    (BIT(4))
#define USB_OTGHS_DOEPEACHMSK4_OUTTKNEPDISMSK_M  (USB_OTGHS_DOEPEACHMSK4_OUTTKNEPDISMSK_V << USB_OTGHS_DOEPEACHMSK4_OUTTKNEPDISMSK_S)
#define USB_OTGHS_DOEPEACHMSK4_OUTTKNEPDISMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK4_OUTTKNEPDISMSK_S  4
/** USB_OTGHS_DOEPEACHMSK4_STSPHSRCVDMSK : R/W; bitpos: [5]; default: 0;
 *  Status Phase Received Mask (StsPhsRcvdMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK4_STSPHSRCVDMSK    (BIT(5))
#define USB_OTGHS_DOEPEACHMSK4_STSPHSRCVDMSK_M  (USB_OTGHS_DOEPEACHMSK4_STSPHSRCVDMSK_V << USB_OTGHS_DOEPEACHMSK4_STSPHSRCVDMSK_S)
#define USB_OTGHS_DOEPEACHMSK4_STSPHSRCVDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK4_STSPHSRCVDMSK_S  5
/** USB_OTGHS_DOEPEACHMSK4_BACK2BACKSETUP : R/W; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received Mask (Back2BackSETup)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK4_BACK2BACKSETUP    (BIT(6))
#define USB_OTGHS_DOEPEACHMSK4_BACK2BACKSETUP_M  (USB_OTGHS_DOEPEACHMSK4_BACK2BACKSETUP_V << USB_OTGHS_DOEPEACHMSK4_BACK2BACKSETUP_S)
#define USB_OTGHS_DOEPEACHMSK4_BACK2BACKSETUP_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK4_BACK2BACKSETUP_S  6
/** USB_OTGHS_DOEPEACHMSK4_OUTPKTERRMSK : R/W; bitpos: [8]; default: 0;
 *  OUT Packet Error Mask (OutPktErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK4_OUTPKTERRMSK    (BIT(8))
#define USB_OTGHS_DOEPEACHMSK4_OUTPKTERRMSK_M  (USB_OTGHS_DOEPEACHMSK4_OUTPKTERRMSK_V << USB_OTGHS_DOEPEACHMSK4_OUTPKTERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK4_OUTPKTERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK4_OUTPKTERRMSK_S  8
/** USB_OTGHS_DOEPEACHMSK4_BNAOUTINTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BnaOutIntrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK4_BNAOUTINTRMSK    (BIT(9))
#define USB_OTGHS_DOEPEACHMSK4_BNAOUTINTRMSK_M  (USB_OTGHS_DOEPEACHMSK4_BNAOUTINTRMSK_V << USB_OTGHS_DOEPEACHMSK4_BNAOUTINTRMSK_S)
#define USB_OTGHS_DOEPEACHMSK4_BNAOUTINTRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK4_BNAOUTINTRMSK_S  9
/** USB_OTGHS_DOEPEACHMSK4_BBLEERRMSK : R/W; bitpos: [12]; default: 0;
 *  Babble Error interrupt Mask (BbleErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK4_BBLEERRMSK    (BIT(12))
#define USB_OTGHS_DOEPEACHMSK4_BBLEERRMSK_M  (USB_OTGHS_DOEPEACHMSK4_BBLEERRMSK_V << USB_OTGHS_DOEPEACHMSK4_BBLEERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK4_BBLEERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK4_BBLEERRMSK_S  12
/** USB_OTGHS_DOEPEACHMSK4_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DOEPEACHMSK4_NAKMSK    (BIT(13))
#define USB_OTGHS_DOEPEACHMSK4_NAKMSK_M  (USB_OTGHS_DOEPEACHMSK4_NAKMSK_V << USB_OTGHS_DOEPEACHMSK4_NAKMSK_S)
#define USB_OTGHS_DOEPEACHMSK4_NAKMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK4_NAKMSK_S  13
/** USB_OTGHS_DOEPEACHMSK4_NYETMSK : R/W; bitpos: [14]; default: 0;
 *  NYET interrupt Mask (NYETMsk)
 */
#define USB_OTGHS_DOEPEACHMSK4_NYETMSK    (BIT(14))
#define USB_OTGHS_DOEPEACHMSK4_NYETMSK_M  (USB_OTGHS_DOEPEACHMSK4_NYETMSK_V << USB_OTGHS_DOEPEACHMSK4_NYETMSK_S)
#define USB_OTGHS_DOEPEACHMSK4_NYETMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK4_NYETMSK_S  14

/** USB_OTGHS_DOEPEACHMSK5_REG register
 *  This register contains the interrupts for the OUT Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DOEPEACHMSK5_REG (DR_REG_USB_OTGHS_BASE + 0x894)
/** USB_OTGHS_DOEPEACHMSK5_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DOEPEACHMSK5_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DOEPEACHMSK5_XFERCOMPLMSK_M  (USB_OTGHS_DOEPEACHMSK5_XFERCOMPLMSK_V << USB_OTGHS_DOEPEACHMSK5_XFERCOMPLMSK_S)
#define USB_OTGHS_DOEPEACHMSK5_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK5_XFERCOMPLMSK_S  0
/** USB_OTGHS_DOEPEACHMSK5_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DOEPEACHMSK5_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DOEPEACHMSK5_EPDISBLDMSK_M  (USB_OTGHS_DOEPEACHMSK5_EPDISBLDMSK_V << USB_OTGHS_DOEPEACHMSK5_EPDISBLDMSK_S)
#define USB_OTGHS_DOEPEACHMSK5_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK5_EPDISBLDMSK_S  1
/** USB_OTGHS_DOEPEACHMSK5_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK5_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DOEPEACHMSK5_AHBERRMSK_M  (USB_OTGHS_DOEPEACHMSK5_AHBERRMSK_V << USB_OTGHS_DOEPEACHMSK5_AHBERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK5_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK5_AHBERRMSK_S  2
/** USB_OTGHS_DOEPEACHMSK5_SETUPMSK : R/W; bitpos: [3]; default: 0;
 *  SETUP Phase Done Mask (SetUPMsk)
 *
 *  Applies to control endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK5_SETUPMSK    (BIT(3))
#define USB_OTGHS_DOEPEACHMSK5_SETUPMSK_M  (USB_OTGHS_DOEPEACHMSK5_SETUPMSK_V << USB_OTGHS_DOEPEACHMSK5_SETUPMSK_S)
#define USB_OTGHS_DOEPEACHMSK5_SETUPMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK5_SETUPMSK_S  3
/** USB_OTGHS_DOEPEACHMSK5_OUTTKNEPDISMSK : R/W; bitpos: [4]; default: 0;
 *  OUT Token Received when Endpoint Disabled Mask (OUTTknEPdisMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK5_OUTTKNEPDISMSK    (BIT(4))
#define USB_OTGHS_DOEPEACHMSK5_OUTTKNEPDISMSK_M  (USB_OTGHS_DOEPEACHMSK5_OUTTKNEPDISMSK_V << USB_OTGHS_DOEPEACHMSK5_OUTTKNEPDISMSK_S)
#define USB_OTGHS_DOEPEACHMSK5_OUTTKNEPDISMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK5_OUTTKNEPDISMSK_S  4
/** USB_OTGHS_DOEPEACHMSK5_STSPHSRCVDMSK : R/W; bitpos: [5]; default: 0;
 *  Status Phase Received Mask (StsPhsRcvdMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK5_STSPHSRCVDMSK    (BIT(5))
#define USB_OTGHS_DOEPEACHMSK5_STSPHSRCVDMSK_M  (USB_OTGHS_DOEPEACHMSK5_STSPHSRCVDMSK_V << USB_OTGHS_DOEPEACHMSK5_STSPHSRCVDMSK_S)
#define USB_OTGHS_DOEPEACHMSK5_STSPHSRCVDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK5_STSPHSRCVDMSK_S  5
/** USB_OTGHS_DOEPEACHMSK5_BACK2BACKSETUP : R/W; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received Mask (Back2BackSETup)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK5_BACK2BACKSETUP    (BIT(6))
#define USB_OTGHS_DOEPEACHMSK5_BACK2BACKSETUP_M  (USB_OTGHS_DOEPEACHMSK5_BACK2BACKSETUP_V << USB_OTGHS_DOEPEACHMSK5_BACK2BACKSETUP_S)
#define USB_OTGHS_DOEPEACHMSK5_BACK2BACKSETUP_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK5_BACK2BACKSETUP_S  6
/** USB_OTGHS_DOEPEACHMSK5_OUTPKTERRMSK : R/W; bitpos: [8]; default: 0;
 *  OUT Packet Error Mask (OutPktErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK5_OUTPKTERRMSK    (BIT(8))
#define USB_OTGHS_DOEPEACHMSK5_OUTPKTERRMSK_M  (USB_OTGHS_DOEPEACHMSK5_OUTPKTERRMSK_V << USB_OTGHS_DOEPEACHMSK5_OUTPKTERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK5_OUTPKTERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK5_OUTPKTERRMSK_S  8
/** USB_OTGHS_DOEPEACHMSK5_BNAOUTINTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BnaOutIntrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK5_BNAOUTINTRMSK    (BIT(9))
#define USB_OTGHS_DOEPEACHMSK5_BNAOUTINTRMSK_M  (USB_OTGHS_DOEPEACHMSK5_BNAOUTINTRMSK_V << USB_OTGHS_DOEPEACHMSK5_BNAOUTINTRMSK_S)
#define USB_OTGHS_DOEPEACHMSK5_BNAOUTINTRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK5_BNAOUTINTRMSK_S  9
/** USB_OTGHS_DOEPEACHMSK5_BBLEERRMSK : R/W; bitpos: [12]; default: 0;
 *  Babble Error interrupt Mask (BbleErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK5_BBLEERRMSK    (BIT(12))
#define USB_OTGHS_DOEPEACHMSK5_BBLEERRMSK_M  (USB_OTGHS_DOEPEACHMSK5_BBLEERRMSK_V << USB_OTGHS_DOEPEACHMSK5_BBLEERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK5_BBLEERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK5_BBLEERRMSK_S  12
/** USB_OTGHS_DOEPEACHMSK5_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DOEPEACHMSK5_NAKMSK    (BIT(13))
#define USB_OTGHS_DOEPEACHMSK5_NAKMSK_M  (USB_OTGHS_DOEPEACHMSK5_NAKMSK_V << USB_OTGHS_DOEPEACHMSK5_NAKMSK_S)
#define USB_OTGHS_DOEPEACHMSK5_NAKMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK5_NAKMSK_S  13
/** USB_OTGHS_DOEPEACHMSK5_NYETMSK : R/W; bitpos: [14]; default: 0;
 *  NYET interrupt Mask (NYETMsk)
 */
#define USB_OTGHS_DOEPEACHMSK5_NYETMSK    (BIT(14))
#define USB_OTGHS_DOEPEACHMSK5_NYETMSK_M  (USB_OTGHS_DOEPEACHMSK5_NYETMSK_V << USB_OTGHS_DOEPEACHMSK5_NYETMSK_S)
#define USB_OTGHS_DOEPEACHMSK5_NYETMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK5_NYETMSK_S  14

/** USB_OTGHS_DOEPEACHMSK6_REG register
 *  This register contains the interrupts for the OUT Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DOEPEACHMSK6_REG (DR_REG_USB_OTGHS_BASE + 0x898)
/** USB_OTGHS_DOEPEACHMSK6_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DOEPEACHMSK6_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DOEPEACHMSK6_XFERCOMPLMSK_M  (USB_OTGHS_DOEPEACHMSK6_XFERCOMPLMSK_V << USB_OTGHS_DOEPEACHMSK6_XFERCOMPLMSK_S)
#define USB_OTGHS_DOEPEACHMSK6_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK6_XFERCOMPLMSK_S  0
/** USB_OTGHS_DOEPEACHMSK6_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DOEPEACHMSK6_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DOEPEACHMSK6_EPDISBLDMSK_M  (USB_OTGHS_DOEPEACHMSK6_EPDISBLDMSK_V << USB_OTGHS_DOEPEACHMSK6_EPDISBLDMSK_S)
#define USB_OTGHS_DOEPEACHMSK6_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK6_EPDISBLDMSK_S  1
/** USB_OTGHS_DOEPEACHMSK6_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK6_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DOEPEACHMSK6_AHBERRMSK_M  (USB_OTGHS_DOEPEACHMSK6_AHBERRMSK_V << USB_OTGHS_DOEPEACHMSK6_AHBERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK6_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK6_AHBERRMSK_S  2
/** USB_OTGHS_DOEPEACHMSK6_SETUPMSK : R/W; bitpos: [3]; default: 0;
 *  SETUP Phase Done Mask (SetUPMsk)
 *
 *  Applies to control endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK6_SETUPMSK    (BIT(3))
#define USB_OTGHS_DOEPEACHMSK6_SETUPMSK_M  (USB_OTGHS_DOEPEACHMSK6_SETUPMSK_V << USB_OTGHS_DOEPEACHMSK6_SETUPMSK_S)
#define USB_OTGHS_DOEPEACHMSK6_SETUPMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK6_SETUPMSK_S  3
/** USB_OTGHS_DOEPEACHMSK6_OUTTKNEPDISMSK : R/W; bitpos: [4]; default: 0;
 *  OUT Token Received when Endpoint Disabled Mask (OUTTknEPdisMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK6_OUTTKNEPDISMSK    (BIT(4))
#define USB_OTGHS_DOEPEACHMSK6_OUTTKNEPDISMSK_M  (USB_OTGHS_DOEPEACHMSK6_OUTTKNEPDISMSK_V << USB_OTGHS_DOEPEACHMSK6_OUTTKNEPDISMSK_S)
#define USB_OTGHS_DOEPEACHMSK6_OUTTKNEPDISMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK6_OUTTKNEPDISMSK_S  4
/** USB_OTGHS_DOEPEACHMSK6_STSPHSRCVDMSK : R/W; bitpos: [5]; default: 0;
 *  Status Phase Received Mask (StsPhsRcvdMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK6_STSPHSRCVDMSK    (BIT(5))
#define USB_OTGHS_DOEPEACHMSK6_STSPHSRCVDMSK_M  (USB_OTGHS_DOEPEACHMSK6_STSPHSRCVDMSK_V << USB_OTGHS_DOEPEACHMSK6_STSPHSRCVDMSK_S)
#define USB_OTGHS_DOEPEACHMSK6_STSPHSRCVDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK6_STSPHSRCVDMSK_S  5
/** USB_OTGHS_DOEPEACHMSK6_BACK2BACKSETUP : R/W; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received Mask (Back2BackSETup)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK6_BACK2BACKSETUP    (BIT(6))
#define USB_OTGHS_DOEPEACHMSK6_BACK2BACKSETUP_M  (USB_OTGHS_DOEPEACHMSK6_BACK2BACKSETUP_V << USB_OTGHS_DOEPEACHMSK6_BACK2BACKSETUP_S)
#define USB_OTGHS_DOEPEACHMSK6_BACK2BACKSETUP_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK6_BACK2BACKSETUP_S  6
/** USB_OTGHS_DOEPEACHMSK6_OUTPKTERRMSK : R/W; bitpos: [8]; default: 0;
 *  OUT Packet Error Mask (OutPktErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK6_OUTPKTERRMSK    (BIT(8))
#define USB_OTGHS_DOEPEACHMSK6_OUTPKTERRMSK_M  (USB_OTGHS_DOEPEACHMSK6_OUTPKTERRMSK_V << USB_OTGHS_DOEPEACHMSK6_OUTPKTERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK6_OUTPKTERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK6_OUTPKTERRMSK_S  8
/** USB_OTGHS_DOEPEACHMSK6_BNAOUTINTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BnaOutIntrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK6_BNAOUTINTRMSK    (BIT(9))
#define USB_OTGHS_DOEPEACHMSK6_BNAOUTINTRMSK_M  (USB_OTGHS_DOEPEACHMSK6_BNAOUTINTRMSK_V << USB_OTGHS_DOEPEACHMSK6_BNAOUTINTRMSK_S)
#define USB_OTGHS_DOEPEACHMSK6_BNAOUTINTRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK6_BNAOUTINTRMSK_S  9
/** USB_OTGHS_DOEPEACHMSK6_BBLEERRMSK : R/W; bitpos: [12]; default: 0;
 *  Babble Error interrupt Mask (BbleErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK6_BBLEERRMSK    (BIT(12))
#define USB_OTGHS_DOEPEACHMSK6_BBLEERRMSK_M  (USB_OTGHS_DOEPEACHMSK6_BBLEERRMSK_V << USB_OTGHS_DOEPEACHMSK6_BBLEERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK6_BBLEERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK6_BBLEERRMSK_S  12
/** USB_OTGHS_DOEPEACHMSK6_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DOEPEACHMSK6_NAKMSK    (BIT(13))
#define USB_OTGHS_DOEPEACHMSK6_NAKMSK_M  (USB_OTGHS_DOEPEACHMSK6_NAKMSK_V << USB_OTGHS_DOEPEACHMSK6_NAKMSK_S)
#define USB_OTGHS_DOEPEACHMSK6_NAKMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK6_NAKMSK_S  13
/** USB_OTGHS_DOEPEACHMSK6_NYETMSK : R/W; bitpos: [14]; default: 0;
 *  NYET interrupt Mask (NYETMsk)
 */
#define USB_OTGHS_DOEPEACHMSK6_NYETMSK    (BIT(14))
#define USB_OTGHS_DOEPEACHMSK6_NYETMSK_M  (USB_OTGHS_DOEPEACHMSK6_NYETMSK_V << USB_OTGHS_DOEPEACHMSK6_NYETMSK_S)
#define USB_OTGHS_DOEPEACHMSK6_NYETMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK6_NYETMSK_S  14

