espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_DOEPEACHMSK7_REG register
 *  This register contains the interrupts for the OUT Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DOEPEACHMSK7_REG (DR_REG_USB_OTGHS_BASE + 0x89c)
/** USB_OTGHS_DOEPEACHMSK7_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DOEPEACHMSK7_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DOEPEACHMSK7_XFERCOMPLMSK_M  (USB_OTGHS_DOEPEACHMSK7_XFERCOMPLMSK_V << USB_OTGHS_DOEPEACHMSK7_XFERCOMPLMSK_S)
#define USB_OTGHS_DOEPEACHMSK7_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK7_XFERCOMPLMSK_S  0
/** USB_OTGHS_DOEPEACHMSK7_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DOEPEACHMSK7_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DOEPEACHMSK7_EPDISBLDMSK_M  (USB_OTGHS_DOEPEACHMSK7_EPDISBLDMSK_V << USB_OTGHS_DOEPEACHMSK7_EPDISBLDMSK_S)
#define USB_OTGHS_DOEPEACHMSK7_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK7_EPDISBLDMSK_S  1
/** USB_OTGHS_DOEPEACHMSK7_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK7_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DOEPEACHMSK7_AHBERRMSK_M  (USB_OTGHS_DOEPEACHMSK7_AHBERRMSK_V << USB_OTGHS_DOEPEACHMSK7_AHBERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK7_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK7_AHBERRMSK_S  2
/** USB_OTGHS_DOEPEACHMSK7_SETUPMSK : R/W; bitpos: [3]; default: 0;
 *  SETUP Phase Done Mask (SetUPMsk)
 *
 *  Applies to control endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK7_SETUPMSK    (BIT(3))
#define USB_OTGHS_DOEPEACHMSK7_SETUPMSK_M  (USB_OTGHS_DOEPEACHMSK7_SETUPMSK_V << USB_OTGHS_DOEPEACHMSK7_SETUPMSK_S)
#define USB_OTGHS_DOEPEACHMSK7_SETUPMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK7_SETUPMSK_S  3
/** USB_OTGHS_DOEPEACHMSK7_OUTTKNEPDISMSK : R/W; bitpos: [4]; default: 0;
 *  OUT Token Received when Endpoint Disabled Mask (OUTTknEPdisMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK7_OUTTKNEPDISMSK    (BIT(4))
#define USB_OTGHS_DOEPEACHMSK7_OUTTKNEPDISMSK_M  (USB_OTGHS_DOEPEACHMSK7_OUTTKNEPDISMSK_V << USB_OTGHS_DOEPEACHMSK7_OUTTKNEPDISMSK_S)
#define USB_OTGHS_DOEPEACHMSK7_OUTTKNEPDISMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK7_OUTTKNEPDISMSK_S  4
/** USB_OTGHS_DOEPEACHMSK7_STSPHSRCVDMSK : R/W; bitpos: [5]; default: 0;
 *  Status Phase Received Mask (StsPhsRcvdMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK7_STSPHSRCVDMSK    (BIT(5))
#define USB_OTGHS_DOEPEACHMSK7_STSPHSRCVDMSK_M  (USB_OTGHS_DOEPEACHMSK7_STSPHSRCVDMSK_V << USB_OTGHS_DOEPEACHMSK7_STSPHSRCVDMSK_S)
#define USB_OTGHS_DOEPEACHMSK7_STSPHSRCVDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK7_STSPHSRCVDMSK_S  5
/** USB_OTGHS_DOEPEACHMSK7_BACK2BACKSETUP : R/W; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received Mask (Back2BackSETup)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK7_BACK2BACKSETUP    (BIT(6))
#define USB_OTGHS_DOEPEACHMSK7_BACK2BACKSETUP_M  (USB_OTGHS_DOEPEACHMSK7_BACK2BACKSETUP_V << USB_OTGHS_DOEPEACHMSK7_BACK2BACKSETUP_S)
#define USB_OTGHS_DOEPEACHMSK7_BACK2BACKSETUP_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK7_BACK2BACKSETUP_S  6
/** USB_OTGHS_DOEPEACHMSK7_OUTPKTERRMSK : R/W; bitpos: [8]; default: 0;
 *  OUT Packet Error Mask (OutPktErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK7_OUTPKTERRMSK    (BIT(8))
#define USB_OTGHS_DOEPEACHMSK7_OUTPKTERRMSK_M  (USB_OTGHS_DOEPEACHMSK7_OUTPKTERRMSK_V << USB_OTGHS_DOEPEACHMSK7_OUTPKTERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK7_OUTPKTERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK7_OUTPKTERRMSK_S  8
/** USB_OTGHS_DOEPEACHMSK7_BNAOUTINTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BnaOutIntrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK7_BNAOUTINTRMSK    (BIT(9))
#define USB_OTGHS_DOEPEACHMSK7_BNAOUTINTRMSK_M  (USB_OTGHS_DOEPEACHMSK7_BNAOUTINTRMSK_V << USB_OTGHS_DOEPEACHMSK7_BNAOUTINTRMSK_S)
#define USB_OTGHS_DOEPEACHMSK7_BNAOUTINTRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK7_BNAOUTINTRMSK_S  9
/** USB_OTGHS_DOEPEACHMSK7_BBLEERRMSK : R/W; bitpos: [12]; default: 0;
 *  Babble Error interrupt Mask (BbleErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK7_BBLEERRMSK    (BIT(12))
#define USB_OTGHS_DOEPEACHMSK7_BBLEERRMSK_M  (USB_OTGHS_DOEPEACHMSK7_BBLEERRMSK_V << USB_OTGHS_DOEPEACHMSK7_BBLEERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK7_BBLEERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK7_BBLEERRMSK_S  12
/** USB_OTGHS_DOEPEACHMSK7_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DOEPEACHMSK7_NAKMSK    (BIT(13))
#define USB_OTGHS_DOEPEACHMSK7_NAKMSK_M  (USB_OTGHS_DOEPEACHMSK7_NAKMSK_V << USB_OTGHS_DOEPEACHMSK7_NAKMSK_S)
#define USB_OTGHS_DOEPEACHMSK7_NAKMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK7_NAKMSK_S  13
/** USB_OTGHS_DOEPEACHMSK7_NYETMSK : R/W; bitpos: [14]; default: 0;
 *  NYET interrupt Mask (NYETMsk)
 */
#define USB_OTGHS_DOEPEACHMSK7_NYETMSK    (BIT(14))
#define USB_OTGHS_DOEPEACHMSK7_NYETMSK_M  (USB_OTGHS_DOEPEACHMSK7_NYETMSK_V << USB_OTGHS_DOEPEACHMSK7_NYETMSK_S)
#define USB_OTGHS_DOEPEACHMSK7_NYETMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK7_NYETMSK_S  14

/** USB_OTGHS_DOEPEACHMSK8_REG register
 *  This register contains the interrupts for the OUT Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DOEPEACHMSK8_REG (DR_REG_USB_OTGHS_BASE + 0x8a0)
/** USB_OTGHS_DOEPEACHMSK8_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DOEPEACHMSK8_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DOEPEACHMSK8_XFERCOMPLMSK_M  (USB_OTGHS_DOEPEACHMSK8_XFERCOMPLMSK_V << USB_OTGHS_DOEPEACHMSK8_XFERCOMPLMSK_S)
#define USB_OTGHS_DOEPEACHMSK8_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK8_XFERCOMPLMSK_S  0
/** USB_OTGHS_DOEPEACHMSK8_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DOEPEACHMSK8_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DOEPEACHMSK8_EPDISBLDMSK_M  (USB_OTGHS_DOEPEACHMSK8_EPDISBLDMSK_V << USB_OTGHS_DOEPEACHMSK8_EPDISBLDMSK_S)
#define USB_OTGHS_DOEPEACHMSK8_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK8_EPDISBLDMSK_S  1
/** USB_OTGHS_DOEPEACHMSK8_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK8_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DOEPEACHMSK8_AHBERRMSK_M  (USB_OTGHS_DOEPEACHMSK8_AHBERRMSK_V << USB_OTGHS_DOEPEACHMSK8_AHBERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK8_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK8_AHBERRMSK_S  2
/** USB_OTGHS_DOEPEACHMSK8_SETUPMSK : R/W; bitpos: [3]; default: 0;
 *  SETUP Phase Done Mask (SetUPMsk)
 *
 *  Applies to control endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK8_SETUPMSK    (BIT(3))
#define USB_OTGHS_DOEPEACHMSK8_SETUPMSK_M  (USB_OTGHS_DOEPEACHMSK8_SETUPMSK_V << USB_OTGHS_DOEPEACHMSK8_SETUPMSK_S)
#define USB_OTGHS_DOEPEACHMSK8_SETUPMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK8_SETUPMSK_S  3
/** USB_OTGHS_DOEPEACHMSK8_OUTTKNEPDISMSK : R/W; bitpos: [4]; default: 0;
 *  OUT Token Received when Endpoint Disabled Mask (OUTTknEPdisMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK8_OUTTKNEPDISMSK    (BIT(4))
#define USB_OTGHS_DOEPEACHMSK8_OUTTKNEPDISMSK_M  (USB_OTGHS_DOEPEACHMSK8_OUTTKNEPDISMSK_V << USB_OTGHS_DOEPEACHMSK8_OUTTKNEPDISMSK_S)
#define USB_OTGHS_DOEPEACHMSK8_OUTTKNEPDISMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK8_OUTTKNEPDISMSK_S  4
/** USB_OTGHS_DOEPEACHMSK8_STSPHSRCVDMSK : R/W; bitpos: [5]; default: 0;
 *  Status Phase Received Mask (StsPhsRcvdMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK8_STSPHSRCVDMSK    (BIT(5))
#define USB_OTGHS_DOEPEACHMSK8_STSPHSRCVDMSK_M  (USB_OTGHS_DOEPEACHMSK8_STSPHSRCVDMSK_V << USB_OTGHS_DOEPEACHMSK8_STSPHSRCVDMSK_S)
#define USB_OTGHS_DOEPEACHMSK8_STSPHSRCVDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK8_STSPHSRCVDMSK_S  5
/** USB_OTGHS_DOEPEACHMSK8_BACK2BACKSETUP : R/W; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received Mask (Back2BackSETup)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK8_BACK2BACKSETUP    (BIT(6))
#define USB_OTGHS_DOEPEACHMSK8_BACK2BACKSETUP_M  (USB_OTGHS_DOEPEACHMSK8_BACK2BACKSETUP_V << USB_OTGHS_DOEPEACHMSK8_BACK2BACKSETUP_S)
#define USB_OTGHS_DOEPEACHMSK8_BACK2BACKSETUP_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK8_BACK2BACKSETUP_S  6
/** USB_OTGHS_DOEPEACHMSK8_OUTPKTERRMSK : R/W; bitpos: [8]; default: 0;
 *  OUT Packet Error Mask (OutPktErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK8_OUTPKTERRMSK    (BIT(8))
#define USB_OTGHS_DOEPEACHMSK8_OUTPKTERRMSK_M  (USB_OTGHS_DOEPEACHMSK8_OUTPKTERRMSK_V << USB_OTGHS_DOEPEACHMSK8_OUTPKTERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK8_OUTPKTERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK8_OUTPKTERRMSK_S  8
/** USB_OTGHS_DOEPEACHMSK8_BNAOUTINTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BnaOutIntrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK8_BNAOUTINTRMSK    (BIT(9))
#define USB_OTGHS_DOEPEACHMSK8_BNAOUTINTRMSK_M  (USB_OTGHS_DOEPEACHMSK8_BNAOUTINTRMSK_V << USB_OTGHS_DOEPEACHMSK8_BNAOUTINTRMSK_S)
#define USB_OTGHS_DOEPEACHMSK8_BNAOUTINTRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK8_BNAOUTINTRMSK_S  9
/** USB_OTGHS_DOEPEACHMSK8_BBLEERRMSK : R/W; bitpos: [12]; default: 0;
 *  Babble Error interrupt Mask (BbleErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK8_BBLEERRMSK    (BIT(12))
#define USB_OTGHS_DOEPEACHMSK8_BBLEERRMSK_M  (USB_OTGHS_DOEPEACHMSK8_BBLEERRMSK_V << USB_OTGHS_DOEPEACHMSK8_BBLEERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK8_BBLEERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK8_BBLEERRMSK_S  12
/** USB_OTGHS_DOEPEACHMSK8_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DOEPEACHMSK8_NAKMSK    (BIT(13))
#define USB_OTGHS_DOEPEACHMSK8_NAKMSK_M  (USB_OTGHS_DOEPEACHMSK8_NAKMSK_V << USB_OTGHS_DOEPEACHMSK8_NAKMSK_S)
#define USB_OTGHS_DOEPEACHMSK8_NAKMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK8_NAKMSK_S  13
/** USB_OTGHS_DOEPEACHMSK8_NYETMSK : R/W; bitpos: [14]; default: 0;
 *  NYET interrupt Mask (NYETMsk)
 */
#define USB_OTGHS_DOEPEACHMSK8_NYETMSK    (BIT(14))
#define USB_OTGHS_DOEPEACHMSK8_NYETMSK_M  (USB_OTGHS_DOEPEACHMSK8_NYETMSK_V << USB_OTGHS_DOEPEACHMSK8_NYETMSK_S)
#define USB_OTGHS_DOEPEACHMSK8_NYETMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK8_NYETMSK_S  14

