espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_DOEPEACHMSK9_REG register
 *  This register contains the interrupts for the OUT Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DOEPEACHMSK9_REG (DR_REG_USB_OTGHS_BASE + 0x8a4)
/** USB_OTGHS_DOEPEACHMSK9_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DOEPEACHMSK9_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DOEPEACHMSK9_XFERCOMPLMSK_M  (USB_OTGHS_DOEPEACHMSK9_XFERCOMPLMSK_V << USB_OTGHS_DOEPEACHMSK9_XFERCOMPLMSK_S)
#define USB_OTGHS_DOEPEACHMSK9_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK9_XFERCOMPLMSK_S  0
/** USB_OTGHS_DOEPEACHMSK9_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DOEPEACHMSK9_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DOEPEACHMSK9_EPDISBLDMSK_M  (USB_OTGHS_DOEPEACHMSK9_EPDISBLDMSK_V << USB_OTGHS_DOEPEACHMSK9_EPDISBLDMSK_S)
#define USB_OTGHS_DOEPEACHMSK9_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK9_EPDISBLDMSK_S  1
/** USB_OTGHS_DOEPEACHMSK9_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK9_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DOEPEACHMSK9_AHBERRMSK_M  (USB_OTGHS_DOEPEACHMSK9_AHBERRMSK_V << USB_OTGHS_DOEPEACHMSK9_AHBERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK9_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK9_AHBERRMSK_S  2
/** USB_OTGHS_DOEPEACHMSK9_SETUPMSK : R/W; bitpos: [3]; default: 0;
 *  SETUP Phase Done Mask (SetUPMsk)
 *
 *  Applies to control endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK9_SETUPMSK    (BIT(3))
#define USB_OTGHS_DOEPEACHMSK9_SETUPMSK_M  (USB_OTGHS_DOEPEACHMSK9_SETUPMSK_V << USB_OTGHS_DOEPEACHMSK9_SETUPMSK_S)
#define USB_OTGHS_DOEPEACHMSK9_SETUPMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK9_SETUPMSK_S  3
/** USB_OTGHS_DOEPEACHMSK9_OUTTKNEPDISMSK : R/W; bitpos: [4]; default: 0;
 *  OUT Token Received when Endpoint Disabled Mask (OUTTknEPdisMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK9_OUTTKNEPDISMSK    (BIT(4))
#define USB_OTGHS_DOEPEACHMSK9_OUTTKNEPDISMSK_M  (USB_OTGHS_DOEPEACHMSK9_OUTTKNEPDISMSK_V << USB_OTGHS_DOEPEACHMSK9_OUTTKNEPDISMSK_S)
#define USB_OTGHS_DOEPEACHMSK9_OUTTKNEPDISMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK9_OUTTKNEPDISMSK_S  4
/** USB_OTGHS_DOEPEACHMSK9_STSPHSRCVDMSK : R/W; bitpos: [5]; default: 0;
 *  Status Phase Received Mask (StsPhsRcvdMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK9_STSPHSRCVDMSK    (BIT(5))
#define USB_OTGHS_DOEPEACHMSK9_STSPHSRCVDMSK_M  (USB_OTGHS_DOEPEACHMSK9_STSPHSRCVDMSK_V << USB_OTGHS_DOEPEACHMSK9_STSPHSRCVDMSK_S)
#define USB_OTGHS_DOEPEACHMSK9_STSPHSRCVDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK9_STSPHSRCVDMSK_S  5
/** USB_OTGHS_DOEPEACHMSK9_BACK2BACKSETUP : R/W; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received Mask (Back2BackSETup)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK9_BACK2BACKSETUP    (BIT(6))
#define USB_OTGHS_DOEPEACHMSK9_BACK2BACKSETUP_M  (USB_OTGHS_DOEPEACHMSK9_BACK2BACKSETUP_V << USB_OTGHS_DOEPEACHMSK9_BACK2BACKSETUP_S)
#define USB_OTGHS_DOEPEACHMSK9_BACK2BACKSETUP_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK9_BACK2BACKSETUP_S  6
/** USB_OTGHS_DOEPEACHMSK9_OUTPKTERRMSK : R/W; bitpos: [8]; default: 0;
 *  OUT Packet Error Mask (OutPktErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK9_OUTPKTERRMSK    (BIT(8))
#define USB_OTGHS_DOEPEACHMSK9_OUTPKTERRMSK_M  (USB_OTGHS_DOEPEACHMSK9_OUTPKTERRMSK_V << USB_OTGHS_DOEPEACHMSK9_OUTPKTERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK9_OUTPKTERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK9_OUTPKTERRMSK_S  8
/** USB_OTGHS_DOEPEACHMSK9_BNAOUTINTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BnaOutIntrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK9_BNAOUTINTRMSK    (BIT(9))
#define USB_OTGHS_DOEPEACHMSK9_BNAOUTINTRMSK_M  (USB_OTGHS_DOEPEACHMSK9_BNAOUTINTRMSK_V << USB_OTGHS_DOEPEACHMSK9_BNAOUTINTRMSK_S)
#define USB_OTGHS_DOEPEACHMSK9_BNAOUTINTRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK9_BNAOUTINTRMSK_S  9
/** USB_OTGHS_DOEPEACHMSK9_BBLEERRMSK : R/W; bitpos: [12]; default: 0;
 *  Babble Error interrupt Mask (BbleErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK9_BBLEERRMSK    (BIT(12))
#define USB_OTGHS_DOEPEACHMSK9_BBLEERRMSK_M  (USB_OTGHS_DOEPEACHMSK9_BBLEERRMSK_V << USB_OTGHS_DOEPEACHMSK9_BBLEERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK9_BBLEERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK9_BBLEERRMSK_S  12
/** USB_OTGHS_DOEPEACHMSK9_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DOEPEACHMSK9_NAKMSK    (BIT(13))
#define USB_OTGHS_DOEPEACHMSK9_NAKMSK_M  (USB_OTGHS_DOEPEACHMSK9_NAKMSK_V << USB_OTGHS_DOEPEACHMSK9_NAKMSK_S)
#define USB_OTGHS_DOEPEACHMSK9_NAKMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK9_NAKMSK_S  13
/** USB_OTGHS_DOEPEACHMSK9_NYETMSK : R/W; bitpos: [14]; default: 0;
 *  NYET interrupt Mask (NYETMsk)
 */
#define USB_OTGHS_DOEPEACHMSK9_NYETMSK    (BIT(14))
#define USB_OTGHS_DOEPEACHMSK9_NYETMSK_M  (USB_OTGHS_DOEPEACHMSK9_NYETMSK_V << USB_OTGHS_DOEPEACHMSK9_NYETMSK_S)
#define USB_OTGHS_DOEPEACHMSK9_NYETMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK9_NYETMSK_S  14

/** USB_OTGHS_DOEPEACHMSK10_REG register
 *  This register contains the interrupts for the OUT Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DOEPEACHMSK10_REG (DR_REG_USB_OTGHS_BASE + 0x8a8)
/** USB_OTGHS_DOEPEACHMSK10_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DOEPEACHMSK10_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DOEPEACHMSK10_XFERCOMPLMSK_M  (USB_OTGHS_DOEPEACHMSK10_XFERCOMPLMSK_V << USB_OTGHS_DOEPEACHMSK10_XFERCOMPLMSK_S)
#define USB_OTGHS_DOEPEACHMSK10_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK10_XFERCOMPLMSK_S  0
/** USB_OTGHS_DOEPEACHMSK10_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DOEPEACHMSK10_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DOEPEACHMSK10_EPDISBLDMSK_M  (USB_OTGHS_DOEPEACHMSK10_EPDISBLDMSK_V << USB_OTGHS_DOEPEACHMSK10_EPDISBLDMSK_S)
#define USB_OTGHS_DOEPEACHMSK10_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK10_EPDISBLDMSK_S  1
/** USB_OTGHS_DOEPEACHMSK10_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK10_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DOEPEACHMSK10_AHBERRMSK_M  (USB_OTGHS_DOEPEACHMSK10_AHBERRMSK_V << USB_OTGHS_DOEPEACHMSK10_AHBERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK10_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK10_AHBERRMSK_S  2
/** USB_OTGHS_DOEPEACHMSK10_SETUPMSK : R/W; bitpos: [3]; default: 0;
 *  SETUP Phase Done Mask (SetUPMsk)
 *
 *  Applies to control endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK10_SETUPMSK    (BIT(3))
#define USB_OTGHS_DOEPEACHMSK10_SETUPMSK_M  (USB_OTGHS_DOEPEACHMSK10_SETUPMSK_V << USB_OTGHS_DOEPEACHMSK10_SETUPMSK_S)
#define USB_OTGHS_DOEPEACHMSK10_SETUPMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK10_SETUPMSK_S  3
/** USB_OTGHS_DOEPEACHMSK10_OUTTKNEPDISMSK : R/W; bitpos: [4]; default: 0;
 *  OUT Token Received when Endpoint Disabled Mask (OUTTknEPdisMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK10_OUTTKNEPDISMSK    (BIT(4))
#define USB_OTGHS_DOEPEACHMSK10_OUTTKNEPDISMSK_M  (USB_OTGHS_DOEPEACHMSK10_OUTTKNEPDISMSK_V << USB_OTGHS_DOEPEACHMSK10_OUTTKNEPDISMSK_S)
#define USB_OTGHS_DOEPEACHMSK10_OUTTKNEPDISMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK10_OUTTKNEPDISMSK_S  4
/** USB_OTGHS_DOEPEACHMSK10_STSPHSRCVDMSK : R/W; bitpos: [5]; default: 0;
 *  Status Phase Received Mask (StsPhsRcvdMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK10_STSPHSRCVDMSK    (BIT(5))
#define USB_OTGHS_DOEPEACHMSK10_STSPHSRCVDMSK_M  (USB_OTGHS_DOEPEACHMSK10_STSPHSRCVDMSK_V << USB_OTGHS_DOEPEACHMSK10_STSPHSRCVDMSK_S)
#define USB_OTGHS_DOEPEACHMSK10_STSPHSRCVDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK10_STSPHSRCVDMSK_S  5
/** USB_OTGHS_DOEPEACHMSK10_BACK2BACKSETUP : R/W; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received Mask (Back2BackSETup)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK10_BACK2BACKSETUP    (BIT(6))
#define USB_OTGHS_DOEPEACHMSK10_BACK2BACKSETUP_M  (USB_OTGHS_DOEPEACHMSK10_BACK2BACKSETUP_V << USB_OTGHS_DOEPEACHMSK10_BACK2BACKSETUP_S)
#define USB_OTGHS_DOEPEACHMSK10_BACK2BACKSETUP_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK10_BACK2BACKSETUP_S  6
/** USB_OTGHS_DOEPEACHMSK10_OUTPKTERRMSK : R/W; bitpos: [8]; default: 0;
 *  OUT Packet Error Mask (OutPktErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK10_OUTPKTERRMSK    (BIT(8))
#define USB_OTGHS_DOEPEACHMSK10_OUTPKTERRMSK_M  (USB_OTGHS_DOEPEACHMSK10_OUTPKTERRMSK_V << USB_OTGHS_DOEPEACHMSK10_OUTPKTERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK10_OUTPKTERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK10_OUTPKTERRMSK_S  8
/** USB_OTGHS_DOEPEACHMSK10_BNAOUTINTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BnaOutIntrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK10_BNAOUTINTRMSK    (BIT(9))
#define USB_OTGHS_DOEPEACHMSK10_BNAOUTINTRMSK_M  (USB_OTGHS_DOEPEACHMSK10_BNAOUTINTRMSK_V << USB_OTGHS_DOEPEACHMSK10_BNAOUTINTRMSK_S)
#define USB_OTGHS_DOEPEACHMSK10_BNAOUTINTRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK10_BNAOUTINTRMSK_S  9
/** USB_OTGHS_DOEPEACHMSK10_BBLEERRMSK : R/W; bitpos: [12]; default: 0;
 *  Babble Error interrupt Mask (BbleErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK10_BBLEERRMSK    (BIT(12))
#define USB_OTGHS_DOEPEACHMSK10_BBLEERRMSK_M  (USB_OTGHS_DOEPEACHMSK10_BBLEERRMSK_V << USB_OTGHS_DOEPEACHMSK10_BBLEERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK10_BBLEERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK10_BBLEERRMSK_S  12
/** USB_OTGHS_DOEPEACHMSK10_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DOEPEACHMSK10_NAKMSK    (BIT(13))
#define USB_OTGHS_DOEPEACHMSK10_NAKMSK_M  (USB_OTGHS_DOEPEACHMSK10_NAKMSK_V << USB_OTGHS_DOEPEACHMSK10_NAKMSK_S)
#define USB_OTGHS_DOEPEACHMSK10_NAKMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK10_NAKMSK_S  13
/** USB_OTGHS_DOEPEACHMSK10_NYETMSK : R/W; bitpos: [14]; default: 0;
 *  NYET interrupt Mask (NYETMsk)
 */
#define USB_OTGHS_DOEPEACHMSK10_NYETMSK    (BIT(14))
#define USB_OTGHS_DOEPEACHMSK10_NYETMSK_M  (USB_OTGHS_DOEPEACHMSK10_NYETMSK_V << USB_OTGHS_DOEPEACHMSK10_NYETMSK_S)
#define USB_OTGHS_DOEPEACHMSK10_NYETMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK10_NYETMSK_S  14

