espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_DOEPEACHMSK11_REG register
 *  This register contains the interrupts for the OUT Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DOEPEACHMSK11_REG (DR_REG_USB_OTGHS_BASE + 0x8ac)
/** USB_OTGHS_DOEPEACHMSK11_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DOEPEACHMSK11_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DOEPEACHMSK11_XFERCOMPLMSK_M  (USB_OTGHS_DOEPEACHMSK11_XFERCOMPLMSK_V << USB_OTGHS_DOEPEACHMSK11_XFERCOMPLMSK_S)
#define USB_OTGHS_DOEPEACHMSK11_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK11_XFERCOMPLMSK_S  0
/** USB_OTGHS_DOEPEACHMSK11_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DOEPEACHMSK11_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DOEPEACHMSK11_EPDISBLDMSK_M  (USB_OTGHS_DOEPEACHMSK11_EPDISBLDMSK_V << USB_OTGHS_DOEPEACHMSK11_EPDISBLDMSK_S)
#define USB_OTGHS_DOEPEACHMSK11_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK11_EPDISBLDMSK_S  1
/** USB_OTGHS_DOEPEACHMSK11_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK11_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DOEPEACHMSK11_AHBERRMSK_M  (USB_OTGHS_DOEPEACHMSK11_AHBERRMSK_V << USB_OTGHS_DOEPEACHMSK11_AHBERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK11_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK11_AHBERRMSK_S  2
/** USB_OTGHS_DOEPEACHMSK11_SETUPMSK : R/W; bitpos: [3]; default: 0;
 *  SETUP Phase Done Mask (SetUPMsk)
 *
 *  Applies to control endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK11_SETUPMSK    (BIT(3))
#define USB_OTGHS_DOEPEACHMSK11_SETUPMSK_M  (USB_OTGHS_DOEPEACHMSK11_SETUPMSK_V << USB_OTGHS_DOEPEACHMSK11_SETUPMSK_S)
#define USB_OTGHS_DOEPEACHMSK11_SETUPMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK11_SETUPMSK_S  3
/** USB_OTGHS_DOEPEACHMSK11_OUTTKNEPDISMSK : R/W; bitpos: [4]; default: 0;
 *  OUT Token Received when Endpoint Disabled Mask (OUTTknEPdisMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK11_OUTTKNEPDISMSK    (BIT(4))
#define USB_OTGHS_DOEPEACHMSK11_OUTTKNEPDISMSK_M  (USB_OTGHS_DOEPEACHMSK11_OUTTKNEPDISMSK_V << USB_OTGHS_DOEPEACHMSK11_OUTTKNEPDISMSK_S)
#define USB_OTGHS_DOEPEACHMSK11_OUTTKNEPDISMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK11_OUTTKNEPDISMSK_S  4
/** USB_OTGHS_DOEPEACHMSK11_STSPHSRCVDMSK : R/W; bitpos: [5]; default: 0;
 *  Status Phase Received Mask (StsPhsRcvdMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK11_STSPHSRCVDMSK    (BIT(5))
#define USB_OTGHS_DOEPEACHMSK11_STSPHSRCVDMSK_M  (USB_OTGHS_DOEPEACHMSK11_STSPHSRCVDMSK_V << USB_OTGHS_DOEPEACHMSK11_STSPHSRCVDMSK_S)
#define USB_OTGHS_DOEPEACHMSK11_STSPHSRCVDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK11_STSPHSRCVDMSK_S  5
/** USB_OTGHS_DOEPEACHMSK11_BACK2BACKSETUP : R/W; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received Mask (Back2BackSETup)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK11_BACK2BACKSETUP    (BIT(6))
#define USB_OTGHS_DOEPEACHMSK11_BACK2BACKSETUP_M  (USB_OTGHS_DOEPEACHMSK11_BACK2BACKSETUP_V << USB_OTGHS_DOEPEACHMSK11_BACK2BACKSETUP_S)
#define USB_OTGHS_DOEPEACHMSK11_BACK2BACKSETUP_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK11_BACK2BACKSETUP_S  6
/** USB_OTGHS_DOEPEACHMSK11_OUTPKTERRMSK : R/W; bitpos: [8]; default: 0;
 *  OUT Packet Error Mask (OutPktErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK11_OUTPKTERRMSK    (BIT(8))
#define USB_OTGHS_DOEPEACHMSK11_OUTPKTERRMSK_M  (USB_OTGHS_DOEPEACHMSK11_OUTPKTERRMSK_V << USB_OTGHS_DOEPEACHMSK11_OUTPKTERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK11_OUTPKTERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK11_OUTPKTERRMSK_S  8
/** USB_OTGHS_DOEPEACHMSK11_BNAOUTINTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BnaOutIntrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK11_BNAOUTINTRMSK    (BIT(9))
#define USB_OTGHS_DOEPEACHMSK11_BNAOUTINTRMSK_M  (USB_OTGHS_DOEPEACHMSK11_BNAOUTINTRMSK_V << USB_OTGHS_DOEPEACHMSK11_BNAOUTINTRMSK_S)
#define USB_OTGHS_DOEPEACHMSK11_BNAOUTINTRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK11_BNAOUTINTRMSK_S  9
/** USB_OTGHS_DOEPEACHMSK11_BBLEERRMSK : R/W; bitpos: [12]; default: 0;
 *  Babble Error interrupt Mask (BbleErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK11_BBLEERRMSK    (BIT(12))
#define USB_OTGHS_DOEPEACHMSK11_BBLEERRMSK_M  (USB_OTGHS_DOEPEACHMSK11_BBLEERRMSK_V << USB_OTGHS_DOEPEACHMSK11_BBLEERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK11_BBLEERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK11_BBLEERRMSK_S  12
/** USB_OTGHS_DOEPEACHMSK11_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DOEPEACHMSK11_NAKMSK    (BIT(13))
#define USB_OTGHS_DOEPEACHMSK11_NAKMSK_M  (USB_OTGHS_DOEPEACHMSK11_NAKMSK_V << USB_OTGHS_DOEPEACHMSK11_NAKMSK_S)
#define USB_OTGHS_DOEPEACHMSK11_NAKMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK11_NAKMSK_S  13
/** USB_OTGHS_DOEPEACHMSK11_NYETMSK : R/W; bitpos: [14]; default: 0;
 *  NYET interrupt Mask (NYETMsk)
 */
#define USB_OTGHS_DOEPEACHMSK11_NYETMSK    (BIT(14))
#define USB_OTGHS_DOEPEACHMSK11_NYETMSK_M  (USB_OTGHS_DOEPEACHMSK11_NYETMSK_V << USB_OTGHS_DOEPEACHMSK11_NYETMSK_S)
#define USB_OTGHS_DOEPEACHMSK11_NYETMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK11_NYETMSK_S  14

/** USB_OTGHS_DOEPEACHMSK12_REG register
 *  This register contains the interrupts for the OUT Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DOEPEACHMSK12_REG (DR_REG_USB_OTGHS_BASE + 0x8b0)
/** USB_OTGHS_DOEPEACHMSK12_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DOEPEACHMSK12_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DOEPEACHMSK12_XFERCOMPLMSK_M  (USB_OTGHS_DOEPEACHMSK12_XFERCOMPLMSK_V << USB_OTGHS_DOEPEACHMSK12_XFERCOMPLMSK_S)
#define USB_OTGHS_DOEPEACHMSK12_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK12_XFERCOMPLMSK_S  0
/** USB_OTGHS_DOEPEACHMSK12_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DOEPEACHMSK12_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DOEPEACHMSK12_EPDISBLDMSK_M  (USB_OTGHS_DOEPEACHMSK12_EPDISBLDMSK_V << USB_OTGHS_DOEPEACHMSK12_EPDISBLDMSK_S)
#define USB_OTGHS_DOEPEACHMSK12_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK12_EPDISBLDMSK_S  1
/** USB_OTGHS_DOEPEACHMSK12_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK12_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DOEPEACHMSK12_AHBERRMSK_M  (USB_OTGHS_DOEPEACHMSK12_AHBERRMSK_V << USB_OTGHS_DOEPEACHMSK12_AHBERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK12_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK12_AHBERRMSK_S  2
/** USB_OTGHS_DOEPEACHMSK12_SETUPMSK : R/W; bitpos: [3]; default: 0;
 *  SETUP Phase Done Mask (SetUPMsk)
 *
 *  Applies to control endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK12_SETUPMSK    (BIT(3))
#define USB_OTGHS_DOEPEACHMSK12_SETUPMSK_M  (USB_OTGHS_DOEPEACHMSK12_SETUPMSK_V << USB_OTGHS_DOEPEACHMSK12_SETUPMSK_S)
#define USB_OTGHS_DOEPEACHMSK12_SETUPMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK12_SETUPMSK_S  3
/** USB_OTGHS_DOEPEACHMSK12_OUTTKNEPDISMSK : R/W; bitpos: [4]; default: 0;
 *  OUT Token Received when Endpoint Disabled Mask (OUTTknEPdisMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK12_OUTTKNEPDISMSK    (BIT(4))
#define USB_OTGHS_DOEPEACHMSK12_OUTTKNEPDISMSK_M  (USB_OTGHS_DOEPEACHMSK12_OUTTKNEPDISMSK_V << USB_OTGHS_DOEPEACHMSK12_OUTTKNEPDISMSK_S)
#define USB_OTGHS_DOEPEACHMSK12_OUTTKNEPDISMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK12_OUTTKNEPDISMSK_S  4
/** USB_OTGHS_DOEPEACHMSK12_STSPHSRCVDMSK : R/W; bitpos: [5]; default: 0;
 *  Status Phase Received Mask (StsPhsRcvdMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK12_STSPHSRCVDMSK    (BIT(5))
#define USB_OTGHS_DOEPEACHMSK12_STSPHSRCVDMSK_M  (USB_OTGHS_DOEPEACHMSK12_STSPHSRCVDMSK_V << USB_OTGHS_DOEPEACHMSK12_STSPHSRCVDMSK_S)
#define USB_OTGHS_DOEPEACHMSK12_STSPHSRCVDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK12_STSPHSRCVDMSK_S  5
/** USB_OTGHS_DOEPEACHMSK12_BACK2BACKSETUP : R/W; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received Mask (Back2BackSETup)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK12_BACK2BACKSETUP    (BIT(6))
#define USB_OTGHS_DOEPEACHMSK12_BACK2BACKSETUP_M  (USB_OTGHS_DOEPEACHMSK12_BACK2BACKSETUP_V << USB_OTGHS_DOEPEACHMSK12_BACK2BACKSETUP_S)
#define USB_OTGHS_DOEPEACHMSK12_BACK2BACKSETUP_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK12_BACK2BACKSETUP_S  6
/** USB_OTGHS_DOEPEACHMSK12_OUTPKTERRMSK : R/W; bitpos: [8]; default: 0;
 *  OUT Packet Error Mask (OutPktErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK12_OUTPKTERRMSK    (BIT(8))
#define USB_OTGHS_DOEPEACHMSK12_OUTPKTERRMSK_M  (USB_OTGHS_DOEPEACHMSK12_OUTPKTERRMSK_V << USB_OTGHS_DOEPEACHMSK12_OUTPKTERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK12_OUTPKTERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK12_OUTPKTERRMSK_S  8
/** USB_OTGHS_DOEPEACHMSK12_BNAOUTINTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BnaOutIntrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK12_BNAOUTINTRMSK    (BIT(9))
#define USB_OTGHS_DOEPEACHMSK12_BNAOUTINTRMSK_M  (USB_OTGHS_DOEPEACHMSK12_BNAOUTINTRMSK_V << USB_OTGHS_DOEPEACHMSK12_BNAOUTINTRMSK_S)
#define USB_OTGHS_DOEPEACHMSK12_BNAOUTINTRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK12_BNAOUTINTRMSK_S  9
/** USB_OTGHS_DOEPEACHMSK12_BBLEERRMSK : R/W; bitpos: [12]; default: 0;
 *  Babble Error interrupt Mask (BbleErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK12_BBLEERRMSK    (BIT(12))
#define USB_OTGHS_DOEPEACHMSK12_BBLEERRMSK_M  (USB_OTGHS_DOEPEACHMSK12_BBLEERRMSK_V << USB_OTGHS_DOEPEACHMSK12_BBLEERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK12_BBLEERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK12_BBLEERRMSK_S  12
/** USB_OTGHS_DOEPEACHMSK12_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DOEPEACHMSK12_NAKMSK    (BIT(13))
#define USB_OTGHS_DOEPEACHMSK12_NAKMSK_M  (USB_OTGHS_DOEPEACHMSK12_NAKMSK_V << USB_OTGHS_DOEPEACHMSK12_NAKMSK_S)
#define USB_OTGHS_DOEPEACHMSK12_NAKMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK12_NAKMSK_S  13
/** USB_OTGHS_DOEPEACHMSK12_NYETMSK : R/W; bitpos: [14]; default: 0;
 *  NYET interrupt Mask (NYETMsk)
 */
#define USB_OTGHS_DOEPEACHMSK12_NYETMSK    (BIT(14))
#define USB_OTGHS_DOEPEACHMSK12_NYETMSK_M  (USB_OTGHS_DOEPEACHMSK12_NYETMSK_V << USB_OTGHS_DOEPEACHMSK12_NYETMSK_S)
#define USB_OTGHS_DOEPEACHMSK12_NYETMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK12_NYETMSK_S  14

/** USB_OTGHS_DOEPEACHMSK13_REG register
 *  This register contains the interrupts for the OUT Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DOEPEACHMSK13_REG (DR_REG_USB_OTGHS_BASE + 0x8b4)
/** USB_OTGHS_DOEPEACHMSK13_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DOEPEACHMSK13_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DOEPEACHMSK13_XFERCOMPLMSK_M  (USB_OTGHS_DOEPEACHMSK13_XFERCOMPLMSK_V << USB_OTGHS_DOEPEACHMSK13_XFERCOMPLMSK_S)
#define USB_OTGHS_DOEPEACHMSK13_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK13_XFERCOMPLMSK_S  0
/** USB_OTGHS_DOEPEACHMSK13_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DOEPEACHMSK13_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DOEPEACHMSK13_EPDISBLDMSK_M  (USB_OTGHS_DOEPEACHMSK13_EPDISBLDMSK_V << USB_OTGHS_DOEPEACHMSK13_EPDISBLDMSK_S)
#define USB_OTGHS_DOEPEACHMSK13_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK13_EPDISBLDMSK_S  1
/** USB_OTGHS_DOEPEACHMSK13_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK13_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DOEPEACHMSK13_AHBERRMSK_M  (USB_OTGHS_DOEPEACHMSK13_AHBERRMSK_V << USB_OTGHS_DOEPEACHMSK13_AHBERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK13_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK13_AHBERRMSK_S  2
/** USB_OTGHS_DOEPEACHMSK13_SETUPMSK : R/W; bitpos: [3]; default: 0;
 *  SETUP Phase Done Mask (SetUPMsk)
 *
 *  Applies to control endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK13_SETUPMSK    (BIT(3))
#define USB_OTGHS_DOEPEACHMSK13_SETUPMSK_M  (USB_OTGHS_DOEPEACHMSK13_SETUPMSK_V << USB_OTGHS_DOEPEACHMSK13_SETUPMSK_S)
#define USB_OTGHS_DOEPEACHMSK13_SETUPMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK13_SETUPMSK_S  3
/** USB_OTGHS_DOEPEACHMSK13_OUTTKNEPDISMSK : R/W; bitpos: [4]; default: 0;
 *  OUT Token Received when Endpoint Disabled Mask (OUTTknEPdisMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK13_OUTTKNEPDISMSK    (BIT(4))
#define USB_OTGHS_DOEPEACHMSK13_OUTTKNEPDISMSK_M  (USB_OTGHS_DOEPEACHMSK13_OUTTKNEPDISMSK_V << USB_OTGHS_DOEPEACHMSK13_OUTTKNEPDISMSK_S)
#define USB_OTGHS_DOEPEACHMSK13_OUTTKNEPDISMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK13_OUTTKNEPDISMSK_S  4
/** USB_OTGHS_DOEPEACHMSK13_STSPHSRCVDMSK : R/W; bitpos: [5]; default: 0;
 *  Status Phase Received Mask (StsPhsRcvdMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK13_STSPHSRCVDMSK    (BIT(5))
#define USB_OTGHS_DOEPEACHMSK13_STSPHSRCVDMSK_M  (USB_OTGHS_DOEPEACHMSK13_STSPHSRCVDMSK_V << USB_OTGHS_DOEPEACHMSK13_STSPHSRCVDMSK_S)
#define USB_OTGHS_DOEPEACHMSK13_STSPHSRCVDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK13_STSPHSRCVDMSK_S  5
/** USB_OTGHS_DOEPEACHMSK13_BACK2BACKSETUP : R/W; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received Mask (Back2BackSETup)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK13_BACK2BACKSETUP    (BIT(6))
#define USB_OTGHS_DOEPEACHMSK13_BACK2BACKSETUP_M  (USB_OTGHS_DOEPEACHMSK13_BACK2BACKSETUP_V << USB_OTGHS_DOEPEACHMSK13_BACK2BACKSETUP_S)
#define USB_OTGHS_DOEPEACHMSK13_BACK2BACKSETUP_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK13_BACK2BACKSETUP_S  6
/** USB_OTGHS_DOEPEACHMSK13_OUTPKTERRMSK : R/W; bitpos: [8]; default: 0;
 *  OUT Packet Error Mask (OutPktErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK13_OUTPKTERRMSK    (BIT(8))
#define USB_OTGHS_DOEPEACHMSK13_OUTPKTERRMSK_M  (USB_OTGHS_DOEPEACHMSK13_OUTPKTERRMSK_V << USB_OTGHS_DOEPEACHMSK13_OUTPKTERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK13_OUTPKTERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK13_OUTPKTERRMSK_S  8
/** USB_OTGHS_DOEPEACHMSK13_BNAOUTINTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BnaOutIntrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK13_BNAOUTINTRMSK    (BIT(9))
#define USB_OTGHS_DOEPEACHMSK13_BNAOUTINTRMSK_M  (USB_OTGHS_DOEPEACHMSK13_BNAOUTINTRMSK_V << USB_OTGHS_DOEPEACHMSK13_BNAOUTINTRMSK_S)
#define USB_OTGHS_DOEPEACHMSK13_BNAOUTINTRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK13_BNAOUTINTRMSK_S  9
/** USB_OTGHS_DOEPEACHMSK13_BBLEERRMSK : R/W; bitpos: [12]; default: 0;
 *  Babble Error interrupt Mask (BbleErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK13_BBLEERRMSK    (BIT(12))
#define USB_OTGHS_DOEPEACHMSK13_BBLEERRMSK_M  (USB_OTGHS_DOEPEACHMSK13_BBLEERRMSK_V << USB_OTGHS_DOEPEACHMSK13_BBLEERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK13_BBLEERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK13_BBLEERRMSK_S  12
/** USB_OTGHS_DOEPEACHMSK13_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DOEPEACHMSK13_NAKMSK    (BIT(13))
#define USB_OTGHS_DOEPEACHMSK13_NAKMSK_M  (USB_OTGHS_DOEPEACHMSK13_NAKMSK_V << USB_OTGHS_DOEPEACHMSK13_NAKMSK_S)
#define USB_OTGHS_DOEPEACHMSK13_NAKMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK13_NAKMSK_S  13
/** USB_OTGHS_DOEPEACHMSK13_NYETMSK : R/W; bitpos: [14]; default: 0;
 *  NYET interrupt Mask (NYETMsk)
 */
#define USB_OTGHS_DOEPEACHMSK13_NYETMSK    (BIT(14))
#define USB_OTGHS_DOEPEACHMSK13_NYETMSK_M  (USB_OTGHS_DOEPEACHMSK13_NYETMSK_V << USB_OTGHS_DOEPEACHMSK13_NYETMSK_S)
#define USB_OTGHS_DOEPEACHMSK13_NYETMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK13_NYETMSK_S  14

/** USB_OTGHS_DOEPEACHMSK14_REG register
 *  This register contains the interrupts for the OUT Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DOEPEACHMSK14_REG (DR_REG_USB_OTGHS_BASE + 0x8b8)
/** USB_OTGHS_DOEPEACHMSK14_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DOEPEACHMSK14_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DOEPEACHMSK14_XFERCOMPLMSK_M  (USB_OTGHS_DOEPEACHMSK14_XFERCOMPLMSK_V << USB_OTGHS_DOEPEACHMSK14_XFERCOMPLMSK_S)
#define USB_OTGHS_DOEPEACHMSK14_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK14_XFERCOMPLMSK_S  0
/** USB_OTGHS_DOEPEACHMSK14_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DOEPEACHMSK14_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DOEPEACHMSK14_EPDISBLDMSK_M  (USB_OTGHS_DOEPEACHMSK14_EPDISBLDMSK_V << USB_OTGHS_DOEPEACHMSK14_EPDISBLDMSK_S)
#define USB_OTGHS_DOEPEACHMSK14_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK14_EPDISBLDMSK_S  1
/** USB_OTGHS_DOEPEACHMSK14_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK14_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DOEPEACHMSK14_AHBERRMSK_M  (USB_OTGHS_DOEPEACHMSK14_AHBERRMSK_V << USB_OTGHS_DOEPEACHMSK14_AHBERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK14_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK14_AHBERRMSK_S  2
/** USB_OTGHS_DOEPEACHMSK14_SETUPMSK : R/W; bitpos: [3]; default: 0;
 *  SETUP Phase Done Mask (SetUPMsk)
 *
 *  Applies to control endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK14_SETUPMSK    (BIT(3))
#define USB_OTGHS_DOEPEACHMSK14_SETUPMSK_M  (USB_OTGHS_DOEPEACHMSK14_SETUPMSK_V << USB_OTGHS_DOEPEACHMSK14_SETUPMSK_S)
#define USB_OTGHS_DOEPEACHMSK14_SETUPMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK14_SETUPMSK_S  3
/** USB_OTGHS_DOEPEACHMSK14_OUTTKNEPDISMSK : R/W; bitpos: [4]; default: 0;
 *  OUT Token Received when Endpoint Disabled Mask (OUTTknEPdisMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK14_OUTTKNEPDISMSK    (BIT(4))
#define USB_OTGHS_DOEPEACHMSK14_OUTTKNEPDISMSK_M  (USB_OTGHS_DOEPEACHMSK14_OUTTKNEPDISMSK_V << USB_OTGHS_DOEPEACHMSK14_OUTTKNEPDISMSK_S)
#define USB_OTGHS_DOEPEACHMSK14_OUTTKNEPDISMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK14_OUTTKNEPDISMSK_S  4
/** USB_OTGHS_DOEPEACHMSK14_STSPHSRCVDMSK : R/W; bitpos: [5]; default: 0;
 *  Status Phase Received Mask (StsPhsRcvdMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK14_STSPHSRCVDMSK    (BIT(5))
#define USB_OTGHS_DOEPEACHMSK14_STSPHSRCVDMSK_M  (USB_OTGHS_DOEPEACHMSK14_STSPHSRCVDMSK_V << USB_OTGHS_DOEPEACHMSK14_STSPHSRCVDMSK_S)
#define USB_OTGHS_DOEPEACHMSK14_STSPHSRCVDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK14_STSPHSRCVDMSK_S  5
/** USB_OTGHS_DOEPEACHMSK14_BACK2BACKSETUP : R/W; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received Mask (Back2BackSETup)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK14_BACK2BACKSETUP    (BIT(6))
#define USB_OTGHS_DOEPEACHMSK14_BACK2BACKSETUP_M  (USB_OTGHS_DOEPEACHMSK14_BACK2BACKSETUP_V << USB_OTGHS_DOEPEACHMSK14_BACK2BACKSETUP_S)
#define USB_OTGHS_DOEPEACHMSK14_BACK2BACKSETUP_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK14_BACK2BACKSETUP_S  6
/** USB_OTGHS_DOEPEACHMSK14_OUTPKTERRMSK : R/W; bitpos: [8]; default: 0;
 *  OUT Packet Error Mask (OutPktErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK14_OUTPKTERRMSK    (BIT(8))
#define USB_OTGHS_DOEPEACHMSK14_OUTPKTERRMSK_M  (USB_OTGHS_DOEPEACHMSK14_OUTPKTERRMSK_V << USB_OTGHS_DOEPEACHMSK14_OUTPKTERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK14_OUTPKTERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK14_OUTPKTERRMSK_S  8
/** USB_OTGHS_DOEPEACHMSK14_BNAOUTINTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BnaOutIntrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK14_BNAOUTINTRMSK    (BIT(9))
#define USB_OTGHS_DOEPEACHMSK14_BNAOUTINTRMSK_M  (USB_OTGHS_DOEPEACHMSK14_BNAOUTINTRMSK_V << USB_OTGHS_DOEPEACHMSK14_BNAOUTINTRMSK_S)
#define USB_OTGHS_DOEPEACHMSK14_BNAOUTINTRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK14_BNAOUTINTRMSK_S  9
/** USB_OTGHS_DOEPEACHMSK14_BBLEERRMSK : R/W; bitpos: [12]; default: 0;
 *  Babble Error interrupt Mask (BbleErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK14_BBLEERRMSK    (BIT(12))
#define USB_OTGHS_DOEPEACHMSK14_BBLEERRMSK_M  (USB_OTGHS_DOEPEACHMSK14_BBLEERRMSK_V << USB_OTGHS_DOEPEACHMSK14_BBLEERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK14_BBLEERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK14_BBLEERRMSK_S  12
/** USB_OTGHS_DOEPEACHMSK14_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DOEPEACHMSK14_NAKMSK    (BIT(13))
#define USB_OTGHS_DOEPEACHMSK14_NAKMSK_M  (USB_OTGHS_DOEPEACHMSK14_NAKMSK_V << USB_OTGHS_DOEPEACHMSK14_NAKMSK_S)
#define USB_OTGHS_DOEPEACHMSK14_NAKMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK14_NAKMSK_S  13
/** USB_OTGHS_DOEPEACHMSK14_NYETMSK : R/W; bitpos: [14]; default: 0;
 *  NYET interrupt Mask (NYETMsk)
 */
#define USB_OTGHS_DOEPEACHMSK14_NYETMSK    (BIT(14))
#define USB_OTGHS_DOEPEACHMSK14_NYETMSK_M  (USB_OTGHS_DOEPEACHMSK14_NYETMSK_V << USB_OTGHS_DOEPEACHMSK14_NYETMSK_S)
#define USB_OTGHS_DOEPEACHMSK14_NYETMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK14_NYETMSK_S  14

