espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_DOEPEACHMSK15_REG register
 *  This register contains the interrupts for the OUT Endpoints of the Device
 *  controller. Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DOEPEACHMSK15_REG (DR_REG_USB_OTGHS_BASE + 0x8bc)
/** USB_OTGHS_DOEPEACHMSK15_XFERCOMPLMSK : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt Mask (XferComplMsk)
 */
#define USB_OTGHS_DOEPEACHMSK15_XFERCOMPLMSK    (BIT(0))
#define USB_OTGHS_DOEPEACHMSK15_XFERCOMPLMSK_M  (USB_OTGHS_DOEPEACHMSK15_XFERCOMPLMSK_V << USB_OTGHS_DOEPEACHMSK15_XFERCOMPLMSK_S)
#define USB_OTGHS_DOEPEACHMSK15_XFERCOMPLMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK15_XFERCOMPLMSK_S  0
/** USB_OTGHS_DOEPEACHMSK15_EPDISBLDMSK : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt Mask (EPDisbldMsk)
 */
#define USB_OTGHS_DOEPEACHMSK15_EPDISBLDMSK    (BIT(1))
#define USB_OTGHS_DOEPEACHMSK15_EPDISBLDMSK_M  (USB_OTGHS_DOEPEACHMSK15_EPDISBLDMSK_V << USB_OTGHS_DOEPEACHMSK15_EPDISBLDMSK_S)
#define USB_OTGHS_DOEPEACHMSK15_EPDISBLDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK15_EPDISBLDMSK_S  1
/** USB_OTGHS_DOEPEACHMSK15_AHBERRMSK : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK15_AHBERRMSK    (BIT(2))
#define USB_OTGHS_DOEPEACHMSK15_AHBERRMSK_M  (USB_OTGHS_DOEPEACHMSK15_AHBERRMSK_V << USB_OTGHS_DOEPEACHMSK15_AHBERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK15_AHBERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK15_AHBERRMSK_S  2
/** USB_OTGHS_DOEPEACHMSK15_SETUPMSK : R/W; bitpos: [3]; default: 0;
 *  SETUP Phase Done Mask (SetUPMsk)
 *
 *  Applies to control endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK15_SETUPMSK    (BIT(3))
#define USB_OTGHS_DOEPEACHMSK15_SETUPMSK_M  (USB_OTGHS_DOEPEACHMSK15_SETUPMSK_V << USB_OTGHS_DOEPEACHMSK15_SETUPMSK_S)
#define USB_OTGHS_DOEPEACHMSK15_SETUPMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK15_SETUPMSK_S  3
/** USB_OTGHS_DOEPEACHMSK15_OUTTKNEPDISMSK : R/W; bitpos: [4]; default: 0;
 *  OUT Token Received when Endpoint Disabled Mask (OUTTknEPdisMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK15_OUTTKNEPDISMSK    (BIT(4))
#define USB_OTGHS_DOEPEACHMSK15_OUTTKNEPDISMSK_M  (USB_OTGHS_DOEPEACHMSK15_OUTTKNEPDISMSK_V << USB_OTGHS_DOEPEACHMSK15_OUTTKNEPDISMSK_S)
#define USB_OTGHS_DOEPEACHMSK15_OUTTKNEPDISMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK15_OUTTKNEPDISMSK_S  4
/** USB_OTGHS_DOEPEACHMSK15_STSPHSRCVDMSK : R/W; bitpos: [5]; default: 0;
 *  Status Phase Received Mask (StsPhsRcvdMsk)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK15_STSPHSRCVDMSK    (BIT(5))
#define USB_OTGHS_DOEPEACHMSK15_STSPHSRCVDMSK_M  (USB_OTGHS_DOEPEACHMSK15_STSPHSRCVDMSK_V << USB_OTGHS_DOEPEACHMSK15_STSPHSRCVDMSK_S)
#define USB_OTGHS_DOEPEACHMSK15_STSPHSRCVDMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK15_STSPHSRCVDMSK_S  5
/** USB_OTGHS_DOEPEACHMSK15_BACK2BACKSETUP : R/W; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received Mask (Back2BackSETup)
 *
 *  Applies to control OUT endpoints only.
 */
#define USB_OTGHS_DOEPEACHMSK15_BACK2BACKSETUP    (BIT(6))
#define USB_OTGHS_DOEPEACHMSK15_BACK2BACKSETUP_M  (USB_OTGHS_DOEPEACHMSK15_BACK2BACKSETUP_V << USB_OTGHS_DOEPEACHMSK15_BACK2BACKSETUP_S)
#define USB_OTGHS_DOEPEACHMSK15_BACK2BACKSETUP_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK15_BACK2BACKSETUP_S  6
/** USB_OTGHS_DOEPEACHMSK15_OUTPKTERRMSK : R/W; bitpos: [8]; default: 0;
 *  OUT Packet Error Mask (OutPktErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK15_OUTPKTERRMSK    (BIT(8))
#define USB_OTGHS_DOEPEACHMSK15_OUTPKTERRMSK_M  (USB_OTGHS_DOEPEACHMSK15_OUTPKTERRMSK_V << USB_OTGHS_DOEPEACHMSK15_OUTPKTERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK15_OUTPKTERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK15_OUTPKTERRMSK_S  8
/** USB_OTGHS_DOEPEACHMSK15_BNAOUTINTRMSK : R/W; bitpos: [9]; default: 0;
 *  BNA interrupt Mask (BnaOutIntrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK15_BNAOUTINTRMSK    (BIT(9))
#define USB_OTGHS_DOEPEACHMSK15_BNAOUTINTRMSK_M  (USB_OTGHS_DOEPEACHMSK15_BNAOUTINTRMSK_V << USB_OTGHS_DOEPEACHMSK15_BNAOUTINTRMSK_S)
#define USB_OTGHS_DOEPEACHMSK15_BNAOUTINTRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK15_BNAOUTINTRMSK_S  9
/** USB_OTGHS_DOEPEACHMSK15_BBLEERRMSK : R/W; bitpos: [12]; default: 0;
 *  Babble Error interrupt Mask (BbleErrMsk)
 */
#define USB_OTGHS_DOEPEACHMSK15_BBLEERRMSK    (BIT(12))
#define USB_OTGHS_DOEPEACHMSK15_BBLEERRMSK_M  (USB_OTGHS_DOEPEACHMSK15_BBLEERRMSK_V << USB_OTGHS_DOEPEACHMSK15_BBLEERRMSK_S)
#define USB_OTGHS_DOEPEACHMSK15_BBLEERRMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK15_BBLEERRMSK_S  12
/** USB_OTGHS_DOEPEACHMSK15_NAKMSK : R/W; bitpos: [13]; default: 0;
 *  NAK interrupt Mask (NAKMsk)
 */
#define USB_OTGHS_DOEPEACHMSK15_NAKMSK    (BIT(13))
#define USB_OTGHS_DOEPEACHMSK15_NAKMSK_M  (USB_OTGHS_DOEPEACHMSK15_NAKMSK_V << USB_OTGHS_DOEPEACHMSK15_NAKMSK_S)
#define USB_OTGHS_DOEPEACHMSK15_NAKMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK15_NAKMSK_S  13
/** USB_OTGHS_DOEPEACHMSK15_NYETMSK : R/W; bitpos: [14]; default: 0;
 *  NYET interrupt Mask (NYETMsk)
 */
#define USB_OTGHS_DOEPEACHMSK15_NYETMSK    (BIT(14))
#define USB_OTGHS_DOEPEACHMSK15_NYETMSK_M  (USB_OTGHS_DOEPEACHMSK15_NYETMSK_V << USB_OTGHS_DOEPEACHMSK15_NYETMSK_S)
#define USB_OTGHS_DOEPEACHMSK15_NYETMSK_V  0x00000001U
#define USB_OTGHS_DOEPEACHMSK15_NYETMSK_S  14

/** USB_OTGHS_DIEPCTL0_REG register
 *  This register is used to control the characteristics of the IN Endpoint 0 of the
 *  Device controller.
 */
#define USB_OTGHS_DIEPCTL0_REG (DR_REG_USB_OTGHS_BASE + 0x900)
/** USB_OTGHS_DIEPCTL0_MPS : R/W; bitpos: [1:0]; default: 0;
 *  Maximum Packet Size (MPS)
 *
 *  Applies to IN and OUT endpoints.
 *
 *  The application must program this field with the maximum packet size for the
 *  current logical endpoint.
 *  - 2'b00: 64 bytes
 *  - 2'b01: 32 bytes
 *  - 2'b10: 16 bytes
 *  - 2'b11: 8 bytes
 */
#define USB_OTGHS_DIEPCTL0_MPS    0x00000003U
#define USB_OTGHS_DIEPCTL0_MPS_M  (USB_OTGHS_DIEPCTL0_MPS_V << USB_OTGHS_DIEPCTL0_MPS_S)
#define USB_OTGHS_DIEPCTL0_MPS_V  0x00000003U
#define USB_OTGHS_DIEPCTL0_MPS_S  0
/** USB_OTGHS_DIEPCTL0_USBACTEP : RO; bitpos: [15]; default: 1;
 *  USB Active Endpoint (USBActEP)
 *
 *  This bit is always SET to 1, indicating that control endpoint 0 is always active in
 *  all configurations and interfaces.
 */
#define USB_OTGHS_DIEPCTL0_USBACTEP    (BIT(15))
#define USB_OTGHS_DIEPCTL0_USBACTEP_M  (USB_OTGHS_DIEPCTL0_USBACTEP_V << USB_OTGHS_DIEPCTL0_USBACTEP_S)
#define USB_OTGHS_DIEPCTL0_USBACTEP_V  0x00000001U
#define USB_OTGHS_DIEPCTL0_USBACTEP_S  15
/** USB_OTGHS_DIEPCTL0_NAKSTS : RO; bitpos: [17]; default: 0;
 *  NAK Status (NAKSts)
 *
 *  Indicates the following:
 *  - 1'b0: The core is transmitting non-NAK handshakes based on the FIFO status
 *  - 1'b1: The core is transmitting NAK handshakes on this endpoint.
 *  When this bit is set, either by the application or core, the core stops
 *  transmitting data, even If there is data available in the TxFIFO.
 *  Irrespective of this bit's setting, the core always responds to SETUP data
 *  packets with an ACK handshake.
 */
#define USB_OTGHS_DIEPCTL0_NAKSTS    (BIT(17))
#define USB_OTGHS_DIEPCTL0_NAKSTS_M  (USB_OTGHS_DIEPCTL0_NAKSTS_V << USB_OTGHS_DIEPCTL0_NAKSTS_S)
#define USB_OTGHS_DIEPCTL0_NAKSTS_V  0x00000001U
#define USB_OTGHS_DIEPCTL0_NAKSTS_S  17
/** USB_OTGHS_DIEPCTL0_EPTYPE : RO; bitpos: [19:18]; default: 0;
 *  Endpoint Type (EPType)
 *
 *  Hardcoded to 00 for control.
 */
#define USB_OTGHS_DIEPCTL0_EPTYPE    0x00000003U
#define USB_OTGHS_DIEPCTL0_EPTYPE_M  (USB_OTGHS_DIEPCTL0_EPTYPE_V << USB_OTGHS_DIEPCTL0_EPTYPE_S)
#define USB_OTGHS_DIEPCTL0_EPTYPE_V  0x00000003U
#define USB_OTGHS_DIEPCTL0_EPTYPE_S  18
/** USB_OTGHS_DIEPCTL0_STALL : R/W; bitpos: [21]; default: 0;
 *  STALL Handshake (Stall)
 *
 *  The application can only set this bit, and the core clears it, when a
 *  SETUP token is received for this endpoint. If a NAK bit, Global Nonperiodic
 *  IN NAK, or Global OUT NAK is set along with this bit, the STALL
 *  bit takes priority.
 */
#define USB_OTGHS_DIEPCTL0_STALL    (BIT(21))
#define USB_OTGHS_DIEPCTL0_STALL_M  (USB_OTGHS_DIEPCTL0_STALL_V << USB_OTGHS_DIEPCTL0_STALL_S)
#define USB_OTGHS_DIEPCTL0_STALL_V  0x00000001U
#define USB_OTGHS_DIEPCTL0_STALL_S  21
/** USB_OTGHS_DIEPCTL0_TXFNUM : R/W; bitpos: [25:22]; default: 0;
 *  TxFIFO Number (TxFNum)
 *  - For Shared FIFO operation, this value is always set to 0, indicating that control
 *  IN endpoint 0 data is always written in the Non-Periodic Transmit FIFO.
 *  - For Dedicated FIFO operation, this value is set to the FIFO number that is
 *  assigned to IN Endpoint.
 */
#define USB_OTGHS_DIEPCTL0_TXFNUM    0x0000000FU
#define USB_OTGHS_DIEPCTL0_TXFNUM_M  (USB_OTGHS_DIEPCTL0_TXFNUM_V << USB_OTGHS_DIEPCTL0_TXFNUM_S)
#define USB_OTGHS_DIEPCTL0_TXFNUM_V  0x0000000FU
#define USB_OTGHS_DIEPCTL0_TXFNUM_S  22
/** USB_OTGHS_DIEPCTL0_CNAK : R/W; bitpos: [26]; default: 0;
 *
 *  Clear NAK (CNAK)
 *  A write to this bit clears the NAK bit for the endpoint.
 */
#define USB_OTGHS_DIEPCTL0_CNAK    (BIT(26))
#define USB_OTGHS_DIEPCTL0_CNAK_M  (USB_OTGHS_DIEPCTL0_CNAK_V << USB_OTGHS_DIEPCTL0_CNAK_S)
#define USB_OTGHS_DIEPCTL0_CNAK_V  0x00000001U
#define USB_OTGHS_DIEPCTL0_CNAK_S  26
/** USB_OTGHS_DIEPCTL0_SNAK : R/W; bitpos: [27]; default: 0;
 *
 *  Set NAK (SNAK)
 *  A write to this bit sets the NAK bit for the endpoint.
 *  Using this bit, the application can control the transmission of NAK
 *  handshakes on an endpoint. The core can also set this bit for an
 *  endpoint after a SETUP packet is received on that endpoint.
 */
#define USB_OTGHS_DIEPCTL0_SNAK    (BIT(27))
#define USB_OTGHS_DIEPCTL0_SNAK_M  (USB_OTGHS_DIEPCTL0_SNAK_V << USB_OTGHS_DIEPCTL0_SNAK_S)
#define USB_OTGHS_DIEPCTL0_SNAK_V  0x00000001U
#define USB_OTGHS_DIEPCTL0_SNAK_S  27
/** USB_OTGHS_DIEPCTL0_EPDIS : R/W; bitpos: [30]; default: 0;
 *  Endpoint Disable (EPDis)
 *
 *  The application sets this bit to stop transmitting data on an endpoint,
 *  even before the transfer for that endpoint is complete. The application
 *  must wait for the Endpoint Disabled interrupt before treating the endpoint
 *  as disabled. The core clears this bit before setting the Endpoint Disabled
 *  Interrupt. The application must Set this bit only if Endpoint Enable is
 *  already set for this endpoint.
 */
#define USB_OTGHS_DIEPCTL0_EPDIS    (BIT(30))
#define USB_OTGHS_DIEPCTL0_EPDIS_M  (USB_OTGHS_DIEPCTL0_EPDIS_V << USB_OTGHS_DIEPCTL0_EPDIS_S)
#define USB_OTGHS_DIEPCTL0_EPDIS_V  0x00000001U
#define USB_OTGHS_DIEPCTL0_EPDIS_S  30
/** USB_OTGHS_DIEPCTL0_EPENA : R/W; bitpos: [31]; default: 0;
 *  Endpoint Enable (EPEna)
 *
 *  When Scatter/Gather DMA mode is enabled for IN endpoints, this bit indicates that
 *  the descriptor structure and data buffer with data ready to transmit is setup.
 *
 *  When Scatter/Gather DMA mode is disabled (such as in buffer pointer based DMA mode)
 *  this bit indicates that data is ready to be transmitted on the endpoint.
 *  The core clears this bit before setting the following interrupts on this endpoint:
 *  - Endpoint Disabled
 *  - Transfer Completed
 */
#define USB_OTGHS_DIEPCTL0_EPENA    (BIT(31))
#define USB_OTGHS_DIEPCTL0_EPENA_M  (USB_OTGHS_DIEPCTL0_EPENA_V << USB_OTGHS_DIEPCTL0_EPENA_S)
#define USB_OTGHS_DIEPCTL0_EPENA_V  0x00000001U
#define USB_OTGHS_DIEPCTL0_EPENA_S  31

/** USB_OTGHS_DIEPINT0_REG register
 *  This register indicates the status of an endpoint with respect to USB- and
 *  AHB-related events. It is shown in the Interrupt Hierarchy figure in the databook.
 *  The application must read this register when the OUT Endpoints Interrupt bit or IN
 *  Endpoints Interrupt bit of the Core Interrupt register (GINTSTS.OEPInt or
 *  GINTSTS.IEPInt, respectively) is set. Before the application can read this
 *  register, it must first read the Device All Endpoints Interrupt (DAINT) register to
 *  get the exact endpoint number for the Device Endpoint-n Interrupt register. The
 *  application must clear the appropriate bit in this register to clear the
 *  corresponding bits in the DAINT and GINTSTS registers
 */
#define USB_OTGHS_DIEPINT0_REG (DR_REG_USB_OTGHS_BASE + 0x908)
/** USB_OTGHS_DIEPINT0_XFERCOMPL : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt (XferCompl)
 *
 *  Applies to IN and OUT endpoints.
 *  - When Scatter/Gather DMA mode is enabled
 *  -- For IN endpoint this field indicates that the requested data from the descriptor
 *  is moved from external system memory to internal FIFO.
 *  -- For OUT endpoint this field indicates that the requested data from the internal
 *  FIFO is moved to external system memory. This interrupt is generated only when the
 *  corresponding endpoint descriptor is closed, and the IOC bit for the corresponding
 *  descriptor is set.
 *  - When Scatter/Gather DMA mode is disabled, this field indicates that the
 *  programmed transfer is complete on the AHB as well as on the USB, for this endpoint.
 */
#define USB_OTGHS_DIEPINT0_XFERCOMPL    (BIT(0))
#define USB_OTGHS_DIEPINT0_XFERCOMPL_M  (USB_OTGHS_DIEPINT0_XFERCOMPL_V << USB_OTGHS_DIEPINT0_XFERCOMPL_S)
#define USB_OTGHS_DIEPINT0_XFERCOMPL_V  0x00000001U
#define USB_OTGHS_DIEPINT0_XFERCOMPL_S  0
/** USB_OTGHS_DIEPINT0_EPDISBLD : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt (EPDisbld)
 *
 *  Applies to IN and OUT endpoints.
 *
 *  This bit indicates that the endpoint is disabled per the application's request.
 */
#define USB_OTGHS_DIEPINT0_EPDISBLD    (BIT(1))
#define USB_OTGHS_DIEPINT0_EPDISBLD_M  (USB_OTGHS_DIEPINT0_EPDISBLD_V << USB_OTGHS_DIEPINT0_EPDISBLD_S)
#define USB_OTGHS_DIEPINT0_EPDISBLD_V  0x00000001U
#define USB_OTGHS_DIEPINT0_EPDISBLD_S  1
/** USB_OTGHS_DIEPINT0_AHBERR : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErr)
 *
 *  Applies to IN and OUT endpoints.
 *
 *  This is generated only in Internal DMA mode when there is an AHB error during an
 *  AHB read/write. The application can read the corresponding endpoint DMA address
 *  register to get the error address. For details, see AHB Error Handling in the
 *  Programming Guide.
 */
#define USB_OTGHS_DIEPINT0_AHBERR    (BIT(2))
#define USB_OTGHS_DIEPINT0_AHBERR_M  (USB_OTGHS_DIEPINT0_AHBERR_V << USB_OTGHS_DIEPINT0_AHBERR_S)
#define USB_OTGHS_DIEPINT0_AHBERR_V  0x00000001U
#define USB_OTGHS_DIEPINT0_AHBERR_S  2
/** USB_OTGHS_DIEPINT0_TIMEOUT : R/W; bitpos: [3]; default: 0;
 *  Timeout Condition (TimeOUT)
 *  - In shared TX FIFO mode, applies to non-isochronous IN endpoints only.
 *  - In dedicated FIFO mode, applies only to Control IN endpoints.
 *  - In Scatter/Gather DMA mode, the TimeOUT interrupt is not asserted.
 *  Indicates that the core has detected a timeout condition on the USB for the last IN
 *  token on this endpoint.
 */
#define USB_OTGHS_DIEPINT0_TIMEOUT    (BIT(3))
#define USB_OTGHS_DIEPINT0_TIMEOUT_M  (USB_OTGHS_DIEPINT0_TIMEOUT_V << USB_OTGHS_DIEPINT0_TIMEOUT_S)
#define USB_OTGHS_DIEPINT0_TIMEOUT_V  0x00000001U
#define USB_OTGHS_DIEPINT0_TIMEOUT_S  3
/** USB_OTGHS_DIEPINT0_INTKNTXFEMP : R/W; bitpos: [4]; default: 0;
 *  IN Token Received When TxFIFO is Empty (INTknTXFEmp)
 *
 *  Applies to non-periodic IN endpoints only.
 *
 *  Indicates that an IN token was received when the associated TxFIFO
 *  (periodic/non-periodic) was empty. This interrupt is asserted on the endpoint for
 *  which the IN token was received.
 */
#define USB_OTGHS_DIEPINT0_INTKNTXFEMP    (BIT(4))
#define USB_OTGHS_DIEPINT0_INTKNTXFEMP_M  (USB_OTGHS_DIEPINT0_INTKNTXFEMP_V << USB_OTGHS_DIEPINT0_INTKNTXFEMP_S)
#define USB_OTGHS_DIEPINT0_INTKNTXFEMP_V  0x00000001U
#define USB_OTGHS_DIEPINT0_INTKNTXFEMP_S  4
/** USB_OTGHS_DIEPINT0_INTKNEPMIS : R/W; bitpos: [5]; default: 0;
 *  IN Token Received with EP Mismatch (INTknEPMis)
 *
 *  Applies to non-periodic IN endpoints only.
 *
 *  Indicates that the data in the top of the non-periodic TxFIFO belongs to an
 *  endpoint other than the one for which the IN token was received. This interrupt is
 *  asserted on the endpoint for which the IN token was received.
 */
#define USB_OTGHS_DIEPINT0_INTKNEPMIS    (BIT(5))
#define USB_OTGHS_DIEPINT0_INTKNEPMIS_M  (USB_OTGHS_DIEPINT0_INTKNEPMIS_V << USB_OTGHS_DIEPINT0_INTKNEPMIS_S)
#define USB_OTGHS_DIEPINT0_INTKNEPMIS_V  0x00000001U
#define USB_OTGHS_DIEPINT0_INTKNEPMIS_S  5
/** USB_OTGHS_DIEPINT0_INEPNAKEFF : R/W; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective (INEPNakEff)
 *
 *  Applies to periodic IN endpoints only.
 *
 *  This bit can be cleared when the application clears the IN endpoint NAK by writing
 *  to DIEPCTLn.CNAK.
 *
 *  This interrupt indicates that the core has sampled the NAK bit
 *
 *  Set (either by the application or by the core).
 *
 *  The interrupt indicates that the IN endpoint NAK bit Set by the application has
 *  taken effect in the core.
 *
 *  This interrupt does not guarantee that a NAK handshake is sent on the USB. A STALL
 *  bit takes priority over a NAK bit.
 */
#define USB_OTGHS_DIEPINT0_INEPNAKEFF    (BIT(6))
#define USB_OTGHS_DIEPINT0_INEPNAKEFF_M  (USB_OTGHS_DIEPINT0_INEPNAKEFF_V << USB_OTGHS_DIEPINT0_INEPNAKEFF_S)
#define USB_OTGHS_DIEPINT0_INEPNAKEFF_V  0x00000001U
#define USB_OTGHS_DIEPINT0_INEPNAKEFF_S  6
/** USB_OTGHS_DIEPINT0_TXFEMP : RO; bitpos: [7]; default: 1;
 *  Transmit FIFO Empty (TxFEmp)
 *
 *  This bit is valid only for IN Endpoints
 *
 *  This interrupt is asserted when the TxFIFO for this endpoint is either half or
 *  completely empty. The half or completely empty status is determined by the TxFIFO
 *  Empty Level bit in the Core AHB Configuration register (GAHBCFG.NPTxFEmpLvl)).
 */
#define USB_OTGHS_DIEPINT0_TXFEMP    (BIT(7))
#define USB_OTGHS_DIEPINT0_TXFEMP_M  (USB_OTGHS_DIEPINT0_TXFEMP_V << USB_OTGHS_DIEPINT0_TXFEMP_S)
#define USB_OTGHS_DIEPINT0_TXFEMP_V  0x00000001U
#define USB_OTGHS_DIEPINT0_TXFEMP_S  7
/** USB_OTGHS_DIEPINT0_TXFIFOUNDRN : R/W; bitpos: [8]; default: 0;
 *  Fifo Underrun (TxfifoUndrn)
 *
 *  Applies to IN endpoints only.
 *
 *  The core generates this interrupt when it detects a transmit FIFO underrun
 *  condition in threshold mode for this endpoint.
 */
#define USB_OTGHS_DIEPINT0_TXFIFOUNDRN    (BIT(8))
#define USB_OTGHS_DIEPINT0_TXFIFOUNDRN_M  (USB_OTGHS_DIEPINT0_TXFIFOUNDRN_V << USB_OTGHS_DIEPINT0_TXFIFOUNDRN_S)
#define USB_OTGHS_DIEPINT0_TXFIFOUNDRN_V  0x00000001U
#define USB_OTGHS_DIEPINT0_TXFIFOUNDRN_S  8
/** USB_OTGHS_DIEPINT0_BNAINTR : R/W; bitpos: [9]; default: 0;
 *  BNA (Buffer Not Available) Interrupt (BNAIntr)
 *
 *  This bit is valid only when Scatter/Gather DMA mode is enabled. The core generates
 *  this interrupt when the descriptor accessed is not ready for the Core to process,
 *  such as Host busy or DMA done.
 */
#define USB_OTGHS_DIEPINT0_BNAINTR    (BIT(9))
#define USB_OTGHS_DIEPINT0_BNAINTR_M  (USB_OTGHS_DIEPINT0_BNAINTR_V << USB_OTGHS_DIEPINT0_BNAINTR_S)
#define USB_OTGHS_DIEPINT0_BNAINTR_V  0x00000001U
#define USB_OTGHS_DIEPINT0_BNAINTR_S  9
/** USB_OTGHS_DIEPINT0_PKTDRPSTS : R/W; bitpos: [11]; default: 0;
 *  Packet Drop Status (PktDrpSts)
 *
 *  This bit indicates to the application that an ISOC OUT packet has been dropped.
 *  This bit does not have an associated mask bit and does not generate an interrupt.
 *
 *  Dependency: This bit is valid in non Scatter/Gather DMA mode when periodic transfer
 *  interrupt feature is selected.
 */
#define USB_OTGHS_DIEPINT0_PKTDRPSTS    (BIT(11))
#define USB_OTGHS_DIEPINT0_PKTDRPSTS_M  (USB_OTGHS_DIEPINT0_PKTDRPSTS_V << USB_OTGHS_DIEPINT0_PKTDRPSTS_S)
#define USB_OTGHS_DIEPINT0_PKTDRPSTS_V  0x00000001U
#define USB_OTGHS_DIEPINT0_PKTDRPSTS_S  11
/** USB_OTGHS_DIEPINT0_BBLEERR : R/W; bitpos: [12]; default: 0;
 *  NAK Interrupt (BbleErr)
 *
 *  The core generates this interrupt when babble is received for the endpoint.
 */
#define USB_OTGHS_DIEPINT0_BBLEERR    (BIT(12))
#define USB_OTGHS_DIEPINT0_BBLEERR_M  (USB_OTGHS_DIEPINT0_BBLEERR_V << USB_OTGHS_DIEPINT0_BBLEERR_S)
#define USB_OTGHS_DIEPINT0_BBLEERR_V  0x00000001U
#define USB_OTGHS_DIEPINT0_BBLEERR_S  12
/** USB_OTGHS_DIEPINT0_NAKINTRPT : R/W; bitpos: [13]; default: 0;
 *  NAK Interrupt (NAKInterrupt)
 *
 *  The core generates this interrupt when a NAK is transmitted or received by the
 *  device.
 *  <bring case of isochronous IN endpoints the interrupt gets generated when a zero
 *  length packet is transmitted due to un-availability of data in the TXFifo.
 */
#define USB_OTGHS_DIEPINT0_NAKINTRPT    (BIT(13))
#define USB_OTGHS_DIEPINT0_NAKINTRPT_M  (USB_OTGHS_DIEPINT0_NAKINTRPT_V << USB_OTGHS_DIEPINT0_NAKINTRPT_S)
#define USB_OTGHS_DIEPINT0_NAKINTRPT_V  0x00000001U
#define USB_OTGHS_DIEPINT0_NAKINTRPT_S  13
/** USB_OTGHS_DIEPINT0_NYETINTRPT : R/W; bitpos: [14]; default: 0;
 *  NYET Interrupt (NYETIntrpt)
 *
 *  The core generates this interrupt when a NYET response is transmitted for a non
 *  isochronous OUT endpoint.
 */
#define USB_OTGHS_DIEPINT0_NYETINTRPT    (BIT(14))
#define USB_OTGHS_DIEPINT0_NYETINTRPT_M  (USB_OTGHS_DIEPINT0_NYETINTRPT_V << USB_OTGHS_DIEPINT0_NYETINTRPT_S)
#define USB_OTGHS_DIEPINT0_NYETINTRPT_V  0x00000001U
#define USB_OTGHS_DIEPINT0_NYETINTRPT_S  14

/** USB_OTGHS_DIEPTSIZ0_REG register
 *  The application must modify this register before enabling endpoint 0. Once endpoint
 *  0 is enabled using Endpoint Enable bit of the Device Control Endpoint 0 Control
 *  registers (DIEPCTL0.EPEna/DOEPCTL0.EPEna), the core modifies this register. The
 *  application can only read this register once the core has cleared the Endpoint
 *  Enable bit. Nonzero endpoints use the registers for endpoints 115. When
 *  Scatter/Gather DMA mode is enabled, this register must not be programmed by the
 *  application. If the application reads this register when Scatter/Gather DMA mode is
 *  enabled, the core returns all zeros.
 */
#define USB_OTGHS_DIEPTSIZ0_REG (DR_REG_USB_OTGHS_BASE + 0x910)
/** USB_OTGHS_DIEPTSIZ0_XFERSIZE : R/W; bitpos: [6:0]; default: 0;
 *  Transfer Size (XferSize)
 *
 *  This field contains the transfer size in bytes for the current endpoint. The
 *  transfer size (XferSize) = Sum of buffer sizes across all descriptors in the list
 *  for the endpoint.
 *  In Buffer DMA, the core only interrupts the application after it has exhausted the
 *  transfer size amount of data. The transfer size can be set to the maximum packet
 *  size of the endpoint, to be interrupted at the end of each packet.
 *  - IN Endpoints: The core decrements this field every time a packet from the
 *  external memory is written to the TxFIFO.
 *  - OUT Endpoints: The core decrements this field every time a packet is read from
 *  the RxFIFO and written to the external memory.
 */
#define USB_OTGHS_DIEPTSIZ0_XFERSIZE    0x0000007FU
#define USB_OTGHS_DIEPTSIZ0_XFERSIZE_M  (USB_OTGHS_DIEPTSIZ0_XFERSIZE_V << USB_OTGHS_DIEPTSIZ0_XFERSIZE_S)
#define USB_OTGHS_DIEPTSIZ0_XFERSIZE_V  0x0000007FU
#define USB_OTGHS_DIEPTSIZ0_XFERSIZE_S  0
/** USB_OTGHS_DIEPTSIZ0_PKTCNT : R/W; bitpos: [20:19]; default: 0;
 *  Packet Count (PktCnt)
 *
 *  Indicates the total number of USB packets that constitute the
 *
 *  Transfer Size amount of data for endpoint 0.
 *  - IN Endpoints : This field is decremented every time a packet (maximum size or
 *  short packet) is read from the TxFIFO.
 *  - OUT Endpoints: This field is decremented every time a packet (maximum size or
 *  short packet) is written to the RxFIFO.
 */
#define USB_OTGHS_DIEPTSIZ0_PKTCNT    0x00000003U
#define USB_OTGHS_DIEPTSIZ0_PKTCNT_M  (USB_OTGHS_DIEPTSIZ0_PKTCNT_V << USB_OTGHS_DIEPTSIZ0_PKTCNT_S)
#define USB_OTGHS_DIEPTSIZ0_PKTCNT_V  0x00000003U
#define USB_OTGHS_DIEPTSIZ0_PKTCNT_S  19

