espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_DIEPINT5_REG register
 *  This register contains the interrupts for the IN Endpoint 5 of the Device
 *  controller.  Note: This register exists for an endpoint i if the OTG_EP_DIR_i
 *  parameter is 0 or 1 for that endpoint.
 */
#define USB_OTGHS_DIEPINT5_REG (DR_REG_USB_OTGHS_BASE + 0x9a8)
/** USB_OTGHS_DIEPINT5_XFERCOMPL : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt (XferCompl)
 *
 *  Applies to IN and OUT endpoints.
 *  - When Scatter/Gather DMA mode is enabled
 *  -- For IN endpoint this field indicates that the requested data from the descriptor
 *  is moved from external system memory to internal FIFO.
 *  -- For OUT endpoint this field indicates that the requested data from the internal
 *  FIFO is moved to external system memory. This interrupt is generated only when the
 *  corresponding endpoint descriptor is closed, and the IOC bit for the corresponding
 *  descriptor is set.
 *  - When Scatter/Gather DMA mode is disabled, this field indicates that the
 *  programmed transfer is complete on the AHB as well as on the USB, for this endpoint.
 */
#define USB_OTGHS_DIEPINT5_XFERCOMPL    (BIT(0))
#define USB_OTGHS_DIEPINT5_XFERCOMPL_M  (USB_OTGHS_DIEPINT5_XFERCOMPL_V << USB_OTGHS_DIEPINT5_XFERCOMPL_S)
#define USB_OTGHS_DIEPINT5_XFERCOMPL_V  0x00000001U
#define USB_OTGHS_DIEPINT5_XFERCOMPL_S  0
/** USB_OTGHS_DIEPINT5_EPDISBLD : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt (EPDisbld)
 *
 *  Applies to IN and OUT endpoints.
 *
 *  This bit indicates that the endpoint is disabled per the application's request.
 */
#define USB_OTGHS_DIEPINT5_EPDISBLD    (BIT(1))
#define USB_OTGHS_DIEPINT5_EPDISBLD_M  (USB_OTGHS_DIEPINT5_EPDISBLD_V << USB_OTGHS_DIEPINT5_EPDISBLD_S)
#define USB_OTGHS_DIEPINT5_EPDISBLD_V  0x00000001U
#define USB_OTGHS_DIEPINT5_EPDISBLD_S  1
/** USB_OTGHS_DIEPINT5_AHBERR : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErr)
 *
 *  Applies to IN and OUT endpoints.
 *
 *  This is generated only in Internal DMA mode when there is an AHB error during an
 *  AHB read/write. The application can read the corresponding endpoint DMA address
 *  register to get the error address. For details, see AHB Error Handling in the
 *  Programming Guide.
 */
#define USB_OTGHS_DIEPINT5_AHBERR    (BIT(2))
#define USB_OTGHS_DIEPINT5_AHBERR_M  (USB_OTGHS_DIEPINT5_AHBERR_V << USB_OTGHS_DIEPINT5_AHBERR_S)
#define USB_OTGHS_DIEPINT5_AHBERR_V  0x00000001U
#define USB_OTGHS_DIEPINT5_AHBERR_S  2
/** USB_OTGHS_DIEPINT5_TIMEOUT : R/W; bitpos: [3]; default: 0;
 *  Timeout Condition (TimeOUT)
 *  - In shared TX FIFO mode, applies to non-isochronous IN endpoints only.
 *  - In dedicated FIFO mode, applies only to Control IN endpoints.
 *  - In Scatter/Gather DMA mode, the TimeOUT interrupt is not asserted.
 *  Indicates that the core has detected a timeout condition on the USB for the last IN
 *  token on this endpoint.
 */
#define USB_OTGHS_DIEPINT5_TIMEOUT    (BIT(3))
#define USB_OTGHS_DIEPINT5_TIMEOUT_M  (USB_OTGHS_DIEPINT5_TIMEOUT_V << USB_OTGHS_DIEPINT5_TIMEOUT_S)
#define USB_OTGHS_DIEPINT5_TIMEOUT_V  0x00000001U
#define USB_OTGHS_DIEPINT5_TIMEOUT_S  3
/** USB_OTGHS_DIEPINT5_INTKNTXFEMP : R/W; bitpos: [4]; default: 0;
 *  IN Token Received When TxFIFO is Empty (INTknTXFEmp)
 *
 *  Applies to non-periodic IN endpoints only.
 *
 *  Indicates that an IN token was received when the associated TxFIFO
 *  (periodic/non-periodic) was empty. This interrupt is asserted on the endpoint for
 *  which the IN token was received.
 */
#define USB_OTGHS_DIEPINT5_INTKNTXFEMP    (BIT(4))
#define USB_OTGHS_DIEPINT5_INTKNTXFEMP_M  (USB_OTGHS_DIEPINT5_INTKNTXFEMP_V << USB_OTGHS_DIEPINT5_INTKNTXFEMP_S)
#define USB_OTGHS_DIEPINT5_INTKNTXFEMP_V  0x00000001U
#define USB_OTGHS_DIEPINT5_INTKNTXFEMP_S  4
/** USB_OTGHS_DIEPINT5_INTKNEPMIS : R/W; bitpos: [5]; default: 0;
 *  IN Token Received with EP Mismatch (INTknEPMis)
 *
 *  Applies to non-periodic IN endpoints only.
 *
 *  Indicates that the data in the top of the non-periodic TxFIFO belongs to an
 *  endpoint other than the one for which the IN token was received. This interrupt is
 *  asserted on the endpoint for which the IN token was received.
 */
#define USB_OTGHS_DIEPINT5_INTKNEPMIS    (BIT(5))
#define USB_OTGHS_DIEPINT5_INTKNEPMIS_M  (USB_OTGHS_DIEPINT5_INTKNEPMIS_V << USB_OTGHS_DIEPINT5_INTKNEPMIS_S)
#define USB_OTGHS_DIEPINT5_INTKNEPMIS_V  0x00000001U
#define USB_OTGHS_DIEPINT5_INTKNEPMIS_S  5
/** USB_OTGHS_DIEPINT5_INEPNAKEFF : R/W; bitpos: [6]; default: 0;
 *  IN Endpoint NAK Effective (INEPNakEff)
 *
 *  Applies to periodic IN endpoints only.
 *
 *  This bit can be cleared when the application clears the IN endpoint NAK by writing
 *  to DIEPCTLn.CNAK.
 *
 *  This interrupt indicates that the core has sampled the NAK bit
 *
 *  Set (either by the application or by the core). The interrupt indicates that the IN
 *  endpoint NAK bit Set by the application has taken effect in the core.
 *
 *  This interrupt does not guarantee that a NAK handshake is sent on the USB. A STALL
 *  bit takes priority over a NAK bit.
 */
#define USB_OTGHS_DIEPINT5_INEPNAKEFF    (BIT(6))
#define USB_OTGHS_DIEPINT5_INEPNAKEFF_M  (USB_OTGHS_DIEPINT5_INEPNAKEFF_V << USB_OTGHS_DIEPINT5_INEPNAKEFF_S)
#define USB_OTGHS_DIEPINT5_INEPNAKEFF_V  0x00000001U
#define USB_OTGHS_DIEPINT5_INEPNAKEFF_S  6
/** USB_OTGHS_DIEPINT5_TXFEMP : RO; bitpos: [7]; default: 1;
 *  Transmit FIFO Empty (TxFEmp)
 *
 *  This bit is valid only for IN endpoints
 *
 *  This interrupt is asserted when the TxFIFO for this endpoint is
 *  either half or completely empty. The half or completely empty
 *  status is determined by the TxFIFO Empty Level bit in the Core
 *  AHB Configuration register (GAHBCFG.NPTxFEmpLvl)).
 */
#define USB_OTGHS_DIEPINT5_TXFEMP    (BIT(7))
#define USB_OTGHS_DIEPINT5_TXFEMP_M  (USB_OTGHS_DIEPINT5_TXFEMP_V << USB_OTGHS_DIEPINT5_TXFEMP_S)
#define USB_OTGHS_DIEPINT5_TXFEMP_V  0x00000001U
#define USB_OTGHS_DIEPINT5_TXFEMP_S  7
/** USB_OTGHS_DIEPINT5_TXFIFOUNDRN : R/W; bitpos: [8]; default: 0;
 *  Fifo Underrun (TxfifoUndrn)
 *
 *  Applies to IN endpoints Only
 *
 *  This bit is valid only If thresholding is enabled. The core generates this
 *  interrupt when
 *  it detects a transmit FIFO underrun condition for this endpoint.
 */
#define USB_OTGHS_DIEPINT5_TXFIFOUNDRN    (BIT(8))
#define USB_OTGHS_DIEPINT5_TXFIFOUNDRN_M  (USB_OTGHS_DIEPINT5_TXFIFOUNDRN_V << USB_OTGHS_DIEPINT5_TXFIFOUNDRN_S)
#define USB_OTGHS_DIEPINT5_TXFIFOUNDRN_V  0x00000001U
#define USB_OTGHS_DIEPINT5_TXFIFOUNDRN_S  8
/** USB_OTGHS_DIEPINT5_BNAINTR : R/W; bitpos: [9]; default: 0;
 *  BNA (Buffer Not Available) Interrupt (BNAIntr)
 *
 *  This bit is valid only when Scatter/Gather DMA mode is enabled.
 *
 *  The core generates this interrupt when the descriptor accessed is not ready for the
 *  Core to process, such as Host busy or DMA done.
 */
#define USB_OTGHS_DIEPINT5_BNAINTR    (BIT(9))
#define USB_OTGHS_DIEPINT5_BNAINTR_M  (USB_OTGHS_DIEPINT5_BNAINTR_V << USB_OTGHS_DIEPINT5_BNAINTR_S)
#define USB_OTGHS_DIEPINT5_BNAINTR_V  0x00000001U
#define USB_OTGHS_DIEPINT5_BNAINTR_S  9
/** USB_OTGHS_DIEPINT5_PKTDRPSTS : R/W; bitpos: [11]; default: 0;
 *  Packet Drop Status (PktDrpSts)
 *
 *  This bit indicates to the application that an ISOC OUT packet has been dropped. This
 *  bit does not have an associated mask bit and does not generate an interrupt.
 *
 *  Dependency: This bit is valid in non Scatter/Gather DMA mode when periodic transfer
 *  interrupt feature is selected.
 */
#define USB_OTGHS_DIEPINT5_PKTDRPSTS    (BIT(11))
#define USB_OTGHS_DIEPINT5_PKTDRPSTS_M  (USB_OTGHS_DIEPINT5_PKTDRPSTS_V << USB_OTGHS_DIEPINT5_PKTDRPSTS_S)
#define USB_OTGHS_DIEPINT5_PKTDRPSTS_V  0x00000001U
#define USB_OTGHS_DIEPINT5_PKTDRPSTS_S  11
/** USB_OTGHS_DIEPINT5_BBLEERR : R/W; bitpos: [12]; default: 0;
 *  NAK Interrupt (BbleErr)
 *
 *  The core generates this interrupt when babble is received for the endpoint.
 */
#define USB_OTGHS_DIEPINT5_BBLEERR    (BIT(12))
#define USB_OTGHS_DIEPINT5_BBLEERR_M  (USB_OTGHS_DIEPINT5_BBLEERR_V << USB_OTGHS_DIEPINT5_BBLEERR_S)
#define USB_OTGHS_DIEPINT5_BBLEERR_V  0x00000001U
#define USB_OTGHS_DIEPINT5_BBLEERR_S  12
/** USB_OTGHS_DIEPINT5_NAKINTRPT : R/W; bitpos: [13]; default: 0;
 *  NAK Interrupt (NAKInterrupt)
 *
 *  The core generates this interrupt when a NAK is transmitted or received by the
 *  device.
 *  In case of isochronous IN endpoints the interrupt gets generated when a zero length
 *  packet is transmitted due to un-availability of data in the TXFifo.
 */
#define USB_OTGHS_DIEPINT5_NAKINTRPT    (BIT(13))
#define USB_OTGHS_DIEPINT5_NAKINTRPT_M  (USB_OTGHS_DIEPINT5_NAKINTRPT_V << USB_OTGHS_DIEPINT5_NAKINTRPT_S)
#define USB_OTGHS_DIEPINT5_NAKINTRPT_V  0x00000001U
#define USB_OTGHS_DIEPINT5_NAKINTRPT_S  13
/** USB_OTGHS_DIEPINT5_NYETINTRPT : R/W; bitpos: [14]; default: 0;
 *  NYET Interrupt (NYETIntrpt)
 *
 *  The core generates this interrupt when a NYET response is transmitted for a non
 *  isochronous OUT endpoint.
 */
#define USB_OTGHS_DIEPINT5_NYETINTRPT    (BIT(14))
#define USB_OTGHS_DIEPINT5_NYETINTRPT_M  (USB_OTGHS_DIEPINT5_NYETINTRPT_V << USB_OTGHS_DIEPINT5_NYETINTRPT_S)
#define USB_OTGHS_DIEPINT5_NYETINTRPT_V  0x00000001U
#define USB_OTGHS_DIEPINT5_NYETINTRPT_S  14

