espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_DOEPINT5_REG register
 *  This register contains the interrupts for the OUT Endpoint 5 of the Device
 *  controller.
 */
#define USB_OTGHS_DOEPINT5_REG (DR_REG_USB_OTGHS_BASE + 0xba8)
/** USB_OTGHS_DOEPINT5_XFERCOMPL : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt (XferCompl)
 *
 *  Applies to IN and OUT endpoints.
 *  - When Scatter/Gather DMA mode is enabled
 *  -- For IN endpoint this field indicates that the requested data from the descriptor
 *  is moved from external system memory to internal FIFO.
 *  -- For OUT endpoint this field indicates that the requested data from the internal
 *  FIFO is moved to external system memory. This interrupt is generated only when the
 *  corresponding endpoint descriptor is closed, and the IOC bit for the corresponding
 *  descriptor is Set.
 *  - When Scatter/Gather DMA mode is disabled, this field indicates that the
 *  programmed transfer is complete on the AHB as well as on the USB, for this endpoint.
 */
#define USB_OTGHS_DOEPINT5_XFERCOMPL    (BIT(0))
#define USB_OTGHS_DOEPINT5_XFERCOMPL_M  (USB_OTGHS_DOEPINT5_XFERCOMPL_V << USB_OTGHS_DOEPINT5_XFERCOMPL_S)
#define USB_OTGHS_DOEPINT5_XFERCOMPL_V  0x00000001U
#define USB_OTGHS_DOEPINT5_XFERCOMPL_S  0
/** USB_OTGHS_DOEPINT5_EPDISBLD : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt (EPDisbld)
 *
 *  Applies to IN and OUT endpoints.
 *
 *  This bit indicates that the endpoint is disabled per the application's request.
 */
#define USB_OTGHS_DOEPINT5_EPDISBLD    (BIT(1))
#define USB_OTGHS_DOEPINT5_EPDISBLD_M  (USB_OTGHS_DOEPINT5_EPDISBLD_V << USB_OTGHS_DOEPINT5_EPDISBLD_S)
#define USB_OTGHS_DOEPINT5_EPDISBLD_V  0x00000001U
#define USB_OTGHS_DOEPINT5_EPDISBLD_S  1
/** USB_OTGHS_DOEPINT5_AHBERR : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErr)
 *
 *  Applies to IN and OUT endpoints.
 *
 *  This is generated only in Internal DMA mode when there is an AHB error during an
 *  AHB read/write. The application can read the corresponding endpoint DMA address
 *  register to get the error address. For details, see AHB Error Handling section in
 *  the Programming Guide.
 */
#define USB_OTGHS_DOEPINT5_AHBERR    (BIT(2))
#define USB_OTGHS_DOEPINT5_AHBERR_M  (USB_OTGHS_DOEPINT5_AHBERR_V << USB_OTGHS_DOEPINT5_AHBERR_S)
#define USB_OTGHS_DOEPINT5_AHBERR_V  0x00000001U
#define USB_OTGHS_DOEPINT5_AHBERR_S  2
/** USB_OTGHS_DOEPINT5_SETUP : R/W; bitpos: [3]; default: 0;
 *  SETUP Phase Done (SetUp)
 *
 *  Applies to control OUT endpoints only.
 *
 *  Indicates that the SETUP phase for the control endpoint is
 *  complete and no more back-to-back SETUP packets were
 *  received for the current control transfer. On this interrupt, the
 *  application can decode the received SETUP data packet.
 */
#define USB_OTGHS_DOEPINT5_SETUP    (BIT(3))
#define USB_OTGHS_DOEPINT5_SETUP_M  (USB_OTGHS_DOEPINT5_SETUP_V << USB_OTGHS_DOEPINT5_SETUP_S)
#define USB_OTGHS_DOEPINT5_SETUP_V  0x00000001U
#define USB_OTGHS_DOEPINT5_SETUP_S  3
/** USB_OTGHS_DOEPINT5_OUTTKNEPDIS : R/W; bitpos: [4]; default: 0;
 *  OUT Token Received When Endpoint Disabled (OUTTknEPdis)
 *
 *  Applies only to control OUT endpoints.
 *
 *  Indicates that an OUT token was received when the endpoint was not yet enabled.
 *  This interrupt is asserted on the endpoint for which the OUT token was received.
 */
#define USB_OTGHS_DOEPINT5_OUTTKNEPDIS    (BIT(4))
#define USB_OTGHS_DOEPINT5_OUTTKNEPDIS_M  (USB_OTGHS_DOEPINT5_OUTTKNEPDIS_V << USB_OTGHS_DOEPINT5_OUTTKNEPDIS_S)
#define USB_OTGHS_DOEPINT5_OUTTKNEPDIS_V  0x00000001U
#define USB_OTGHS_DOEPINT5_OUTTKNEPDIS_S  4
/** USB_OTGHS_DOEPINT5_STSPHSERCVD : R/W; bitpos: [5]; default: 0;
 *  Status Phase Received for Control Write (StsPhseRcvd)
 *
 *  This interrupt is valid only for Control OUT endpoints.
 *
 *  This interrupt is generated only after the core has transferred all
 *  the data that the host has sent during the data phase of a control
 *  write transfer, to the system memory buffer.
 *
 *  The interrupt indicates to the application that the host has
 *  switched from data phase to the status phase of a Control Write
 *  transfer. The application can use this interrupt to ACK or STALL
 *  the Status phase, after it has decoded the data phase.
 */
#define USB_OTGHS_DOEPINT5_STSPHSERCVD    (BIT(5))
#define USB_OTGHS_DOEPINT5_STSPHSERCVD_M  (USB_OTGHS_DOEPINT5_STSPHSERCVD_V << USB_OTGHS_DOEPINT5_STSPHSERCVD_S)
#define USB_OTGHS_DOEPINT5_STSPHSERCVD_V  0x00000001U
#define USB_OTGHS_DOEPINT5_STSPHSERCVD_S  5
/** USB_OTGHS_DOEPINT5_BACK2BACKSETUP : R/W; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received (Back2BackSETup)
 *
 *  Applies to Control OUT endpoints only.
 *
 *  This bit indicates that the core has received more than three
 *  back-to-back SETUP packets for this particular endpoint. For
 *  information about handling this interrupt,
 */
#define USB_OTGHS_DOEPINT5_BACK2BACKSETUP    (BIT(6))
#define USB_OTGHS_DOEPINT5_BACK2BACKSETUP_M  (USB_OTGHS_DOEPINT5_BACK2BACKSETUP_V << USB_OTGHS_DOEPINT5_BACK2BACKSETUP_S)
#define USB_OTGHS_DOEPINT5_BACK2BACKSETUP_V  0x00000001U
#define USB_OTGHS_DOEPINT5_BACK2BACKSETUP_S  6
/** USB_OTGHS_DOEPINT5_OUTPKTERR : R/W; bitpos: [8]; default: 0;
 *  OUT Packet Error (OutPktErr)
 *
 *  Applies to OUT endpoints Only
 *
 *  This interrupt is valid only when thresholding is enabled. This interrupt is
 *  asserted when the
 *  core detects an overflow or a CRC error for non-Isochronous OUT packet.
 */
#define USB_OTGHS_DOEPINT5_OUTPKTERR    (BIT(8))
#define USB_OTGHS_DOEPINT5_OUTPKTERR_M  (USB_OTGHS_DOEPINT5_OUTPKTERR_V << USB_OTGHS_DOEPINT5_OUTPKTERR_S)
#define USB_OTGHS_DOEPINT5_OUTPKTERR_V  0x00000001U
#define USB_OTGHS_DOEPINT5_OUTPKTERR_S  8
/** USB_OTGHS_DOEPINT5_BNAINTR : R/W; bitpos: [9]; default: 0;
 *  BNA (Buffer Not Available) Interrupt (BNAIntr)
 *
 *  This bit is valid only when Scatter/Gather DMA mode is enabled.
 *
 *  The core generates this interrupt when the descriptor accessed
 *  is not ready for the Core to process, such as Host busy or DMA
 *  done
 */
#define USB_OTGHS_DOEPINT5_BNAINTR    (BIT(9))
#define USB_OTGHS_DOEPINT5_BNAINTR_M  (USB_OTGHS_DOEPINT5_BNAINTR_V << USB_OTGHS_DOEPINT5_BNAINTR_S)
#define USB_OTGHS_DOEPINT5_BNAINTR_V  0x00000001U
#define USB_OTGHS_DOEPINT5_BNAINTR_S  9
/** USB_OTGHS_DOEPINT5_PKTDRPSTS : R/W; bitpos: [11]; default: 0;
 *  Packet Drop Status (PktDrpSts)
 *
 *  This bit indicates to the application that an ISOC OUT packet has been dropped. This
 *  bit does not have an associated mask bit and does not generate an interrupt.
 *
 *  Dependency: This bit is valid in non Scatter/Gather DMA mode when periodic transfer
 *  interrupt feature is selected.
 */
#define USB_OTGHS_DOEPINT5_PKTDRPSTS    (BIT(11))
#define USB_OTGHS_DOEPINT5_PKTDRPSTS_M  (USB_OTGHS_DOEPINT5_PKTDRPSTS_V << USB_OTGHS_DOEPINT5_PKTDRPSTS_S)
#define USB_OTGHS_DOEPINT5_PKTDRPSTS_V  0x00000001U
#define USB_OTGHS_DOEPINT5_PKTDRPSTS_S  11
/** USB_OTGHS_DOEPINT5_BBLEERR : R/W; bitpos: [12]; default: 0;
 *  NAK Interrupt (BbleErr)
 *
 *  The core generates this interrupt when babble is received for the endpoint.
 */
#define USB_OTGHS_DOEPINT5_BBLEERR    (BIT(12))
#define USB_OTGHS_DOEPINT5_BBLEERR_M  (USB_OTGHS_DOEPINT5_BBLEERR_V << USB_OTGHS_DOEPINT5_BBLEERR_S)
#define USB_OTGHS_DOEPINT5_BBLEERR_V  0x00000001U
#define USB_OTGHS_DOEPINT5_BBLEERR_S  12
/** USB_OTGHS_DOEPINT5_NAKINTRPT : R/W; bitpos: [13]; default: 0;
 *  NAK Interrupt (NAKInterrupt)
 *
 *  The core generates this interrupt when a NAK is transmitted or received by the
 *  device.
 *
 *  In case of isochronous IN endpoints the interrupt gets generated when a zero length
 *  packet is transmitted due to un-availability of data in the TXFifo.
 */
#define USB_OTGHS_DOEPINT5_NAKINTRPT    (BIT(13))
#define USB_OTGHS_DOEPINT5_NAKINTRPT_M  (USB_OTGHS_DOEPINT5_NAKINTRPT_V << USB_OTGHS_DOEPINT5_NAKINTRPT_S)
#define USB_OTGHS_DOEPINT5_NAKINTRPT_V  0x00000001U
#define USB_OTGHS_DOEPINT5_NAKINTRPT_S  13
/** USB_OTGHS_DOEPINT5_NYETINTRPT : R/W; bitpos: [14]; default: 0;
 *  NYET Interrupt (NYETIntrpt)
 *
 *  The core generates this interrupt when a NYET response is transmitted for a non
 *  isochronous OUT endpoint.
 */
#define USB_OTGHS_DOEPINT5_NYETINTRPT    (BIT(14))
#define USB_OTGHS_DOEPINT5_NYETINTRPT_M  (USB_OTGHS_DOEPINT5_NYETINTRPT_V << USB_OTGHS_DOEPINT5_NYETINTRPT_S)
#define USB_OTGHS_DOEPINT5_NYETINTRPT_V  0x00000001U
#define USB_OTGHS_DOEPINT5_NYETINTRPT_S  14
/** USB_OTGHS_DOEPINT5_STUPPKTRCVD : R/W; bitpos: [15]; default: 0;
 *  Setup Packet Received
 *
 *  Applicable for Control OUT Endpoints in only in the Buffer DMA Mode
 *
 *  Set by the controller, this bit indicates that this buffer holds 8 bytes of
 *  setup data. There is only one Setup packet per buffer. On receiving a
 *  Setup packet, the controller closes the buffer and disables the
 *  corresponding endpoint. The application has to re-enable the endpoint to
 *  receive any OUT data for the Control Transfer and reprogram the buffer
 *  start address.
 *
 *  Note: Because of the above behavior, the controller can receive any
 *  number of back to back setup packets and one buffer for every setup
 *  packet is used.
 *  - 1'b0: No Setup packet received
 *  - 1'b1: Setup packet received
 *  Reset: 1'b0
 */
#define USB_OTGHS_DOEPINT5_STUPPKTRCVD    (BIT(15))
#define USB_OTGHS_DOEPINT5_STUPPKTRCVD_M  (USB_OTGHS_DOEPINT5_STUPPKTRCVD_V << USB_OTGHS_DOEPINT5_STUPPKTRCVD_S)
#define USB_OTGHS_DOEPINT5_STUPPKTRCVD_V  0x00000001U
#define USB_OTGHS_DOEPINT5_STUPPKTRCVD_S  15

/** USB_OTGHS_DOEPTSIZ5_REG register
 *  This register contains the Transfer Size for the OUT Endpoint 5 of the Device
 *  controller.
 */
#define USB_OTGHS_DOEPTSIZ5_REG (DR_REG_USB_OTGHS_BASE + 0xbb0)
/** USB_OTGHS_DOEPTSIZ5_XFERSIZE : R/W; bitpos: [18:0]; default: 0;
 *  Transfer Size (XferSize)
 *
 *  Indicates the transfer size in bytes for the endpoint. The core
 *  interrupts the application only after it has exhausted the transfer
 *  size amount of data. The transfer size can be Set to the
 *  maximum packet size of the endpoint, to be interrupted at the
 *  end of each packet.
 *
 *  The core decrements this field every time a packet is read from
 *  the RxFIFO and written to the external memory.
 */
#define USB_OTGHS_DOEPTSIZ5_XFERSIZE    0x0007FFFFU
#define USB_OTGHS_DOEPTSIZ5_XFERSIZE_M  (USB_OTGHS_DOEPTSIZ5_XFERSIZE_V << USB_OTGHS_DOEPTSIZ5_XFERSIZE_S)
#define USB_OTGHS_DOEPTSIZ5_XFERSIZE_V  0x0007FFFFU
#define USB_OTGHS_DOEPTSIZ5_XFERSIZE_S  0
/** USB_OTGHS_DOEPTSIZ5_PKTCNT : R/W; bitpos: [28:19]; default: 0;
 *  Packet Count (PktCnt)
 *  This field is decremented to zero after a packet is written into the RxFIFO.
 */
#define USB_OTGHS_DOEPTSIZ5_PKTCNT    0x000003FFU
#define USB_OTGHS_DOEPTSIZ5_PKTCNT_M  (USB_OTGHS_DOEPTSIZ5_PKTCNT_V << USB_OTGHS_DOEPTSIZ5_PKTCNT_S)
#define USB_OTGHS_DOEPTSIZ5_PKTCNT_V  0x000003FFU
#define USB_OTGHS_DOEPTSIZ5_PKTCNT_S  19
/** USB_OTGHS_DOEPTSIZ5_RXDPID : RO; bitpos: [30:29]; default: 0;
 *  RxDPID
 *
 *  Applies to isochronous OUT endpoints only.
 *
 *  This is the data PID received in the last packet for this endpoint.
 *  - 2'b00: DATA0
 *  - 2'b01: DATA2
 *  - 2'b10: DATA1
 *  - 2'b11: MDATA
 *  SETUP Packet Count (SUPCnt)
 *
 *  Applies to control OUT Endpoints only.
 *
 *  This field specifies the number of back-to-back SETUP data
 *  packets the endpoint can receive.
 *  - 2'b01: 1 packet
 *  - 2'b10: 2 packets
 *  - 2'b11: 3 packets
 */
#define USB_OTGHS_DOEPTSIZ5_RXDPID    0x00000003U
#define USB_OTGHS_DOEPTSIZ5_RXDPID_M  (USB_OTGHS_DOEPTSIZ5_RXDPID_V << USB_OTGHS_DOEPTSIZ5_RXDPID_S)
#define USB_OTGHS_DOEPTSIZ5_RXDPID_V  0x00000003U
#define USB_OTGHS_DOEPTSIZ5_RXDPID_S  29

/** USB_OTGHS_DOEPDMA5_REG register
 *  This register contains the DMA Address for the OUT Endpoint 5 of the Device
 *  controller.
 */
#define USB_OTGHS_DOEPDMA5_REG (DR_REG_USB_OTGHS_BASE + 0xbb4)
/** USB_OTGHS_DOEPDMA5_DMAADDR : R/W; bitpos: [31:0]; default: 0;
 *  Holds the start address of the external memory for storing or fetching endpoint
 *  data.
 *
 *  Note: For control endpoints, this field stores control OUT data packets as well as
 *  SETUP transaction data packets. When more than three SETUP packets are
 *  received back-to-back, the SETUP data packet in the memory is overwritten.
 *
 *  This register is incremented on every AHB transaction. The application can give
 *  only a DWORD-aligned address.
 *  - When Scatter/Gather DMA mode is not enabled, the application programs the start
 *  address value in this field.
 *  - When Scatter/Gather DMA mode is enabled, this field indicates the base pointer
 *  for the descriptor list.
 */
#define USB_OTGHS_DOEPDMA5_DMAADDR    0xFFFFFFFFU
#define USB_OTGHS_DOEPDMA5_DMAADDR_M  (USB_OTGHS_DOEPDMA5_DMAADDR_V << USB_OTGHS_DOEPDMA5_DMAADDR_S)
#define USB_OTGHS_DOEPDMA5_DMAADDR_V  0xFFFFFFFFU
#define USB_OTGHS_DOEPDMA5_DMAADDR_S  0

/** USB_OTGHS_DOEPDMAB5_REG register
 *  This register contains the DMA Buffer Address for the OUT Endpoint 5 of the Device
 *  controller.
 */
#define USB_OTGHS_DOEPDMAB5_REG (DR_REG_USB_OTGHS_BASE + 0xbbc)
/** USB_OTGHS_DOEPDMAB5_DMABUFFERADDR : RO; bitpos: [31:0]; default: 0;
 *  Holds the current buffer address.This register is updated as and when the data
 *  transfer for the corresponding end point is in progress.
 *
 *  This register is present only in Scatter/Gather DMA mode. Otherwise this field is
 *  reserved.
 */
#define USB_OTGHS_DOEPDMAB5_DMABUFFERADDR    0xFFFFFFFFU
#define USB_OTGHS_DOEPDMAB5_DMABUFFERADDR_M  (USB_OTGHS_DOEPDMAB5_DMABUFFERADDR_V << USB_OTGHS_DOEPDMAB5_DMABUFFERADDR_S)
#define USB_OTGHS_DOEPDMAB5_DMABUFFERADDR_V  0xFFFFFFFFU
#define USB_OTGHS_DOEPDMAB5_DMABUFFERADDR_S  0

