espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_DOEPCTL11_REG register
 *  This register is used to control the characteristics of OUT Endpoint 11 of the
 *  Device controller.
 */
#define USB_OTGHS_DOEPCTL11_REG (DR_REG_USB_OTGHS_BASE + 0xc60)
/** USB_OTGHS_DOEPCTL11_MPS : R/W; bitpos: [10:0]; default: 0;
 *  Maximum Packet Size (MPS)
 *
 *  The application must program this field with the maximum packet size for the current
 *  logical endpoint. This value is in bytes.
 */
#define USB_OTGHS_DOEPCTL11_MPS    0x000007FFU
#define USB_OTGHS_DOEPCTL11_MPS_M  (USB_OTGHS_DOEPCTL11_MPS_V << USB_OTGHS_DOEPCTL11_MPS_S)
#define USB_OTGHS_DOEPCTL11_MPS_V  0x000007FFU
#define USB_OTGHS_DOEPCTL11_MPS_S  0
/** USB_OTGHS_DOEPCTL11_USBACTEP : R/W; bitpos: [15]; default: 0;
 *  USB Active Endpoint (USBActEP)
 *
 *  Indicates whether this endpoint is active in the current configuration and
 *  interface. The
 *  core clears this bit for all endpoints (other than EP 0) after detecting a USB
 *  reset. After
 *  receiving the SetConfiguration and SetInterface commands, the application must
 *  program endpoint registers accordingly and set this bit.
 */
#define USB_OTGHS_DOEPCTL11_USBACTEP    (BIT(15))
#define USB_OTGHS_DOEPCTL11_USBACTEP_M  (USB_OTGHS_DOEPCTL11_USBACTEP_V << USB_OTGHS_DOEPCTL11_USBACTEP_S)
#define USB_OTGHS_DOEPCTL11_USBACTEP_V  0x00000001U
#define USB_OTGHS_DOEPCTL11_USBACTEP_S  15
/** USB_OTGHS_DOEPCTL11_DPID : RO; bitpos: [16]; default: 0;
 *  Endpoint Data PID (DPID)
 *
 *  Applies to interrupt/bulk IN and OUT endpoints only.
 *
 *  Contains the PID of the packet to be received or transmitted on this endpoint. The
 *  application must program the PID of the first packet to be received or transmitted
 *  on
 *  this endpoint, after the endpoint is activated. The applications use the SetD1PID
 *  and
 *  SetD0PID fields of this register to program either DATA0 or DATA1 PID.
 *  - 1'b0: DATA0
 *  - 1'b1: DATA1
 *  This field is applicable for both Scatter/Gather DMA mode and non-Scatter/Gather
 *  DMA mode.
 *
 *  Reset: 1'b0
 *
 *  Even/Odd (Micro)Frame (EO_FrNum)
 *
 *  In non-Scatter/Gather DMA mode:
 *  - Applies to isochronous IN and OUT endpoints only.
 *  - Indicates the (micro)frame number in which the core transmits/receives
 *  isochronous data for this endpoint. The application must program the even/odd
 *  (micro)frame number in which it intends to transmit/receive isochronous data for
 *  this endpoint using the SetEvnFr and SetOddFr fields in this register.
 *  -- 1'b0: Even (micro)frame
 *  -- 1'b1: Odd (micro)frame
 *  - When Scatter/Gather DMA mode is enabled, this field is reserved. The frame number
 *  in which to send data is provided in the transmit descriptor structure. The frame
 *  in which data is received is updated in receive descriptor structure.
 *  Reset: 1'b0
 */
#define USB_OTGHS_DOEPCTL11_DPID    (BIT(16))
#define USB_OTGHS_DOEPCTL11_DPID_M  (USB_OTGHS_DOEPCTL11_DPID_V << USB_OTGHS_DOEPCTL11_DPID_S)
#define USB_OTGHS_DOEPCTL11_DPID_V  0x00000001U
#define USB_OTGHS_DOEPCTL11_DPID_S  16
/** USB_OTGHS_DOEPCTL11_NAKSTS : RO; bitpos: [17]; default: 0;
 *  NAK Status (NAKSts)
 *
 *  Indicates the following:
 *  - 1'b0: The core is transmitting non-NAK handshakes based on the FIFO status.
 *  - 1'b1: The core is transmitting NAK handshakes on this endpoint.
 *  When either the application or the core sets this bit:
 *  - The core stops receiving any data on an OUT endpoint, even if there is space in
 *  the RxFIFO to accommodate the incoming packet.
 *  - For non-isochronous IN endpoints: The core stops transmitting any data on an IN
 *  endpoint, even if there data is available in the TxFIFO.
 *  - For isochronous IN endpoints: The core sends out a zero-length data packet, even
 *  if there data is available in the TxFIFO.
 *  Irrespective of this bit's setting, the core always responds to SETUP data packets
 *  with an ACK handshake.
 */
#define USB_OTGHS_DOEPCTL11_NAKSTS    (BIT(17))
#define USB_OTGHS_DOEPCTL11_NAKSTS_M  (USB_OTGHS_DOEPCTL11_NAKSTS_V << USB_OTGHS_DOEPCTL11_NAKSTS_S)
#define USB_OTGHS_DOEPCTL11_NAKSTS_V  0x00000001U
#define USB_OTGHS_DOEPCTL11_NAKSTS_S  17
/** USB_OTGHS_DOEPCTL11_EPTYPE : R/W; bitpos: [19:18]; default: 0;
 *  Endpoint Type (EPType)
 *
 *  This is the transfer type supported by this logical endpoint.
 *  - 2'b00: Control
 *  - 2'b01: Isochronous
 *  - 2'b10: Bulk
 *  - 2'b11: Interrupt
 */
#define USB_OTGHS_DOEPCTL11_EPTYPE    0x00000003U
#define USB_OTGHS_DOEPCTL11_EPTYPE_M  (USB_OTGHS_DOEPCTL11_EPTYPE_V << USB_OTGHS_DOEPCTL11_EPTYPE_S)
#define USB_OTGHS_DOEPCTL11_EPTYPE_V  0x00000003U
#define USB_OTGHS_DOEPCTL11_EPTYPE_S  18
/** USB_OTGHS_DOEPCTL11_SNP : R/W; bitpos: [20]; default: 0;
 *  RESERVED
 */
#define USB_OTGHS_DOEPCTL11_SNP    (BIT(20))
#define USB_OTGHS_DOEPCTL11_SNP_M  (USB_OTGHS_DOEPCTL11_SNP_V << USB_OTGHS_DOEPCTL11_SNP_S)
#define USB_OTGHS_DOEPCTL11_SNP_V  0x00000001U
#define USB_OTGHS_DOEPCTL11_SNP_S  20
/** USB_OTGHS_DOEPCTL11_STALL : R/W; bitpos: [21]; default: 0;
 *  STALL Handshake (Stall)
 *
 *  Applies to non-control, non-isochronous IN and OUT endpoints only.
 *
 *  The application sets this bit to stall all tokens from the USB host to this
 *  endpoint. If a
 *  NAK bit, Global Non-periodic IN NAK, or Global OUT NAK is set along with this bit,
 *  the
 *  STALL bit takes priority. Only the application can clear this bit, never the core.
 *
 *  Applies to control endpoints only.
 *
 *  The application can only set this bit, and the core clears it, when a SETUP token is
 *  received for this endpoint. If a NAK bit, Global Non-periodic IN NAK, or Global OUT
 *  NAK is set along with this bit, the STALL bit takes priority. Irrespective of this
 *  bit's
 *  setting, the core always responds to SETUP data packets with an ACK handshake.
 */
#define USB_OTGHS_DOEPCTL11_STALL    (BIT(21))
#define USB_OTGHS_DOEPCTL11_STALL_M  (USB_OTGHS_DOEPCTL11_STALL_V << USB_OTGHS_DOEPCTL11_STALL_S)
#define USB_OTGHS_DOEPCTL11_STALL_V  0x00000001U
#define USB_OTGHS_DOEPCTL11_STALL_S  21
/** USB_OTGHS_DOEPCTL11_CNAK : R/W; bitpos: [26]; default: 0;
 *
 *  Clear NAK (CNAK)
 *  A write to this bit clears the NAK bit for the endpoint.
 */
#define USB_OTGHS_DOEPCTL11_CNAK    (BIT(26))
#define USB_OTGHS_DOEPCTL11_CNAK_M  (USB_OTGHS_DOEPCTL11_CNAK_V << USB_OTGHS_DOEPCTL11_CNAK_S)
#define USB_OTGHS_DOEPCTL11_CNAK_V  0x00000001U
#define USB_OTGHS_DOEPCTL11_CNAK_S  26
/** USB_OTGHS_DOEPCTL11_SNAK : R/W; bitpos: [27]; default: 0;
 *  Set NAK (SNAK)
 *
 *  A write to this bit sets the NAK bit for the endpoint.
 *
 *  Using this bit, the application can control the transmission of NAK
 *  handshakes on an endpoint. The core can also set this bit for an
 *  endpoint after a SETUP packet is received on that endpoint.
 */
#define USB_OTGHS_DOEPCTL11_SNAK    (BIT(27))
#define USB_OTGHS_DOEPCTL11_SNAK_M  (USB_OTGHS_DOEPCTL11_SNAK_V << USB_OTGHS_DOEPCTL11_SNAK_S)
#define USB_OTGHS_DOEPCTL11_SNAK_V  0x00000001U
#define USB_OTGHS_DOEPCTL11_SNAK_S  27
/** USB_OTGHS_DOEPCTL11_SETD0PID : R/W; bitpos: [28]; default: 0;
 *  Set DATA0 PID (SetD0PID)
 *  - Applies to interrupt/bulk IN and OUT endpoints only.
 *  - Writing to this field sets the Endpoint Data PID (DPID) field in this register to
 *  DATA0.
 *  - This field is applicable both for Scatter/Gather DMA mode and non-Scatter/Gather
 *  DMA mode.
 *  Reset: 1'b0
 *
 *  In non-Scatter/Gather DMA mode: Set Even (micro)frame (SetEvenFr)
 *  - Applies to isochronous IN and OUT endpoints only.
 *  - Writing to this field sets the Even/Odd (micro)frame (EO_FrNum) field to even
 *  (micro)frame.
 *  - When Scatter/Gather DMA mode is enabled, this field is reserved. The frame number
 *  in which to send data is in the transmit descriptor structure. The frame in which
 *  to receive data is updated in receive descriptor structure.
 *  Reset: 1'b0
 */
#define USB_OTGHS_DOEPCTL11_SETD0PID    (BIT(28))
#define USB_OTGHS_DOEPCTL11_SETD0PID_M  (USB_OTGHS_DOEPCTL11_SETD0PID_V << USB_OTGHS_DOEPCTL11_SETD0PID_S)
#define USB_OTGHS_DOEPCTL11_SETD0PID_V  0x00000001U
#define USB_OTGHS_DOEPCTL11_SETD0PID_S  28
/** USB_OTGHS_DOEPCTL11_SETD1PID : R/W; bitpos: [29]; default: 0;
 *  Set DATA1 PID (SetD1PID)
 *  - Applies to interrupt and bulk IN and OUT endpoints only.
 *  - Writing to this field sets the Endpoint Data PID (DPID) field in this register to
 *  DATA1.
 *  - This field is applicable both for scatter-gather DMA mode and non scatter-gather
 *  DMA mode.
 *  Reset: 1'b0
 *
 *  Set Odd (micro)frame (SetOddFr)
 *  - Applies to isochronous IN and OUT endpoints only.
 *  - Writing to this field sets the even and odd (micro)frame (EO_FrNum) field to odd
 *  (micro)frame.
 *  Reset: 1'b0
 */
#define USB_OTGHS_DOEPCTL11_SETD1PID    (BIT(29))
#define USB_OTGHS_DOEPCTL11_SETD1PID_M  (USB_OTGHS_DOEPCTL11_SETD1PID_V << USB_OTGHS_DOEPCTL11_SETD1PID_S)
#define USB_OTGHS_DOEPCTL11_SETD1PID_V  0x00000001U
#define USB_OTGHS_DOEPCTL11_SETD1PID_S  29
/** USB_OTGHS_DOEPCTL11_EPDIS : R/W; bitpos: [30]; default: 0;
 *  Endpoint Disable (EPDis)
 *
 *  Applies to IN and OUT endpoints.
 *
 *  The application sets this bit to stop transmitting/receiving data on an endpoint,
 *  even
 *  before the transfer for that endpoint is complete. The application must wait for the
 *  Endpoint Disabled interrupt before treating the endpoint as disabled. The core
 *  clears
 *  this bit before setting the Endpoint Disabled interrupt. The application must set
 *  this bit
 *  only if Endpoint Enable is already set for this endpoint.
 */
#define USB_OTGHS_DOEPCTL11_EPDIS    (BIT(30))
#define USB_OTGHS_DOEPCTL11_EPDIS_M  (USB_OTGHS_DOEPCTL11_EPDIS_V << USB_OTGHS_DOEPCTL11_EPDIS_S)
#define USB_OTGHS_DOEPCTL11_EPDIS_V  0x00000001U
#define USB_OTGHS_DOEPCTL11_EPDIS_S  30
/** USB_OTGHS_DOEPCTL11_EPENA : R/W; bitpos: [31]; default: 0;
 *  Endpoint Enable (EPEna)
 *
 *  Applies to IN and OUT endpoints.
 *
 *  When Scatter/Gather DMA mode is enabled,
 *  - For IN endpoints this bit indicates that the descriptor structure and data buffer
 *  with data ready to transmit is setup.
 *  - For OUT endpoint it indicates that the descriptor structure and data buffer to
 *  receive data is setup.
 *  When Scatter/Gather DMA mode is enabled such as for buffer-pointer based DMA mode:
 *  - For IN endpoints, this bit indicates that data is ready to be transmitted on the
 *  endpoint.
 *  - For OUT endpoints, this bit indicates that the application has allocated the
 *  memory to start receiving data from the USB.
 *  The core clears this bit before setting any of the following interrupts on this
 *  endpoint:
 *  - SETUP Phase Done
 *  - Endpoint Disabled
 *  - Transfer Completed
 *  Note: For control endpoints in DMA mode, this bit must be set for the controller to
 *  transfer SETUP data packets to the memory. This bit is not cleared on Transfer
 *  Completed interrupt of the SETUP packet.
 */
#define USB_OTGHS_DOEPCTL11_EPENA    (BIT(31))
#define USB_OTGHS_DOEPCTL11_EPENA_M  (USB_OTGHS_DOEPCTL11_EPENA_V << USB_OTGHS_DOEPCTL11_EPENA_S)
#define USB_OTGHS_DOEPCTL11_EPENA_V  0x00000001U
#define USB_OTGHS_DOEPCTL11_EPENA_S  31

/** USB_OTGHS_DOEPINT11_REG register
 *  This register contains the interrupts for the OUT Endpoint 11 of the Device
 *  controller.
 */
#define USB_OTGHS_DOEPINT11_REG (DR_REG_USB_OTGHS_BASE + 0xc68)
/** USB_OTGHS_DOEPINT11_XFERCOMPL : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt (XferCompl)
 *
 *  Applies to IN and OUT endpoints.
 *  - When Scatter/Gather DMA mode is enabled
 *  -- For IN endpoint this field indicates that the requested data from the descriptor
 *  is moved from external system memory to internal FIFO.
 *  -- For OUT endpoint this field indicates that the requested data from the internal
 *  FIFO is moved to external system memory. This interrupt is generated only when the
 *  corresponding endpoint descriptor is closed, and the IOC bit for the corresponding
 *  descriptor is Set.
 *  - When Scatter/Gather DMA mode is disabled, this field indicates that the
 *  programmed transfer is complete on the AHB as well as on the USB, for this endpoint.
 */
#define USB_OTGHS_DOEPINT11_XFERCOMPL    (BIT(0))
#define USB_OTGHS_DOEPINT11_XFERCOMPL_M  (USB_OTGHS_DOEPINT11_XFERCOMPL_V << USB_OTGHS_DOEPINT11_XFERCOMPL_S)
#define USB_OTGHS_DOEPINT11_XFERCOMPL_V  0x00000001U
#define USB_OTGHS_DOEPINT11_XFERCOMPL_S  0
/** USB_OTGHS_DOEPINT11_EPDISBLD : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt (EPDisbld)
 *
 *  Applies to IN and OUT endpoints.
 *
 *  This bit indicates that the endpoint is disabled per the application's request.
 */
#define USB_OTGHS_DOEPINT11_EPDISBLD    (BIT(1))
#define USB_OTGHS_DOEPINT11_EPDISBLD_M  (USB_OTGHS_DOEPINT11_EPDISBLD_V << USB_OTGHS_DOEPINT11_EPDISBLD_S)
#define USB_OTGHS_DOEPINT11_EPDISBLD_V  0x00000001U
#define USB_OTGHS_DOEPINT11_EPDISBLD_S  1
/** USB_OTGHS_DOEPINT11_AHBERR : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErr)
 *
 *  Applies to IN and OUT endpoints.
 *
 *  This is generated only in Internal DMA mode when there is an AHB error during an
 *  AHB read/write. The application can read the corresponding endpoint DMA address
 *  register to get the error address. For details, see AHB Error Handling section in
 *  the Programming Guide.
 */
#define USB_OTGHS_DOEPINT11_AHBERR    (BIT(2))
#define USB_OTGHS_DOEPINT11_AHBERR_M  (USB_OTGHS_DOEPINT11_AHBERR_V << USB_OTGHS_DOEPINT11_AHBERR_S)
#define USB_OTGHS_DOEPINT11_AHBERR_V  0x00000001U
#define USB_OTGHS_DOEPINT11_AHBERR_S  2
/** USB_OTGHS_DOEPINT11_SETUP : R/W; bitpos: [3]; default: 0;
 *  SETUP Phase Done (SetUp)
 *
 *  Applies to control OUT endpoints only.
 *
 *  Indicates that the SETUP phase for the control endpoint is
 *  complete and no more back-to-back SETUP packets were
 *  received for the current control transfer. On this interrupt, the
 *  application can decode the received SETUP data packet.
 */
#define USB_OTGHS_DOEPINT11_SETUP    (BIT(3))
#define USB_OTGHS_DOEPINT11_SETUP_M  (USB_OTGHS_DOEPINT11_SETUP_V << USB_OTGHS_DOEPINT11_SETUP_S)
#define USB_OTGHS_DOEPINT11_SETUP_V  0x00000001U
#define USB_OTGHS_DOEPINT11_SETUP_S  3
/** USB_OTGHS_DOEPINT11_OUTTKNEPDIS : R/W; bitpos: [4]; default: 0;
 *  OUT Token Received When Endpoint Disabled (OUTTknEPdis)
 *
 *  Applies only to control OUT endpoints.
 *
 *  Indicates that an OUT token was received when the endpoint was not yet enabled.
 *  This interrupt is asserted on the endpoint for which the OUT token was received.
 */
#define USB_OTGHS_DOEPINT11_OUTTKNEPDIS    (BIT(4))
#define USB_OTGHS_DOEPINT11_OUTTKNEPDIS_M  (USB_OTGHS_DOEPINT11_OUTTKNEPDIS_V << USB_OTGHS_DOEPINT11_OUTTKNEPDIS_S)
#define USB_OTGHS_DOEPINT11_OUTTKNEPDIS_V  0x00000001U
#define USB_OTGHS_DOEPINT11_OUTTKNEPDIS_S  4
/** USB_OTGHS_DOEPINT11_STSPHSERCVD : R/W; bitpos: [5]; default: 0;
 *  Status Phase Received for Control Write (StsPhseRcvd)
 *
 *  This interrupt is valid only for Control OUT endpoints.
 *
 *  This interrupt is generated only after the core has transferred all
 *  the data that the host has sent during the data phase of a control
 *  write transfer, to the system memory buffer.
 *
 *  The interrupt indicates to the application that the host has
 *  switched from data phase to the status phase of a Control Write
 *  transfer. The application can use this interrupt to ACK or STALL
 *  the Status phase, after it has decoded the data phase.
 */
#define USB_OTGHS_DOEPINT11_STSPHSERCVD    (BIT(5))
#define USB_OTGHS_DOEPINT11_STSPHSERCVD_M  (USB_OTGHS_DOEPINT11_STSPHSERCVD_V << USB_OTGHS_DOEPINT11_STSPHSERCVD_S)
#define USB_OTGHS_DOEPINT11_STSPHSERCVD_V  0x00000001U
#define USB_OTGHS_DOEPINT11_STSPHSERCVD_S  5
/** USB_OTGHS_DOEPINT11_BACK2BACKSETUP : R/W; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received (Back2BackSETup)
 *
 *  Applies to Control OUT endpoints only.
 *
 *  This bit indicates that the core has received more than three
 *  back-to-back SETUP packets for this particular endpoint. For
 *  information about handling this interrupt,
 */
#define USB_OTGHS_DOEPINT11_BACK2BACKSETUP    (BIT(6))
#define USB_OTGHS_DOEPINT11_BACK2BACKSETUP_M  (USB_OTGHS_DOEPINT11_BACK2BACKSETUP_V << USB_OTGHS_DOEPINT11_BACK2BACKSETUP_S)
#define USB_OTGHS_DOEPINT11_BACK2BACKSETUP_V  0x00000001U
#define USB_OTGHS_DOEPINT11_BACK2BACKSETUP_S  6
/** USB_OTGHS_DOEPINT11_OUTPKTERR : R/W; bitpos: [8]; default: 0;
 *  OUT Packet Error (OutPktErr)
 *
 *  Applies to OUT endpoints Only
 *
 *  This interrupt is valid only when thresholding is enabled. This interrupt is
 *  asserted when the
 *  core detects an overflow or a CRC error for non-Isochronous OUT packet.
 */
#define USB_OTGHS_DOEPINT11_OUTPKTERR    (BIT(8))
#define USB_OTGHS_DOEPINT11_OUTPKTERR_M  (USB_OTGHS_DOEPINT11_OUTPKTERR_V << USB_OTGHS_DOEPINT11_OUTPKTERR_S)
#define USB_OTGHS_DOEPINT11_OUTPKTERR_V  0x00000001U
#define USB_OTGHS_DOEPINT11_OUTPKTERR_S  8
/** USB_OTGHS_DOEPINT11_BNAINTR : R/W; bitpos: [9]; default: 0;
 *  BNA (Buffer Not Available) Interrupt (BNAIntr)
 *
 *  This bit is valid only when Scatter/Gather DMA mode is enabled.
 *
 *  The core generates this interrupt when the descriptor accessed
 *  is not ready for the Core to process, such as Host busy or DMA
 *  done
 */
#define USB_OTGHS_DOEPINT11_BNAINTR    (BIT(9))
#define USB_OTGHS_DOEPINT11_BNAINTR_M  (USB_OTGHS_DOEPINT11_BNAINTR_V << USB_OTGHS_DOEPINT11_BNAINTR_S)
#define USB_OTGHS_DOEPINT11_BNAINTR_V  0x00000001U
#define USB_OTGHS_DOEPINT11_BNAINTR_S  9
/** USB_OTGHS_DOEPINT11_PKTDRPSTS : R/W; bitpos: [11]; default: 0;
 *  Packet Drop Status (PktDrpSts)
 *
 *  This bit indicates to the application that an ISOC OUT packet has been dropped. This
 *  bit does not have an associated mask bit and does not generate an interrupt.
 *
 *  Dependency: This bit is valid in non Scatter/Gather DMA mode when periodic transfer
 *  interrupt feature is selected.
 */
#define USB_OTGHS_DOEPINT11_PKTDRPSTS    (BIT(11))
#define USB_OTGHS_DOEPINT11_PKTDRPSTS_M  (USB_OTGHS_DOEPINT11_PKTDRPSTS_V << USB_OTGHS_DOEPINT11_PKTDRPSTS_S)
#define USB_OTGHS_DOEPINT11_PKTDRPSTS_V  0x00000001U
#define USB_OTGHS_DOEPINT11_PKTDRPSTS_S  11
/** USB_OTGHS_DOEPINT11_BBLEERR : R/W; bitpos: [12]; default: 0;
 *  NAK Interrupt (BbleErr)
 *
 *  The core generates this interrupt when babble is received for the endpoint.
 */
#define USB_OTGHS_DOEPINT11_BBLEERR    (BIT(12))
#define USB_OTGHS_DOEPINT11_BBLEERR_M  (USB_OTGHS_DOEPINT11_BBLEERR_V << USB_OTGHS_DOEPINT11_BBLEERR_S)
#define USB_OTGHS_DOEPINT11_BBLEERR_V  0x00000001U
#define USB_OTGHS_DOEPINT11_BBLEERR_S  12
/** USB_OTGHS_DOEPINT11_NAKINTRPT : R/W; bitpos: [13]; default: 0;
 *  NAK Interrupt (NAKInterrupt)
 *
 *  The core generates this interrupt when a NAK is transmitted or received by the
 *  device.
 *
 *  In case of isochronous IN endpoints the interrupt gets generated when a zero length
 *  packet is transmitted due to un-availability of data in the TXFifo.
 */
#define USB_OTGHS_DOEPINT11_NAKINTRPT    (BIT(13))
#define USB_OTGHS_DOEPINT11_NAKINTRPT_M  (USB_OTGHS_DOEPINT11_NAKINTRPT_V << USB_OTGHS_DOEPINT11_NAKINTRPT_S)
#define USB_OTGHS_DOEPINT11_NAKINTRPT_V  0x00000001U
#define USB_OTGHS_DOEPINT11_NAKINTRPT_S  13
/** USB_OTGHS_DOEPINT11_NYETINTRPT : R/W; bitpos: [14]; default: 0;
 *  NYET Interrupt (NYETIntrpt)
 *
 *  The core generates this interrupt when a NYET response is transmitted for a non
 *  isochronous OUT endpoint.
 */
#define USB_OTGHS_DOEPINT11_NYETINTRPT    (BIT(14))
#define USB_OTGHS_DOEPINT11_NYETINTRPT_M  (USB_OTGHS_DOEPINT11_NYETINTRPT_V << USB_OTGHS_DOEPINT11_NYETINTRPT_S)
#define USB_OTGHS_DOEPINT11_NYETINTRPT_V  0x00000001U
#define USB_OTGHS_DOEPINT11_NYETINTRPT_S  14
/** USB_OTGHS_DOEPINT11_STUPPKTRCVD : R/W; bitpos: [15]; default: 0;
 *  Setup Packet Received
 *
 *  Applicable for Control OUT Endpoints in only in the Buffer DMA Mode
 *
 *  Set by the controller, this bit indicates that this buffer holds 8 bytes of
 *  setup data. There is only one Setup packet per buffer. On receiving a
 *  Setup packet, the controller closes the buffer and disables the
 *  corresponding endpoint. The application has to re-enable the endpoint to
 *  receive any OUT data for the Control Transfer and reprogram the buffer
 *  start address.
 *
 *  Note: Because of the above behavior, the controller can receive any
 *  number of back to back setup packets and one buffer for every setup
 *  packet is used.
 *  - 1'b0: No Setup packet received
 *  - 1'b1: Setup packet received
 *  Reset: 1'b0
 */
#define USB_OTGHS_DOEPINT11_STUPPKTRCVD    (BIT(15))
#define USB_OTGHS_DOEPINT11_STUPPKTRCVD_M  (USB_OTGHS_DOEPINT11_STUPPKTRCVD_V << USB_OTGHS_DOEPINT11_STUPPKTRCVD_S)
#define USB_OTGHS_DOEPINT11_STUPPKTRCVD_V  0x00000001U
#define USB_OTGHS_DOEPINT11_STUPPKTRCVD_S  15

/** USB_OTGHS_DOEPTSIZ11_REG register
 *  This register contains the Transfer Size for the OUT Endpoint 11 of the Device
 *  controller.
 */
#define USB_OTGHS_DOEPTSIZ11_REG (DR_REG_USB_OTGHS_BASE + 0xc70)
/** USB_OTGHS_DOEPTSIZ11_XFERSIZE : R/W; bitpos: [18:0]; default: 0;
 *  Transfer Size (XferSize)
 *
 *  Indicates the transfer size in bytes for the endpoint. The core
 *  interrupts the application only after it has exhausted the transfer
 *  size amount of data. The transfer size can be Set to the
 *  maximum packet size of the endpoint, to be interrupted at the
 *  end of each packet.
 *
 *  The core decrements this field every time a packet is read from
 *  the RxFIFO and written to the external memory.
 */
#define USB_OTGHS_DOEPTSIZ11_XFERSIZE    0x0007FFFFU
#define USB_OTGHS_DOEPTSIZ11_XFERSIZE_M  (USB_OTGHS_DOEPTSIZ11_XFERSIZE_V << USB_OTGHS_DOEPTSIZ11_XFERSIZE_S)
#define USB_OTGHS_DOEPTSIZ11_XFERSIZE_V  0x0007FFFFU
#define USB_OTGHS_DOEPTSIZ11_XFERSIZE_S  0
/** USB_OTGHS_DOEPTSIZ11_PKTCNT : R/W; bitpos: [28:19]; default: 0;
 *  Packet Count (PktCnt)
 *  This field is decremented to zero after a packet is written into the RxFIFO.
 */
#define USB_OTGHS_DOEPTSIZ11_PKTCNT    0x000003FFU
#define USB_OTGHS_DOEPTSIZ11_PKTCNT_M  (USB_OTGHS_DOEPTSIZ11_PKTCNT_V << USB_OTGHS_DOEPTSIZ11_PKTCNT_S)
#define USB_OTGHS_DOEPTSIZ11_PKTCNT_V  0x000003FFU
#define USB_OTGHS_DOEPTSIZ11_PKTCNT_S  19
/** USB_OTGHS_DOEPTSIZ11_RXDPID : RO; bitpos: [30:29]; default: 0;
 *  RxDPID
 *
 *  Applies to isochronous OUT endpoints only.
 *
 *  This is the data PID received in the last packet for this endpoint.
 *  - 2'b00: DATA0
 *  - 2'b01: DATA2
 *  - 2'b10: DATA1
 *  - 2'b11: MDATA
 *  SETUP Packet Count (SUPCnt)
 *
 *  Applies to control OUT Endpoints only.
 *
 *  This field specifies the number of back-to-back SETUP data
 *  packets the endpoint can receive.
 *  - 2'b01: 1 packet
 *  - 2'b10: 2 packets
 *  - 2'b11: 3 packets
 */
#define USB_OTGHS_DOEPTSIZ11_RXDPID    0x00000003U
#define USB_OTGHS_DOEPTSIZ11_RXDPID_M  (USB_OTGHS_DOEPTSIZ11_RXDPID_V << USB_OTGHS_DOEPTSIZ11_RXDPID_S)
#define USB_OTGHS_DOEPTSIZ11_RXDPID_V  0x00000003U
#define USB_OTGHS_DOEPTSIZ11_RXDPID_S  29

