espressif/esp-idf/components/soc/esp32s31/register/soc/usb_otghs_reg.h
/** USB_OTGHS_DOEPINT12_REG register
 *  This register contains the interrupts for the OUT Endpoint 12 of the Device
 *  controller.
 */
#define USB_OTGHS_DOEPINT12_REG (DR_REG_USB_OTGHS_BASE + 0xc88)
/** USB_OTGHS_DOEPINT12_XFERCOMPL : R/W; bitpos: [0]; default: 0;
 *  Transfer Completed Interrupt (XferCompl)
 *
 *  Applies to IN and OUT endpoints.
 *  - When Scatter/Gather DMA mode is enabled
 *  -- For IN endpoint this field indicates that the requested data from the descriptor
 *  is moved from external system memory to internal FIFO.
 *  -- For OUT endpoint this field indicates that the requested data from the internal
 *  FIFO is moved to external system memory. This interrupt is generated only when the
 *  corresponding endpoint descriptor is closed, and the IOC bit for the corresponding
 *  descriptor is Set.
 *  - When Scatter/Gather DMA mode is disabled, this field indicates that the
 *  programmed transfer is complete on the AHB as well as on the USB, for this endpoint.
 */
#define USB_OTGHS_DOEPINT12_XFERCOMPL    (BIT(0))
#define USB_OTGHS_DOEPINT12_XFERCOMPL_M  (USB_OTGHS_DOEPINT12_XFERCOMPL_V << USB_OTGHS_DOEPINT12_XFERCOMPL_S)
#define USB_OTGHS_DOEPINT12_XFERCOMPL_V  0x00000001U
#define USB_OTGHS_DOEPINT12_XFERCOMPL_S  0
/** USB_OTGHS_DOEPINT12_EPDISBLD : R/W; bitpos: [1]; default: 0;
 *  Endpoint Disabled Interrupt (EPDisbld)
 *
 *  Applies to IN and OUT endpoints.
 *
 *  This bit indicates that the endpoint is disabled per the application's request.
 */
#define USB_OTGHS_DOEPINT12_EPDISBLD    (BIT(1))
#define USB_OTGHS_DOEPINT12_EPDISBLD_M  (USB_OTGHS_DOEPINT12_EPDISBLD_V << USB_OTGHS_DOEPINT12_EPDISBLD_S)
#define USB_OTGHS_DOEPINT12_EPDISBLD_V  0x00000001U
#define USB_OTGHS_DOEPINT12_EPDISBLD_S  1
/** USB_OTGHS_DOEPINT12_AHBERR : R/W; bitpos: [2]; default: 0;
 *  AHB Error (AHBErr)
 *
 *  Applies to IN and OUT endpoints.
 *
 *  This is generated only in Internal DMA mode when there is an AHB error during an
 *  AHB read/write. The application can read the corresponding endpoint DMA address
 *  register to get the error address. For details, see AHB Error Handling section in
 *  the Programming Guide.
 */
#define USB_OTGHS_DOEPINT12_AHBERR    (BIT(2))
#define USB_OTGHS_DOEPINT12_AHBERR_M  (USB_OTGHS_DOEPINT12_AHBERR_V << USB_OTGHS_DOEPINT12_AHBERR_S)
#define USB_OTGHS_DOEPINT12_AHBERR_V  0x00000001U
#define USB_OTGHS_DOEPINT12_AHBERR_S  2
/** USB_OTGHS_DOEPINT12_SETUP : R/W; bitpos: [3]; default: 0;
 *  SETUP Phase Done (SetUp)
 *
 *  Applies to control OUT endpoints only.
 *
 *  Indicates that the SETUP phase for the control endpoint is
 *  complete and no more back-to-back SETUP packets were
 *  received for the current control transfer. On this interrupt, the
 *  application can decode the received SETUP data packet.
 */
#define USB_OTGHS_DOEPINT12_SETUP    (BIT(3))
#define USB_OTGHS_DOEPINT12_SETUP_M  (USB_OTGHS_DOEPINT12_SETUP_V << USB_OTGHS_DOEPINT12_SETUP_S)
#define USB_OTGHS_DOEPINT12_SETUP_V  0x00000001U
#define USB_OTGHS_DOEPINT12_SETUP_S  3
/** USB_OTGHS_DOEPINT12_OUTTKNEPDIS : R/W; bitpos: [4]; default: 0;
 *  OUT Token Received When Endpoint Disabled (OUTTknEPdis)
 *
 *  Applies only to control OUT endpoints.
 *
 *  Indicates that an OUT token was received when the endpoint was not yet enabled.
 *  This interrupt is asserted on the endpoint for which the OUT token was received.
 */
#define USB_OTGHS_DOEPINT12_OUTTKNEPDIS    (BIT(4))
#define USB_OTGHS_DOEPINT12_OUTTKNEPDIS_M  (USB_OTGHS_DOEPINT12_OUTTKNEPDIS_V << USB_OTGHS_DOEPINT12_OUTTKNEPDIS_S)
#define USB_OTGHS_DOEPINT12_OUTTKNEPDIS_V  0x00000001U
#define USB_OTGHS_DOEPINT12_OUTTKNEPDIS_S  4
/** USB_OTGHS_DOEPINT12_STSPHSERCVD : R/W; bitpos: [5]; default: 0;
 *  Status Phase Received for Control Write (StsPhseRcvd)
 *
 *  This interrupt is valid only for Control OUT endpoints.
 *
 *  This interrupt is generated only after the core has transferred all
 *  the data that the host has sent during the data phase of a control
 *  write transfer, to the system memory buffer.
 *
 *  The interrupt indicates to the application that the host has
 *  switched from data phase to the status phase of a Control Write
 *  transfer. The application can use this interrupt to ACK or STALL
 *  the Status phase, after it has decoded the data phase.
 */
#define USB_OTGHS_DOEPINT12_STSPHSERCVD    (BIT(5))
#define USB_OTGHS_DOEPINT12_STSPHSERCVD_M  (USB_OTGHS_DOEPINT12_STSPHSERCVD_V << USB_OTGHS_DOEPINT12_STSPHSERCVD_S)
#define USB_OTGHS_DOEPINT12_STSPHSERCVD_V  0x00000001U
#define USB_OTGHS_DOEPINT12_STSPHSERCVD_S  5
/** USB_OTGHS_DOEPINT12_BACK2BACKSETUP : R/W; bitpos: [6]; default: 0;
 *  Back-to-Back SETUP Packets Received (Back2BackSETup)
 *
 *  Applies to Control OUT endpoints only.
 *
 *  This bit indicates that the core has received more than three
 *  back-to-back SETUP packets for this particular endpoint. For
 *  information about handling this interrupt,
 */
#define USB_OTGHS_DOEPINT12_BACK2BACKSETUP    (BIT(6))
#define USB_OTGHS_DOEPINT12_BACK2BACKSETUP_M  (USB_OTGHS_DOEPINT12_BACK2BACKSETUP_V << USB_OTGHS_DOEPINT12_BACK2BACKSETUP_S)
#define USB_OTGHS_DOEPINT12_BACK2BACKSETUP_V  0x00000001U
#define USB_OTGHS_DOEPINT12_BACK2BACKSETUP_S  6
/** USB_OTGHS_DOEPINT12_OUTPKTERR : R/W; bitpos: [8]; default: 0;
 *  OUT Packet Error (OutPktErr)
 *
 *  Applies to OUT endpoints Only
 *
 *  This interrupt is valid only when thresholding is enabled. This interrupt is
 *  asserted when the
 *  core detects an overflow or a CRC error for non-Isochronous OUT packet.
 */
#define USB_OTGHS_DOEPINT12_OUTPKTERR    (BIT(8))
#define USB_OTGHS_DOEPINT12_OUTPKTERR_M  (USB_OTGHS_DOEPINT12_OUTPKTERR_V << USB_OTGHS_DOEPINT12_OUTPKTERR_S)
#define USB_OTGHS_DOEPINT12_OUTPKTERR_V  0x00000001U
#define USB_OTGHS_DOEPINT12_OUTPKTERR_S  8
/** USB_OTGHS_DOEPINT12_BNAINTR : R/W; bitpos: [9]; default: 0;
 *  BNA (Buffer Not Available) Interrupt (BNAIntr)
 *
 *  This bit is valid only when Scatter/Gather DMA mode is enabled.
 *
 *  The core generates this interrupt when the descriptor accessed
 *  is not ready for the Core to process, such as Host busy or DMA
 *  done
 */
#define USB_OTGHS_DOEPINT12_BNAINTR    (BIT(9))
#define USB_OTGHS_DOEPINT12_BNAINTR_M  (USB_OTGHS_DOEPINT12_BNAINTR_V << USB_OTGHS_DOEPINT12_BNAINTR_S)
#define USB_OTGHS_DOEPINT12_BNAINTR_V  0x00000001U
#define USB_OTGHS_DOEPINT12_BNAINTR_S  9
/** USB_OTGHS_DOEPINT12_PKTDRPSTS : R/W; bitpos: [11]; default: 0;
 *  Packet Drop Status (PktDrpSts)
 *
 *  This bit indicates to the application that an ISOC OUT packet has been dropped. This
 *  bit does not have an associated mask bit and does not generate an interrupt.
 *
 *  Dependency: This bit is valid in non Scatter/Gather DMA mode when periodic transfer
 *  interrupt feature is selected.
 */
#define USB_OTGHS_DOEPINT12_PKTDRPSTS    (BIT(11))
#define USB_OTGHS_DOEPINT12_PKTDRPSTS_M  (USB_OTGHS_DOEPINT12_PKTDRPSTS_V << USB_OTGHS_DOEPINT12_PKTDRPSTS_S)
#define USB_OTGHS_DOEPINT12_PKTDRPSTS_V  0x00000001U
#define USB_OTGHS_DOEPINT12_PKTDRPSTS_S  11
/** USB_OTGHS_DOEPINT12_BBLEERR : R/W; bitpos: [12]; default: 0;
 *  NAK Interrupt (BbleErr)
 *
 *  The core generates this interrupt when babble is received for the endpoint.
 */
#define USB_OTGHS_DOEPINT12_BBLEERR    (BIT(12))
#define USB_OTGHS_DOEPINT12_BBLEERR_M  (USB_OTGHS_DOEPINT12_BBLEERR_V << USB_OTGHS_DOEPINT12_BBLEERR_S)
#define USB_OTGHS_DOEPINT12_BBLEERR_V  0x00000001U
#define USB_OTGHS_DOEPINT12_BBLEERR_S  12
/** USB_OTGHS_DOEPINT12_NAKINTRPT : R/W; bitpos: [13]; default: 0;
 *  NAK Interrupt (NAKInterrupt)
 *
 *  The core generates this interrupt when a NAK is transmitted or received by the
 *  device.
 *
 *  In case of isochronous IN endpoints the interrupt gets generated when a zero length
 *  packet is transmitted due to un-availability of data in the TXFifo.
 */
#define USB_OTGHS_DOEPINT12_NAKINTRPT    (BIT(13))
#define USB_OTGHS_DOEPINT12_NAKINTRPT_M  (USB_OTGHS_DOEPINT12_NAKINTRPT_V << USB_OTGHS_DOEPINT12_NAKINTRPT_S)
#define USB_OTGHS_DOEPINT12_NAKINTRPT_V  0x00000001U
#define USB_OTGHS_DOEPINT12_NAKINTRPT_S  13
/** USB_OTGHS_DOEPINT12_NYETINTRPT : R/W; bitpos: [14]; default: 0;
 *  NYET Interrupt (NYETIntrpt)
 *
 *  The core generates this interrupt when a NYET response is transmitted for a non
 *  isochronous OUT endpoint.
 */
#define USB_OTGHS_DOEPINT12_NYETINTRPT    (BIT(14))
#define USB_OTGHS_DOEPINT12_NYETINTRPT_M  (USB_OTGHS_DOEPINT12_NYETINTRPT_V << USB_OTGHS_DOEPINT12_NYETINTRPT_S)
#define USB_OTGHS_DOEPINT12_NYETINTRPT_V  0x00000001U
#define USB_OTGHS_DOEPINT12_NYETINTRPT_S  14
/** USB_OTGHS_DOEPINT12_STUPPKTRCVD : R/W; bitpos: [15]; default: 0;
 *  Setup Packet Received
 *
 *  Applicable for Control OUT Endpoints in only in the Buffer DMA Mode
 *
 *  Set by the controller, this bit indicates that this buffer holds 8 bytes of
 *  setup data. There is only one Setup packet per buffer. On receiving a
 *  Setup packet, the controller closes the buffer and disables the
 *  corresponding endpoint. The application has to re-enable the endpoint to
 *  receive any OUT data for the Control Transfer and reprogram the buffer
 *  start address.
 *
 *  Note: Because of the above behavior, the controller can receive any
 *  number of back to back setup packets and one buffer for every setup
 *  packet is used.
 *  - 1'b0: No Setup packet received
 *  - 1'b1: Setup packet received
 *  Reset: 1'b0
 */
#define USB_OTGHS_DOEPINT12_STUPPKTRCVD    (BIT(15))
#define USB_OTGHS_DOEPINT12_STUPPKTRCVD_M  (USB_OTGHS_DOEPINT12_STUPPKTRCVD_V << USB_OTGHS_DOEPINT12_STUPPKTRCVD_S)
#define USB_OTGHS_DOEPINT12_STUPPKTRCVD_V  0x00000001U
#define USB_OTGHS_DOEPINT12_STUPPKTRCVD_S  15

